[Killed] LogicalOperator
src/propositional/validators/is-implication-reversal-applicable.ts:39:3
 	}
 
 	if (
-		!Array.isArray(consequent.values) ||
-		consequent.operator !== Operator.Not ||
+		!Array.isArray(consequent.values) && consequent.operator !== Operator.Not ||
 		consequent.values.length !== 1
 	) {
killedBy: isImplicationReversalApplicable should return false if consequent is not a negation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
