[Killed] LogicalOperator
src/propositional/validators/is-well-formed-formula.ts:74:9
 	}
 
 	const result = parseWFF();
-	return result && index === expression.length; // Ensure full expression is parsed
+	return result || index === expression.length; // Ensure full expression is parsed
 }
 
killedBy: createPropFormula Error handling - Invalid formulas should throw an error for invalid expressions without parentheses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid propositional expression: Not a well-formed formula (WFF)."
Received message:   "Invalid formula structure."

      124 |       }
      125 |     }
    > 126 |     throw new Error("Invalid formula structure.");
