[Killed] ConditionalExpression
src/propositional/validators/is-implication-distribution-applicable.ts:29:3
 	// The second element (consequent) must be an implication (G => H)
 	const consequent = formula.values[1];
 	if (
-		!Array.isArray(consequent.values) ||
-		consequent.operator !== Operator.Implies ||
-		consequent.values.length !== 2
+		true
 	) {
 		return false;
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).
