[Timeout] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:54:7
 	function parseParenthesizedExpression(): boolean {
 		index++; // Consume "("
 
-		if (!parseWFF()) return false; // First WFF must exist
+		if (false) return false; // First WFF must exist
 
 		if (isEndOfExpression() || !isBinaryOperator(expression[index]))
