[Killed] BlockStatement
src/propositional/builders/create-prop-formula.ts:14:76
  * @throws {Error} If the expression is not a well-formed formula.
  * @category Builders
  */
-export function createPropFormula(expression: PropExpression): PropFormula {
-	if (!isWellFormedFormula(expression)) {
-		throw new Error(
-			"Invalid propositional expression: Not a well-formed formula (WFF).",
-		);
-	}
-
-	return parseExpression({ expression, start: 0, end: expression.length - 1 });
-}
+export function createPropFormula(expression: PropExpression): PropFormula {}
 
 export function parseExpression({
killedBy: NaturalProof addPremise should add a premise step at the current level
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:15:6
  * @category Builders
  */
 export function createPropFormula(expression: PropExpression): PropFormula {
-	if (!isWellFormedFormula(expression)) {
+	if (false) {
 		throw new Error(
 			"Invalid propositional expression: Not a well-formed formula (WFF).",
killedBy: createPropFormula Error handling - Invalid formulas should throw an error for invalid expressions without parentheses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid propositional expression: Not a well-formed formula (WFF)."
Received message:   "Invalid formula structure."

      124 |       }
      125 |     }
    > 126 |     throw new Error("Invalid formula structure.");

[Killed] BlockStatement
src/propositional/builders/create-prop-formula.ts:15:40
  * @category Builders
  */
 export function createPropFormula(expression: PropExpression): PropFormula {
-	if (!isWellFormedFormula(expression)) {
-		throw new Error(
-			"Invalid propositional expression: Not a well-formed formula (WFF).",
-		);
-	}
+	if (!isWellFormedFormula(expression)) {}
 
 	return parseExpression({ expression, start: 0, end: expression.length - 1 });
killedBy: createPropFormula Error handling - Invalid formulas should throw an error for invalid expressions without parentheses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid propositional expression: Not a well-formed formula (WFF)."
Received message:   "Invalid formula structure."

      124 |       }
      125 |     }
    > 126 |     throw new Error("Invalid formula structure.");

[Killed] BlockStatement
src/propositional/builders/create-prop-formula.ts:32:17
 	expression: PropExpression;
 	start: number;
 	end: number;
-}): PropFormula {
-	if (start > end) {
-		throw new Error(
-			`Unexpected expression boundaries: start=${start}, end=${end}`,
-		);
-	}
-
-	if (isSingleVariable(expression, start, end)) {
-		return parseVariable(expression[start]);
-	}
-
-	if (isNegation(expression, start)) {
-		return parseNegation(expression, start, end);
-	}
-
-	if (isParenthesized(expression, start, end)) {
-		return parseBinaryExpression(expression, start, end);
-	}
-
-	throw new Error("Invalid formula structure.");
-}
+}): PropFormula {}
 
 export function isSingleVariable(
killedBy: NaturalProof addPremise should add a premise step at the current level
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] BlockStatement
src/propositional/builders/create-prop-formula.ts:33:19
 	start: number;
 	end: number;
 }): PropFormula {
-	if (start > end) {
-		throw new Error(
-			`Unexpected expression boundaries: start=${start}, end=${end}`,
-		);
-	}
+	if (start > end) {}
 
 	if (isSingleVariable(expression, start, end)) {
killedBy: createPropFormula Error handling - Boundary validation should throw error when start > end (boundary violation)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Unexpected expression boundaries: start=5, end=2"
Received message:   "Cannot read properties of undefined (reading 'atom')"

      151 |   } else {
      152 |     stryCov_9fa48("57");
    > 153 |     return stryMutAct_9fa48("60") ? expression[start].atom[0] !== Glyph.Negation : stryMutAct_9fa48("59") ? false : stryMutAct_9fa48("58")

[Killed] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:33:6
 	start: number;
 	end: number;
 }): PropFormula {
-	if (start > end) {
+	if (false) {
 		throw new Error(
 			`Unexpected expression boundaries: start=${start}, end=${end}`,
killedBy: createPropFormula Error handling - Boundary validation should throw error when start > end (boundary violation)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Unexpected expression boundaries: start=5, end=2"
Received message:   "Cannot read properties of undefined (reading 'atom')"

      151 |   } else {
      152 |     stryCov_9fa48("57");
    > 153 |     return stryMutAct_9fa48("60") ? expression[start].atom[0] !== Glyph.Negation : stryMutAct_9fa48("59") ? false : stryMutAct_9fa48("58")

[Killed] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:39:6
 		);
 	}
 
-	if (isSingleVariable(expression, start, end)) {
+	if (true) {
 		return parseVariable(expression[start]);
 	}
killedBy: NaturalProof isComplete should return true for a simple implication proof with sub-proof
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/propositional/builders/create-prop-formula.ts:43:37
 		return parseVariable(expression[start]);
 	}
 
-	if (isNegation(expression, start)) {
-		return parseNegation(expression, start, end);
-	}
+	if (isNegation(expression, start)) {}
 
 	if (isParenthesized(expression, start, end)) {
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Invalid formula structure.

[Killed] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:43:6
 		return parseVariable(expression[start]);
 	}
 
-	if (isNegation(expression, start)) {
+	if (false) {
 		return parseNegation(expression, start, end);
 	}
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Invalid formula structure.

[Survived] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:47:6
 		return parseNegation(expression, start, end);
 	}
 
-	if (isParenthesized(expression, start, end)) {
+	if (true) {
 		return parseBinaryExpression(expression, start, end);
 	}

[Killed] LogicalOperator
src/propositional/builders/create-prop-formula.ts:59:9
 	start: number,
 	end: number,
 ): boolean {
-	return start === end && expression[start].type === GlyphType.Variable;
+	return start === end || expression[start].type === GlyphType.Variable;
 }
 
killedBy: createPropFormula Helper function: isSingleVariable should return false when type is not Variable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:59:9
 	start: number,
 	end: number,
 ): boolean {
-	return start === end && expression[start].type === GlyphType.Variable;
+	return true;
 }
 
killedBy: NaturalProof isComplete should return true for a simple implication proof with sub-proof
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/propositional/builders/create-prop-formula.ts:62:64
 	return start === end && expression[start].type === GlyphType.Variable;
 }
 
-export function parseVariable(symbol: PropSymbol): PropFormula {
-	return { operator: Operator.Var, values: symbol.atom };
-}
+export function parseVariable(symbol: PropSymbol): PropFormula {}
 
 export function isNegation(expression: PropExpression, start: number): boolean {
killedBy: NaturalProof addPremise should add a premise step at the current level
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] BlockStatement
src/propositional/builders/create-prop-formula.ts:66:80
 	return { operator: Operator.Var, values: symbol.atom };
 }
 
-export function isNegation(expression: PropExpression, start: number): boolean {
-	return expression[start].atom[0] === Glyph.Negation;
-}
+export function isNegation(expression: PropExpression, start: number): boolean {}
 
 export function parseNegation(
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Invalid formula structure.

[Killed] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:67:9
 }
 
 export function isNegation(expression: PropExpression, start: number): boolean {
-	return expression[start].atom[0] === Glyph.Negation;
+	return false;
 }
 
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Invalid formula structure.

[Killed] BlockStatement
src/propositional/builders/create-prop-formula.ts:74:16
 	expression: PropExpression,
 	start: number,
 	end: number,
-): PropFormula {
-	return {
-		operator: Operator.Not,
-		values: [parseExpression({ expression, start: start + 1, end })],
-	};
-}
+): PropFormula {}
 
 export function isParenthesized(
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] ArithmeticOperator
src/propositional/builders/create-prop-formula.ts:77:49
 ): PropFormula {
 	return {
 		operator: Operator.Not,
-		values: [parseExpression({ expression, start: start + 1, end })],
+		values: [parseExpression({ expression, start: start - 1, end })],
 	};
 }
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: TypeError: Cannot read properties of undefined (reading 'atom')

[Killed] ArrayDeclaration
src/propositional/builders/create-prop-formula.ts:77:11
 ): PropFormula {
 	return {
 		operator: Operator.Not,
-		values: [parseExpression({ expression, start: start + 1, end })],
+		values: [],
 	};
 }
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.

[Killed] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:87:3
 	end: number,
 ): boolean {
 	return (
-		expression[start].atom[0] === Glyph.OpenParenthesis &&
-		expression[end].atom[0] === Glyph.CloseParenthesis
+		true
 	);
 }
killedBy: createPropFormula Helper function: isParenthesized should return false when first element is not open paren
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:87:3
 	end: number,
 ): boolean {
 	return (
-		expression[start].atom[0] === Glyph.OpenParenthesis &&
+		true &&
 		expression[end].atom[0] === Glyph.CloseParenthesis
 	);
killedBy: createPropFormula Helper function: isParenthesized should return false when first element is not open paren
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:88:3
 ): boolean {
 	return (
 		expression[start].atom[0] === Glyph.OpenParenthesis &&
-		expression[end].atom[0] === Glyph.CloseParenthesis
+		true
 	);
 }
killedBy: createPropFormula Helper function: isParenthesized should return false when last element is not close paren
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/propositional/builders/create-prop-formula.ts:96:16
 	expression: PropExpression,
 	start: number,
 	end: number,
-): PropFormula {
-	const mainOperatorIndex = findMainOperator(expression, start, end);
-	if (mainOperatorIndex === -1) {
-		throw new Error("Could not determine the main operator.");
-	}
-
-	return {
-		operator: createOperator(expression[mainOperatorIndex]),
-		values: [
-			parseExpression({
-				expression,
-				start: start + 1,
-				end: mainOperatorIndex - 1,
-			}),
-			parseExpression({
-				expression,
-				start: mainOperatorIndex + 1,
-				end: end - 1,
-			}),
-		],
-	};
-}
+): PropFormula {}
 
 export function findMainOperator(
killedBy: NaturalProof isComplete should return false when still inside a sub-proof (level > 0)
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Survived] UnaryOperator
src/propositional/builders/create-prop-formula.ts:98:28
 	end: number,
 ): PropFormula {
 	const mainOperatorIndex = findMainOperator(expression, start, end);
-	if (mainOperatorIndex === -1) {
+	if (mainOperatorIndex === +1) {
 		throw new Error("Could not determine the main operator.");
 	}

[Survived] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:98:6
 	end: number,
 ): PropFormula {
 	const mainOperatorIndex = findMainOperator(expression, start, end);
-	if (mainOperatorIndex === -1) {
+	if (false) {
 		throw new Error("Could not determine the main operator.");
 	}

[Survived] EqualityOperator
src/propositional/builders/create-prop-formula.ts:126:22
 ): number {
 	let balance = 0;
 
-	for (let i = start; i <= end; i++) {
+	for (let i = start; i < end; i++) {
 		const symbol = expression[i];
 

[Killed] UpdateOperator
src/propositional/builders/create-prop-formula.ts:130:50
 		const symbol = expression[i];
 
 		if (symbol.atom[0] === Glyph.OpenParenthesis) balance++;
-		if (symbol.atom[0] === Glyph.CloseParenthesis) balance--;
+		if (symbol.atom[0] === Glyph.CloseParenthesis) balance++;
 
 		if (
killedBy: NaturalProof reiterateStep should handle reiteration with complex formulas
statusReason: Error: Could not determine the main operator.

[Timeout] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:130:7
 		const symbol = expression[i];
 
 		if (symbol.atom[0] === Glyph.OpenParenthesis) balance++;
-		if (symbol.atom[0] === Glyph.CloseParenthesis) balance--;
+		if (false) balance--;
 
 		if (

[Killed] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:133:4
 		if (symbol.atom[0] === Glyph.CloseParenthesis) balance--;
 
 		if (
-			balance === 1 &&
+			true &&
 			symbol.type === GlyphType.Operator &&
 			symbol.atom[0] !== Glyph.Negation
killedBy: NaturalProof reiterateStep should handle reiteration with complex formulas
statusReason: Error: Invalid formula structure.

[Killed] ConditionalExpression
src/propositional/builders/create-prop-formula.ts:135:4
 		if (
 			balance === 1 &&
 			symbol.type === GlyphType.Operator &&
-			symbol.atom[0] !== Glyph.Negation
+			true
 		) {
 			return i;
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Unexpected expression boundaries: start=1, end=0

[Killed] UnaryOperator
src/propositional/builders/create-prop-formula.ts:141:9
 		}
 	}
 
-	return -1; // Main operator not found
+	return +1; // Main operator not found
 }
 
killedBy: createPropFormula Helper function: findMainOperator should return -1 when no operator found at balance 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 1
