[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:35:33
 	 * Creates a new Natural Deduction proof with a goal formula.
 	 * @param goal - The target formula to prove
 	 */
-	constructor(goal: PropFormula) {
-		this.goal = goal;
-	}
+	constructor(goal: PropFormula) {}
 
 	/**
killedBy: NaturalProof constructor should create a new proof with a goal formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"operator": "IMPLIES", "values": [{"operator": "VAR", "values": ["A"]}, {"operator": "VAR", "values": ["B"]}]}
Received: undefined

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:43:39
 	 * Gets all proof steps in order.
 	 * @returns Array of proof steps
 	 */
-	getSteps(): readonly PropProofStep[] {
-		return Object.freeze([...this.steps]);
-	}
+	getSteps(): readonly PropProofStep[] {}
 
 	/**
killedBy: NaturalProof getSteps should return a frozen copy of all steps
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:51:25
 	 * Gets the goal formula of this proof.
 	 * @returns The target formula
 	 */
-	getGoal(): PropFormula {
-		return this.goal;
-	}
+	getGoal(): PropFormula {}
 
 	/**
killedBy: NaturalProof constructor should create a new proof with a goal formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"operator": "IMPLIES", "values": [{"operator": "VAR", "values": ["A"]}, {"operator": "VAR", "values": ["B"]}]}
Received: undefined

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:59:25
 	 * Gets the number of steps in the proof.
 	 * @returns The current step count
 	 */
-	getStepCount(): number {
-		return this.steps.length;
-	}
+	getStepCount(): number {}
 
 	/**
killedBy: NaturalProof constructor should create a new proof with a goal formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:68:52
 	 * @param index - The step number (1-based)
 	 * @returns The proof step, or undefined if not found
 	 */
-	getStep(index: number): PropProofStep | undefined {
-		return this.steps[index - 1];
-	}
+	getStep(index: number): PropProofStep | undefined {}
 
 	/**
killedBy: NaturalProof getStep should retrieve a specific step by 1-based index
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"operator": "VAR", "values": ["A"]}
Received: undefined

[Killed] ArithmeticOperator
propositional/natural-calculus/classes/natural-proof.ts:69:21
 	 * @returns The proof step, or undefined if not found
 	 */
 	getStep(index: number): PropProofStep | undefined {
-		return this.steps[index - 1];
+		return this.steps[index + 1];
 	}
 
killedBy: NaturalProof getStep should retrieve a specific step by 1-based index
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"operator": "VAR", "values": ["A"]}
Received: undefined

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:76:28
 	 * Gets the current nesting level for sub-proofs.
 	 * @returns The current level (0 = main proof, > 0 = inside assumption)
 	 */
-	getCurrentLevel(): number {
-		return this.currentLevel;
-	}
+	getCurrentLevel(): number {}
 
 	/**
killedBy: NaturalProof constructor should create a new proof with a goal formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:86:68
 	 * @param comment - Optional explanation for the premise
 	 * @returns The added proof step
 	 */
-	addPremise(formula: PropFormula, comment?: string): PropProofStep {
-		const steps = generateNaturalProofSteps({
-			index: this.steps.length + 1,
-			level: this.currentLevel,
-			step: Step.Premise,
-			payload: { formula } as NaturalBasePayload,
-		} as NaturalProofStepInput<Step.Premise>);
-
-		const step = steps[0];
-		if (comment) {
-			step.comment = comment;
-		}
-
-		this.steps.push(step);
-		return step;
-	}
+	addPremise(formula: PropFormula, comment?: string): PropProofStep {}
 
 	/**
killedBy: NaturalProof addPremise should add a premise step at the current level
statusReason: TypeError: Cannot read properties of undefined (reading 'index')

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:95:7
 		} as NaturalProofStepInput<Step.Premise>);
 
 		const step = steps[0];
-		if (comment) {
+		if (false) {
 			step.comment = comment;
 		}
killedBy: NaturalProof addPremise should add a premise step at the current level
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Given assumption"
Received: "Premise"

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:95:16
 		} as NaturalProofStepInput<Step.Premise>);
 
 		const step = steps[0];
-		if (comment) {
-			step.comment = comment;
-		}
+		if (comment) {}
 
 		this.steps.push(step);
killedBy: NaturalProof addPremise should add a premise step at the current level
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Given assumption"
Received: "Premise"

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:110:71
 	 * @param comment - Optional explanation for the assumption
 	 * @returns The added proof step
 	 */
-	addAssumption(formula: PropFormula, comment?: string): PropProofStep {
-		const nextLevel = this.currentLevel + 1;
-
-		const steps = generateNaturalProofSteps({
-			index: this.steps.length + 1,
-			level: nextLevel,
-			step: Step.Assumption,
-			payload: { formula } as NaturalBasePayload,
-		} as NaturalProofStepInput<Step.Assumption>);
-
-		const step = steps[0];
-		if (comment) {
-			step.comment = comment;
-		}
-
-		this.steps.push(step);
-		this.currentLevel = nextLevel;
-		return step;
-	}
+	addAssumption(formula: PropFormula, comment?: string): PropProofStep {}
 
 	/**
killedBy: NaturalProof addPremise should add premises at nested levels inside assumptions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
propositional/natural-calculus/classes/natural-proof.ts:111:21
 	 * @returns The added proof step
 	 */
 	addAssumption(formula: PropFormula, comment?: string): PropProofStep {
-		const nextLevel = this.currentLevel + 1;
+		const nextLevel = this.currentLevel - 1;
 
 		const steps = generateNaturalProofSteps({
killedBy: NaturalProof addPremise should add premises at nested levels inside assumptions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:140:21
 	addDerivedStep(
 		payload: NaturalDerivedPayload,
 		comment?: string,
-	): PropProofStep[] {
-		const newSteps = generateNaturalProofSteps({
-			index: this.steps.length + 1,
-			level: this.currentLevel,
-			step: Step.Derivation,
-			payload,
-		} as NaturalProofStepInput<Step.Derivation>);
-
-		newSteps.forEach((step) => {
-			if (comment) {
-				step.comment = comment;
-			}
-			this.steps.push(step);
-		});
-
-		return newSteps;
-	}
+	): PropProofStep[] {}
 
 	/**
killedBy: NaturalProof addDerivedStep should add a derived step at the current level
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:148:30
 			payload,
 		} as NaturalProofStepInput<Step.Derivation>);
 
-		newSteps.forEach((step) => {
-			if (comment) {
-				step.comment = comment;
-			}
-			this.steps.push(step);
-		});
+		newSteps.forEach((step) => {});
 
 		return newSteps;
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 5
Received:    4

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:149:8
 		} as NaturalProofStepInput<Step.Derivation>);
 
 		newSteps.forEach((step) => {
-			if (comment) {
+			if (true) {
 				step.comment = comment;
 			}
killedBy: NaturalProof addDerivedStep should add derived steps with custom comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CI: 1, 2"
Received: undefined

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:149:8
 		} as NaturalProofStepInput<Step.Derivation>);
 
 		newSteps.forEach((step) => {
-			if (comment) {
+			if (false) {
 				step.comment = comment;
 			}
killedBy: NaturalProofBuilder and functional proof generation NaturalProofBuilder fluent API should support complex fluent proof
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Conjunction of A and B"
Received: "CI: 1, 2"

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:169:7
 	reiterateStep(fromIndex: number, comment?: string): PropProofStep {
 		const sourceStep = this.getStep(fromIndex);
 
-		if (!sourceStep) {
+		if (true) {
 			throw new Error(`Cannot reiterate: step ${fromIndex} not found in proof`);
 		}
killedBy: NaturalProof reiterateStep should add a reiteration step with the formula from the source step
statusReason: Error: Cannot reiterate: step 1 not found in proof

[Killed] BooleanLiteral
propositional/natural-calculus/classes/natural-proof.ts:169:7
 	reiterateStep(fromIndex: number, comment?: string): PropProofStep {
 		const sourceStep = this.getStep(fromIndex);
 
-		if (!sourceStep) {
+		if (sourceStep) {
 			throw new Error(`Cannot reiterate: step ${fromIndex} not found in proof`);
 		}
killedBy: NaturalProof reiterateStep should add a reiteration step with the formula from the source step
statusReason: Error: Cannot reiterate: step 1 not found in proof

[Killed] LogicalOperator
propositional/natural-calculus/classes/natural-proof.ts:173:23
 			throw new Error(`Cannot reiterate: step ${fromIndex} not found in proof`);
 		}
 
-		const sourceLevel = sourceStep.level ?? 0;
+		const sourceLevel = sourceStep.level && 0;
 
 		if (sourceLevel >= this.currentLevel) {
killedBy: NaturalProof reiterateStep should throw error when trying to reiterate from the same level
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot reiterate: step 2 is at level 1, which is not outer to the current level 1"

Received function did not throw

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:175:7
 
 		const sourceLevel = sourceStep.level ?? 0;
 
-		if (sourceLevel >= this.currentLevel) {
+		if (true) {
 			throw new Error(
 				`Cannot reiterate: step ${fromIndex} is at level ${sourceLevel}, ` +
killedBy: NaturalProof reiterateStep should add a reiteration step with the formula from the source step
statusReason: Error: Cannot reiterate: step 1 is at level 0, which is not outer to the current level 1

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:175:41
 
 		const sourceLevel = sourceStep.level ?? 0;
 
-		if (sourceLevel >= this.currentLevel) {
-			throw new Error(
-				`Cannot reiterate: step ${fromIndex} is at level ${sourceLevel}, ` +
-					`which is not outer to the current level ${this.currentLevel}`,
-			);
-		}
+		if (sourceLevel >= this.currentLevel) {}
 
 		// Create a reiteration step at the current level with the same formula
killedBy: NaturalProof reiterateStep should throw error when trying to reiterate from the same level
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot reiterate: step 2 is at level 1, which is not outer to the current level 1"

Received function did not throw

[Killed] ArithmeticOperator
propositional/natural-calculus/classes/natural-proof.ts:184:11
 
 		// Create a reiteration step at the current level with the same formula
 		const step: PropProofStep = {
-			index: this.steps.length + 1,
+			index: this.steps.length - 1,
 			level: this.currentLevel,
 			step: Step.Reiteration,
killedBy: NaturalProof reiterateStep should increment step indices correctly for reiteration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArrayDeclaration
propositional/natural-calculus/classes/natural-proof.ts:190:17
 			formula: sourceStep.formula,
 			expression: sourceStep.expression,
 			stringView: sourceStep.stringView,
-			derivedFrom: [fromIndex],
+			derivedFrom: [],
 			comment: comment || `Reiteration: ${fromIndex}`,
 		};
killedBy: NaturalProof reiterateStep should add a reiteration step with the formula from the source step
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] LogicalOperator
propositional/natural-calculus/classes/natural-proof.ts:191:13
 			expression: sourceStep.expression,
 			stringView: sourceStep.stringView,
 			derivedFrom: [fromIndex],
-			comment: comment || `Reiteration: ${fromIndex}`,
+			comment: comment && `Reiteration: ${fromIndex}`,
 		};
 
killedBy: NaturalProof reiterateStep should use default comment format when no comment is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Reiteration: 1"
Received: undefined

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:191:13
 			expression: sourceStep.expression,
 			stringView: sourceStep.stringView,
 			derivedFrom: [fromIndex],
-			comment: comment || `Reiteration: ${fromIndex}`,
+			comment: true,
 		};
 
killedBy: NaturalProof reiterateStep should use default comment format when no comment is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Reiteration: 1"
Received: true

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:203:61
 	 * Used to identify the premise F when closing a sub-proof.
 	 * @returns The latest assumption step at the current level, or undefined if not found
 	 */
-	private findCurrentAssumption(): PropProofStep | undefined {
-		return [...this.steps]
-			.reverse()
-			.find(
-				(step) =>
-					step.level === this.currentLevel && step.step === Step.Assumption,
-			);
-	}
+	private findCurrentAssumption(): PropProofStep | undefined {}
 
 	/**
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: No assumption found at the current level for closing sub-proof

[Killed] MethodExpression
propositional/natural-calculus/classes/natural-proof.ts:204:10
 	 * @returns The latest assumption step at the current level, or undefined if not found
 	 */
 	private findCurrentAssumption(): PropProofStep | undefined {
-		return [...this.steps]
-			.reverse()
+		return [...this.steps]
 			.find(
 				(step) =>
killedBy: NaturalProof integration scenarios should handle multiple sub-proofs at the same level correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,11 +2,11 @@
    "operator": "IMPLIES",
    "values": Array [

[Killed] ArrowFunction
propositional/natural-calculus/classes/natural-proof.ts:207:5
 		return [...this.steps]
 			.reverse()
 			.find(
-				(step) =>
-					step.level === this.currentLevel && step.step === Step.Assumption,
+				() => undefined,
 			);
 	}
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: No assumption found at the current level for closing sub-proof

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:208:6
 			.reverse()
 			.find(
 				(step) =>
-					step.level === this.currentLevel && step.step === Step.Assumption,
+					true,
 			);
 	}
killedBy: NaturalProof isComplete should return true for a simple implication proof with sub-proof
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:208:6
 			.reverse()
 			.find(
 				(step) =>
-					step.level === this.currentLevel && step.step === Step.Assumption,
+					true && step.step === Step.Assumption,
 			);
 	}
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

@@ -1,12 +1,17 @@
  Object {
    "operator": "IMPLIES",

[Killed] EqualityOperator
propositional/natural-calculus/classes/natural-proof.ts:221:7
 	 * @returns The added proof step
 	 */
 	closeSubProof(comment?: string): PropProofStep {
-		if (this.currentLevel === 0) {
+		if (this.currentLevel !== 0) {
 			throw new Error("Cannot close sub-proof when already at level 0");
 		}
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: Cannot close sub-proof when already at level 0

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:221:32
 	 * @returns The added proof step
 	 */
 	closeSubProof(comment?: string): PropProofStep {
-		if (this.currentLevel === 0) {
-			throw new Error("Cannot close sub-proof when already at level 0");
-		}
+		if (this.currentLevel === 0) {}
 
 		// Find the most recent assumption at the current level (the assumption F)
killedBy: NaturalProof closeSubProof should throw an error when closing at level 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot close sub-proof when already at level 0"
Received message:   "No assumption found at the current level for closing sub-proof"

      342 |         } else {
      343 |           stryCov_9fa48("596");
    > 344 |           throw new Error("No assumption found at the current level for closing sub-proof");

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:228:7
 		// Find the most recent assumption at the current level (the assumption F)
 		const assumptionStep = this.findCurrentAssumption();
 
-		if (!assumptionStep) {
+		if (true) {
 			throw new Error(
 				"No assumption found at the current level for closing sub-proof",
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: No assumption found at the current level for closing sub-proof

[Killed] BooleanLiteral
propositional/natural-calculus/classes/natural-proof.ts:228:7
 		// Find the most recent assumption at the current level (the assumption F)
 		const assumptionStep = this.findCurrentAssumption();
 
-		if (!assumptionStep) {
+		if (assumptionStep) {
 			throw new Error(
 				"No assumption found at the current level for closing sub-proof",
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: No assumption found at the current level for closing sub-proof

[Killed] MethodExpression
propositional/natural-calculus/classes/natural-proof.ts:235:34
 		}
 
 		// Get the last step at the current level (the derived conclusion G)
-		const lastStepAtCurrentLevel = [...this.steps]
-			.reverse()
+		const lastStepAtCurrentLevel = [...this.steps]
 			.find((step) => step.level === this.currentLevel);
 
killedBy: NaturalProof isComplete should return true for a simple implication proof with sub-proof
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:237:20
 		// Get the last step at the current level (the derived conclusion G)
 		const lastStepAtCurrentLevel = [...this.steps]
 			.reverse()
-			.find((step) => step.level === this.currentLevel);
+			.find((step) => false);
 
 		if (!lastStepAtCurrentLevel) {
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: No steps found at the current level for closing sub-proof

[Killed] EqualityOperator
propositional/natural-calculus/classes/natural-proof.ts:237:20
 		// Get the last step at the current level (the derived conclusion G)
 		const lastStepAtCurrentLevel = [...this.steps]
 			.reverse()
-			.find((step) => step.level === this.currentLevel);
+			.find((step) => step.level !== this.currentLevel);
 
 		if (!lastStepAtCurrentLevel) {
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: No steps found at the current level for closing sub-proof

[Killed] BooleanLiteral
propositional/natural-calculus/classes/natural-proof.ts:239:7
 			.reverse()
 			.find((step) => step.level === this.currentLevel);
 
-		if (!lastStepAtCurrentLevel) {
+		if (lastStepAtCurrentLevel) {
 			throw new Error(
 				"No steps found at the current level for closing sub-proof",
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: No steps found at the current level for closing sub-proof

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:239:7
 			.reverse()
 			.find((step) => step.level === this.currentLevel);
 
-		if (!lastStepAtCurrentLevel) {
+		if (true) {
 			throw new Error(
 				"No steps found at the current level for closing sub-proof",
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: No steps found at the current level for closing sub-proof

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:258:16
 		} as NaturalProofStepInput<Step.Derivation>);
 
 		const newStep = newSteps[0];
-		if (comment) {
-			newStep.comment = comment;
-		}
+		if (comment) {}
 
 		this.steps.push(newStep);
killedBy: NaturalProof closeSubProof should add closing step with custom comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Custom explanation"
Received: "II: 2"

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:258:7
 		} as NaturalProofStepInput<Step.Derivation>);
 
 		const newStep = newSteps[0];
-		if (comment) {
+		if (false) {
 			newStep.comment = comment;
 		}
killedBy: NaturalProof closeSubProof should add closing step with custom comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Custom explanation"
Received: "II: 2"

[Killed] AssignmentOperator
propositional/natural-calculus/classes/natural-proof.ts:263:3
 		}
 
 		this.steps.push(newStep);
-		this.currentLevel -= 1;
+		this.currentLevel += 1;
 		return newStep;
 	}
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:271:43
 	 * Gets the last step in the proof.
 	 * @returns The final proof step, or undefined if no steps exist
 	 */
-	getLastStep(): PropProofStep | undefined {
-		return this.steps.at(-1);
-	}
+	getLastStep(): PropProofStep | undefined {}
 
 	/**
killedBy: NaturalProof getLastStep should return the last step added to the proof
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] UnaryOperator
propositional/natural-calculus/classes/natural-proof.ts:272:24
 	 * @returns The final proof step, or undefined if no steps exist
 	 */
 	getLastStep(): PropProofStep | undefined {
-		return this.steps.at(-1);
+		return this.steps.at(+1);
 	}
 
killedBy: NaturalProof getLastStep should return the most recently added step after closing sub-proofs
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 11
+ Received  +  0

  Object {
-   "operator": "IMPLIES",
-   "values": Array [

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:282:24
 	 * 2. All sub-proofs are closed (current level is 0)
 	 * @returns True if the proof is complete
 	 */
-	isComplete(): boolean {
-		if (this.steps.length === 0) {
-			return false;
-		}
-
-		// Check if we're back at the main level
-		if (this.currentLevel !== 0) {
-			return false;
-		}
-
-		const lastStep = this.getLastStep() as PropProofStep;
-
-		return arePropFormulasStructurallyEqual([lastStep.formula, this.goal]);
-	}
+	isComplete(): boolean {}
 
 	/**
killedBy: NaturalProof constructor should create a new proof with a goal formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] EqualityOperator
propositional/natural-calculus/classes/natural-proof.ts:283:7
 	 * @returns True if the proof is complete
 	 */
 	isComplete(): boolean {
-		if (this.steps.length === 0) {
+		if (this.steps.length !== 0) {
 			return false;
 		}
killedBy: NaturalProof constructor should create a new proof with a goal formula
statusReason: TypeError: Cannot read properties of undefined (reading 'formula')

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:283:7
 	 * @returns True if the proof is complete
 	 */
 	isComplete(): boolean {
-		if (this.steps.length === 0) {
+		if (false) {
 			return false;
 		}
killedBy: NaturalProof constructor should create a new proof with a goal formula
statusReason: TypeError: Cannot read properties of undefined (reading 'formula')

[Killed] BooleanLiteral
propositional/natural-calculus/classes/natural-proof.ts:284:11
 	 */
 	isComplete(): boolean {
 		if (this.steps.length === 0) {
-			return false;
+			return true;
 		}
 
killedBy: NaturalProof constructor should create a new proof with a goal formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
propositional/natural-calculus/classes/natural-proof.ts:288:7
 		}
 
 		// Check if we're back at the main level
-		if (this.currentLevel !== 0) {
+		if (true) {
 			return false;
 		}
killedBy: NaturalProof isComplete should return true when last formula equals goal and level is 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:288:32
 		}
 
 		// Check if we're back at the main level
-		if (this.currentLevel !== 0) {
-			return false;
-		}
+		if (this.currentLevel !== 0) {}
 
 		const lastStep = this.getLastStep() as PropProofStep;
killedBy: NaturalProof isComplete should return false when still inside a sub-proof (level > 0)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
propositional/natural-calculus/classes/natural-proof.ts:289:11
 
 		// Check if we're back at the main level
 		if (this.currentLevel !== 0) {
-			return false;
+			return true;
 		}
 
killedBy: NaturalProof isComplete should return false when still inside a sub-proof (level > 0)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:300:16
 	/**
 	 * Clears all steps from the proof and resets the level to 0.
 	 */
-	clear(): void {
-		this.steps = [];
-		this.currentLevel = 0;
-	}
+	clear(): void {}
 
 	/**
killedBy: NaturalProof clear should remove all steps from the proof
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:312:68
 	 * @param atom - The atomic proposition to replace
 	 * @param substitute - The formula or atom to substitute
 	 */
-	replace(atom: PropAtom, substitute: PropFormula | PropAtom): void {
-		this.steps.forEach((step) => {
-			const newFormula = replaceAtomInFormula({
-				formula: step.formula,
-				atom,
-				substitute,
-			});
-
-			// Update the formula and regenerate expression and stringView
-			step.formula = newFormula;
-			step.expression = convertPropFormulaToExpression(newFormula);
-			step.stringView = convertPropFormulaToString(newFormula);
-		});
-	}
+	replace(atom: PropAtom, substitute: PropFormula | PropAtom): void {}
 }
 
killedBy: NaturalProof replace should replace an atom in all proof steps
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not {"operator": "VAR", "values": ["A"]}

[Killed] BlockStatement
propositional/natural-calculus/classes/natural-proof.ts:313:32
 	 * @param substitute - The formula or atom to substitute
 	 */
 	replace(atom: PropAtom, substitute: PropFormula | PropAtom): void {
-		this.steps.forEach((step) => {
-			const newFormula = replaceAtomInFormula({
-				formula: step.formula,
-				atom,
-				substitute,
-			});
-
-			// Update the formula and regenerate expression and stringView
-			step.formula = newFormula;
-			step.expression = convertPropFormulaToExpression(newFormula);
-			step.stringView = convertPropFormulaToString(newFormula);
-		});
+		this.steps.forEach((step) => {});
 	}
 }
killedBy: NaturalProof replace should replace an atom in all proof steps
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not {"operator": "VAR", "values": ["A"]}
