[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:18:3
  */
 export function createOperator(symbol: PropSymbol): Operator {
 	switch (symbol.atom[0]) {
-		case Glyph.Negation:
-			return Operator.Not;
+		case Glyph.Negation:
 		case Glyph.Conjunction:
 			return Operator.And;
killedBy: createOperator should return Operator.Not for Negation glyph
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NOT"
Received: "AND"

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:20:3
 	switch (symbol.atom[0]) {
 		case Glyph.Negation:
 			return Operator.Not;
-		case Glyph.Conjunction:
-			return Operator.And;
+		case Glyph.Conjunction:
 		case Glyph.Disjunction:
 			return Operator.Or;
killedBy: createPropFormula Basic parsing should correctly parse a conjunction
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "operator": "AND",

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:22:3
 			return Operator.Not;
 		case Glyph.Conjunction:
 			return Operator.And;
-		case Glyph.Disjunction:
-			return Operator.Or;
+		case Glyph.Disjunction:
 		case Glyph.Implication:
 			return Operator.Implies;
killedBy: createPropFormula Basic parsing should correctly parse an equivalence
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -17,11 +17,11 @@
            ],
          },

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:24:3
 			return Operator.And;
 		case Glyph.Disjunction:
 			return Operator.Or;
-		case Glyph.Implication:
-			return Operator.Implies;
+		case Glyph.Implication:
 		case Glyph.ReversedImplication:
 			return Operator.ReversedImplies;
killedBy: NaturalProof isComplete should return true for a simple implication proof with sub-proof
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:26:3
 			return Operator.Or;
 		case Glyph.Implication:
 			return Operator.Implies;
-		case Glyph.ReversedImplication:
-			return Operator.ReversedImplies;
+		case Glyph.ReversedImplication:
 		case Glyph.Equivalence:
 			return Operator.Equiv;
killedBy: createOperator should return Operator.ReversedImplies for Reversed Implication glyph
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REVERSED_IMPLIES"
Received: "EQUIV"

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:28:3
 			return Operator.Implies;
 		case Glyph.ReversedImplication:
 			return Operator.ReversedImplies;
-		case Glyph.Equivalence:
-			return Operator.Equiv;
+		case Glyph.Equivalence:
 		case Glyph.ExclusiveConjunction:
 			return Operator.Xor;
killedBy: createPropFormula Basic parsing should correctly parse an equivalence
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "operator": "EQUIV",

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:30:3
 			return Operator.ReversedImplies;
 		case Glyph.Equivalence:
 			return Operator.Equiv;
-		case Glyph.ExclusiveConjunction:
-			return Operator.Xor;
+		case Glyph.ExclusiveConjunction:
 		case Glyph.ShefferStroke:
 			return Operator.Nand;
killedBy: createOperator should return Operator.Xor for Exclusive Conjunction (XOR) glyph
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "XOR"
Received: "NAND"

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:32:3
 			return Operator.Equiv;
 		case Glyph.ExclusiveConjunction:
 			return Operator.Xor;
-		case Glyph.ShefferStroke:
-			return Operator.Nand;
+		case Glyph.ShefferStroke:
 		case Glyph.WebbOperation:
 			return Operator.Nor;
killedBy: createOperator should return Operator.Nand for Sheffer Stroke (NAND) glyph
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NAND"
Received: "NOR"

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:34:3
 			return Operator.Xor;
 		case Glyph.ShefferStroke:
 			return Operator.Nand;
-		case Glyph.WebbOperation:
-			return Operator.Nor;
+		case Glyph.WebbOperation:
 		case Glyph.AntiImplication:
 			return Operator.AntiImplies;
killedBy: createOperator should return Operator.Nor for Webb Operation (NOR) glyph
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NOR"
Received: "ANTI_IMPLIES"

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:36:3
 			return Operator.Nand;
 		case Glyph.WebbOperation:
 			return Operator.Nor;
-		case Glyph.AntiImplication:
-			return Operator.AntiImplies;
+		case Glyph.AntiImplication:
 		case Glyph.ReversedAntiImplication:
 			return Operator.ReversedAntiImplies;
killedBy: createOperator should return Operator.AntiImplies for Anti-Implication glyph
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ANTI_IMPLIES"
Received: "REVERSED_ANTI_IMPLIES"

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:38:3
 			return Operator.Nor;
 		case Glyph.AntiImplication:
 			return Operator.AntiImplies;
-		case Glyph.ReversedAntiImplication:
-			return Operator.ReversedAntiImplies;
+		case Glyph.ReversedAntiImplication:
 		case Glyph.Contradiction:
 			return Operator.Contradiction;
killedBy: createOperator should return Operator.ReversedAntiImplies for Reversed Anti-Implication glyph
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REVERSED_ANTI_IMPLIES"
Received: "CONTRADICTION"

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:40:3
 			return Operator.AntiImplies;
 		case Glyph.ReversedAntiImplication:
 			return Operator.ReversedAntiImplies;
-		case Glyph.Contradiction:
-			return Operator.Contradiction;
+		case Glyph.Contradiction:
 		case Glyph.Tautology:
 			return Operator.Tautology;
killedBy: createOperator should return Operator.Contradiction for Contradiction glyph
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CONTRADICTION"
Received: "TAUTOLOGY"

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:42:3
 			return Operator.ReversedAntiImplies;
 		case Glyph.Contradiction:
 			return Operator.Contradiction;
-		case Glyph.Tautology:
-			return Operator.Tautology;
+		case Glyph.Tautology:
 		default:
 			if (symbol.type === GlyphType.Variable) {
killedBy: createOperator should return Operator.Tautology for Tautology glyph
statusReason: Error: Cannot create an operator from symbol "@".

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:44:3
 			return Operator.Contradiction;
 		case Glyph.Tautology:
 			return Operator.Tautology;
-		default:
-			if (symbol.type === GlyphType.Variable) {
-				return Operator.Var;
-			}
-			throw new Error(
-				`Cannot create an operator from symbol "${symbol.atom[0]}".`,
-			);
+		default:
 	}
 }
killedBy: createOperator should return Operator.Var for a variable type symbol
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "VAR"
Received: undefined

[Killed] BlockStatement
src/propositional/builders/create-operator.ts:45:44
 		case Glyph.Tautology:
 			return Operator.Tautology;
 		default:
-			if (symbol.type === GlyphType.Variable) {
-				return Operator.Var;
-			}
+			if (symbol.type === GlyphType.Variable) {}
 			throw new Error(
 				`Cannot create an operator from symbol "${symbol.atom[0]}".`,
killedBy: createOperator should return Operator.Var for a variable type symbol
statusReason: Error: Cannot create an operator from symbol "P".

[Killed] ConditionalExpression
src/propositional/builders/create-operator.ts:45:8
 		case Glyph.Tautology:
 			return Operator.Tautology;
 		default:
-			if (symbol.type === GlyphType.Variable) {
+			if (true) {
 				return Operator.Var;
 			}
killedBy: createOperator should throw an error for an unrecognized symbol that is not a variable
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot create an operator from symbol \"+\"."

Received function did not throw
