[Killed] Regex
src/propositional/builders/create-prop-symbol.ts:21:27
  */
 export function createPropSymbol(char: string, position: number): PropSymbol {
 	const knownGlyphs = Object.values(Glyph);
-	const onlyLatinLetters = /^[a-zA-Z]+$/;
+	const onlyLatinLetters = /^[a-zA-Z]$/;
 
 	if (char === Glyph.OpenParenthesis || char === Glyph.CloseParenthesis) {
killedBy: createPropSymbol should use only the first letter of a multi-character variable
statusReason: Error: Cannot create a propositional symbol from the character "XYZ".

[Survived] Regex
src/propositional/builders/create-prop-symbol.ts:21:27
  */
 export function createPropSymbol(char: string, position: number): PropSymbol {
 	const knownGlyphs = Object.values(Glyph);
-	const onlyLatinLetters = /^[a-zA-Z]+$/;
+	const onlyLatinLetters = /^[a-zA-Z]+/;
 
 	if (char === Glyph.OpenParenthesis || char === Glyph.CloseParenthesis) {

[Killed] ConditionalExpression
src/propositional/builders/create-prop-symbol.ts:23:40
 	const knownGlyphs = Object.values(Glyph);
 	const onlyLatinLetters = /^[a-zA-Z]+$/;
 
-	if (char === Glyph.OpenParenthesis || char === Glyph.CloseParenthesis) {
+	if (char === Glyph.OpenParenthesis || false) {
 		return {
 			position,
killedBy: NaturalProof reiterateStep should handle reiteration with complex formulas
statusReason: Error: Cannot create an operator from symbol ")".

[Killed] ConditionalExpression
src/propositional/builders/create-prop-symbol.ts:37:13
 			type: GlyphType.Operator,
 			view: getGlyphUnicode(char),
 		};
-	} else if (onlyLatinLetters.test(char)) {
+	} else if (true) {
 		const firstLetter = char[0].toLowerCase();
 
killedBy: createPropSymbol should throw an error for an invalid character
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot create a propositional symbol from the character \"+\"."

Received function did not throw

[Killed] MethodExpression
src/propositional/builders/create-prop-symbol.ts:38:23
 			view: getGlyphUnicode(char),
 		};
 	} else if (onlyLatinLetters.test(char)) {
-		const firstLetter = char[0].toLowerCase();
+		const firstLetter = char[0].toUpperCase();
 
 		return {
killedBy: createPropSymbol should create a variable symbol for "P"
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,7 +2,7 @@
    "atom": Array [
      "P",

[Killed] ArrayDeclaration
src/propositional/builders/create-prop-symbol.ts:42:10
 
 		return {
 			position,
-			atom: [char],
+			atom: [],
 			type: GlyphType.Variable,
 			view: firstLetter,
killedBy: NaturalProof addPremise should add a premise step at the current level
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/propositional/builders/create-prop-symbol.ts:46:9
 			type: GlyphType.Variable,
 			view: firstLetter,
 		};
-	} else {
-		throw new Error(
-			`Cannot create a propositional symbol from the character "${char}".`,
-		);
-	}
+	} else {}
 }
 
killedBy: createPropSymbol should throw an error for an invalid character
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot create a propositional symbol from the character \"+\"."

Received function did not throw
