[Killed] BlockStatement
src/propositional/converters/convert-prop-formula-to-expression.ts:19:45
 	const expression: PropExpression = [];
 	let position = 0;
 
-	function traverse(node: PropFormula): void {
-		const { operator, values } = node;
-
-		if (operator === Operator.Var) {
-			expression.push(createPropSymbol(values[0] as string, position++));
-			return;
-		}
-
-		expression.push(createPropSymbol("(", position++));
-
-		if (operator === Operator.Not) {
-			expression.push(createPropSymbol(getOperatorGlyph(operator), position++));
-			traverse((values as PropFormula[])[0]);
-		} else {
-			const [left, right] = values as PropFormula[];
-			traverse(left);
-			expression.push(createPropSymbol(getOperatorGlyph(operator), position++));
-			traverse(right);
-		}
-
-		expression.push(createPropSymbol(")", position++));
-	}
+	function traverse(node: PropFormula): void {}
 
 	traverse(formula);
killedBy: NaturalProof reiterateStep should properly set expression field from source step formula
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/propositional/converters/convert-prop-formula-to-expression.ts:22:7
 	function traverse(node: PropFormula): void {
 		const { operator, values } = node;
 
-		if (operator === Operator.Var) {
+		if (true) {
 			expression.push(createPropSymbol(values[0] as string, position++));
 			return;
killedBy: NaturalProof addDerivedStep should add a derived step at the current level
statusReason: Error: Cannot create a propositional symbol from the character "[object Object]".

[Killed] EqualityOperator
src/propositional/converters/convert-prop-formula-to-expression.ts:22:7
 	function traverse(node: PropFormula): void {
 		const { operator, values } = node;
 
-		if (operator === Operator.Var) {
+		if (operator !== Operator.Var) {
 			expression.push(createPropSymbol(values[0] as string, position++));
 			return;
killedBy: NaturalProof addPremise should add a premise step at the current level
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] UpdateOperator
src/propositional/converters/convert-prop-formula-to-expression.ts:23:58
 		const { operator, values } = node;
 
 		if (operator === Operator.Var) {
-			expression.push(createPropSymbol(values[0] as string, position++));
+			expression.push(createPropSymbol(values[0] as string, position--));
 			return;
 		}
killedBy: convertPropFormulaToExpression should convert string input to expression, expression to formula and back to the same expression
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  + 10

@@ -25,82 +25,82 @@
    },
    Object {

[Killed] UpdateOperator
src/propositional/converters/convert-prop-formula-to-expression.ts:27:41
 			return;
 		}
 
-		expression.push(createPropSymbol("(", position++));
+		expression.push(createPropSymbol("(", position--));
 
 		if (operator === Operator.Not) {
killedBy: convertPropFormulaToExpression should convert string input to expression, expression to formula and back to the same expression
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  + 12

@@ -9,98 +9,98 @@
    },
    Object {

[Killed] EqualityOperator
src/propositional/converters/convert-prop-formula-to-expression.ts:29:7
 
 		expression.push(createPropSymbol("(", position++));
 
-		if (operator === Operator.Not) {
+		if (operator !== Operator.Not) {
 			expression.push(createPropSymbol(getOperatorGlyph(operator), position++));
 			traverse((values as PropFormula[])[0]);
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.

[Killed] ConditionalExpression
src/propositional/converters/convert-prop-formula-to-expression.ts:29:7
 
 		expression.push(createPropSymbol("(", position++));
 
-		if (operator === Operator.Not) {
+		if (false) {
 			expression.push(createPropSymbol(getOperatorGlyph(operator), position++));
 			traverse((values as PropFormula[])[0]);
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.

[Survived] UpdateOperator
src/propositional/converters/convert-prop-formula-to-expression.ts:30:65
 		expression.push(createPropSymbol("(", position++));
 
 		if (operator === Operator.Not) {
-			expression.push(createPropSymbol(getOperatorGlyph(operator), position++));
+			expression.push(createPropSymbol(getOperatorGlyph(operator), position--));
 			traverse((values as PropFormula[])[0]);
 		} else {

[Killed] BlockStatement
src/propositional/converters/convert-prop-formula-to-expression.ts:32:10
 		if (operator === Operator.Not) {
 			expression.push(createPropSymbol(getOperatorGlyph(operator), position++));
 			traverse((values as PropFormula[])[0]);
-		} else {
-			const [left, right] = values as PropFormula[];
-			traverse(left);
-			expression.push(createPropSymbol(getOperatorGlyph(operator), position++));
-			traverse(right);
-		}
+		} else {}
 
 		expression.push(createPropSymbol(")", position++));
killedBy: convertPropFormulaToExpression should convert a binary formula (A → B)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    "(",
-   "a",

[Killed] UpdateOperator
src/propositional/converters/convert-prop-formula-to-expression.ts:35:65
 		} else {
 			const [left, right] = values as PropFormula[];
 			traverse(left);
-			expression.push(createPropSymbol(getOperatorGlyph(operator), position++));
+			expression.push(createPropSymbol(getOperatorGlyph(operator), position--));
 			traverse(right);
 		}
killedBy: convertPropFormulaToExpression should convert string input to expression, expression to formula and back to the same expression
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 9

@@ -33,74 +33,74 @@
    },
    Object {

[Killed] UpdateOperator
src/propositional/converters/convert-prop-formula-to-expression.ts:39:41
 			traverse(right);
 		}
 
-		expression.push(createPropSymbol(")", position++));
+		expression.push(createPropSymbol(")", position--));
 	}
 
killedBy: convertPropFormulaToExpression should convert string input to expression, expression to formula and back to the same expression
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 7

@@ -49,58 +49,58 @@
    },
    Object {
