[Killed] BlockStatement
src/propositional/converters/convert-prop-formula-to-string.ts:12:74
  * @returns {string} The string representation of the formula using Unicode glyphs.
  * @category Converters
  */
-export function convertPropFormulaToString(formula: PropFormula): string {
-	if (formula.operator === Operator.Var) {
-		return formula.values[0] as string;
-	}
-
-	const glyph = getGlyphUnicode(getOperatorGlyph(formula.operator));
-	const subFormulas = formula.values as PropFormula[];
-	const values = subFormulas.map(convertPropFormulaToString);
-
-	if (formula.operator === Operator.Not) {
-		return `${glyph}${values[0]}`;
-	}
-
-	const glyphSpace = ` ${glyph} `;
-
-	return `(${values.join(glyphSpace)})`;
-}
+export function convertPropFormulaToString(formula: PropFormula): string {}
 
killedBy: NaturalProof replace should replace an atom in all proof steps
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not undefined

[Killed] ConditionalExpression
src/propositional/converters/convert-prop-formula-to-string.ts:13:6
  * @category Converters
  */
 export function convertPropFormulaToString(formula: PropFormula): string {
-	if (formula.operator === Operator.Var) {
+	if (false) {
 		return formula.values[0] as string;
 	}
killedBy: NaturalProof addPremise should add a premise step at the current level
statusReason: Error: Cannot convert operator "VAR" to a glyph.

[Killed] ConditionalExpression
src/propositional/converters/convert-prop-formula-to-string.ts:13:6
  * @category Converters
  */
 export function convertPropFormulaToString(formula: PropFormula): string {
-	if (formula.operator === Operator.Var) {
+	if (true) {
 		return formula.values[0] as string;
 	}
killedBy: NaturalProof replace should replace atoms in complex formulas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(B → B)"
Received: {"operator": "VAR", "values": ["B"]}

[Killed] EqualityOperator
src/propositional/converters/convert-prop-formula-to-string.ts:21:6
 	const subFormulas = formula.values as PropFormula[];
 	const values = subFormulas.map(convertPropFormulaToString);
 
-	if (formula.operator === Operator.Not) {
+	if (formula.operator !== Operator.Not) {
 		return `${glyph}${values[0]}`;
 	}
killedBy: NaturalProof replace should replace atoms in complex formulas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(B → B)"
Received: "→B"

[Killed] ConditionalExpression
src/propositional/converters/convert-prop-formula-to-string.ts:21:6
 	const subFormulas = formula.values as PropFormula[];
 	const values = subFormulas.map(convertPropFormulaToString);
 
-	if (formula.operator === Operator.Not) {
+	if (false) {
 		return `${glyph}${values[0]}`;
 	}
killedBy: generateNaturalProofSteps should support negation introduction rule
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "¬P"
Received: "(P)"
