[Killed] ConditionalExpression
src/propositional/converters/replace-atom-in-formula.ts:40:7
 }): PropFormula {
 	function traverse(node: PropFormula): PropFormula {
 		// If the node is a variable, check if it matches the atom
-		if (node.operator === Operator.Var) {
+		if (true) {
 			const nodeAtom = node.values as PropAtom;
 			if (nodeAtom[0] === atom[0]) {
killedBy: NaturalProof replace should replace atoms in complex formulas
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "(A → B)"

[Killed] EqualityOperator
src/propositional/converters/replace-atom-in-formula.ts:40:7
 }): PropFormula {
 	function traverse(node: PropFormula): PropFormula {
 		// If the node is a variable, check if it matches the atom
-		if (node.operator === Operator.Var) {
+		if (node.operator !== Operator.Var) {
 			const nodeAtom = node.values as PropAtom;
 			if (nodeAtom[0] === atom[0]) {
killedBy: NaturalProof replace should replace an atom in all proof steps
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/propositional/converters/replace-atom-in-formula.ts:42:33
 		// If the node is a variable, check if it matches the atom
 		if (node.operator === Operator.Var) {
 			const nodeAtom = node.values as PropAtom;
-			if (nodeAtom[0] === atom[0]) {
-				// Replace with substitute
-				if (
-					Array.isArray(substitute) &&
-					substitute.length === 1 &&
-					typeof substitute[0] === "string"
-				) {
-					// substitute is a PropAtom
-					return {
-						operator: Operator.Var,
-						values: substitute,
-					};
-				} else {
-					// substitute is a PropFormula
-					return substitute as PropFormula;
-				}
-			}
+			if (nodeAtom[0] === atom[0]) {}
 			// Atom doesn't match, return the node unchanged
 			return node;
killedBy: NaturalProof replace should replace an atom in all proof steps
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not {"operator": "VAR", "values": ["A"]}

[Killed] ConditionalExpression
src/propositional/converters/replace-atom-in-formula.ts:42:8
 		// If the node is a variable, check if it matches the atom
 		if (node.operator === Operator.Var) {
 			const nodeAtom = node.values as PropAtom;
-			if (nodeAtom[0] === atom[0]) {
+			if (false) {
 				// Replace with substitute
 				if (
killedBy: NaturalProof replace should replace an atom in all proof steps
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not {"operator": "VAR", "values": ["A"]}

[Killed] ConditionalExpression
src/propositional/converters/replace-atom-in-formula.ts:45:6
 			if (nodeAtom[0] === atom[0]) {
 				// Replace with substitute
 				if (
-					Array.isArray(substitute) &&
-					substitute.length === 1 &&
-					typeof substitute[0] === "string"
+					true
 				) {
 					// substitute is a PropAtom
killedBy: NaturalProof replace should replace an atom in all proof steps
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/propositional/converters/replace-atom-in-formula.ts:45:6
 			if (nodeAtom[0] === atom[0]) {
 				// Replace with substitute
 				if (
-					Array.isArray(substitute) &&
-					substitute.length === 1 &&
-					typeof substitute[0] === "string"
+					false
 				) {
 					// substitute is a PropAtom
killedBy: NaturalProof replace should replace atom with another atom
statusReason: TypeError: values is not iterable

[Killed] EqualityOperator
src/propositional/converters/replace-atom-in-formula.ts:46:6
 				// Replace with substitute
 				if (
 					Array.isArray(substitute) &&
-					substitute.length === 1 &&
+					substitute.length !== 1 &&
 					typeof substitute[0] === "string"
 				) {
killedBy: NaturalProof replace should replace atom with another atom
statusReason: TypeError: values is not iterable

[Survived] ConditionalExpression
src/propositional/converters/replace-atom-in-formula.ts:46:6
 				// Replace with substitute
 				if (
 					Array.isArray(substitute) &&
-					substitute.length === 1 &&
+					true &&
 					typeof substitute[0] === "string"
 				) {

[Killed] EqualityOperator
src/propositional/converters/replace-atom-in-formula.ts:47:6
 				if (
 					Array.isArray(substitute) &&
 					substitute.length === 1 &&
-					typeof substitute[0] === "string"
+					typeof substitute[0] !== "string"
 				) {
 					// substitute is a PropAtom
killedBy: NaturalProof replace should replace atom with another atom
statusReason: TypeError: values is not iterable

[Survived] ConditionalExpression
src/propositional/converters/replace-atom-in-formula.ts:47:6
 				if (
 					Array.isArray(substitute) &&
 					substitute.length === 1 &&
-					typeof substitute[0] === "string"
+					true
 				) {
 					// substitute is a PropAtom

[Killed] BlockStatement
src/propositional/converters/replace-atom-in-formula.ts:48:7
 					Array.isArray(substitute) &&
 					substitute.length === 1 &&
 					typeof substitute[0] === "string"
-				) {
-					// substitute is a PropAtom
-					return {
-						operator: Operator.Var,
-						values: substitute,
-					};
-				} else {
+				) {} else {
 					// substitute is a PropFormula
 					return substitute as PropFormula;
killedBy: NaturalProof replace should replace atom with another atom
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: "A"

[Killed] BlockStatement
src/propositional/converters/replace-atom-in-formula.ts:54:12
 						operator: Operator.Var,
 						values: substitute,
 					};
-				} else {
-					// substitute is a PropFormula
-					return substitute as PropFormula;
-				}
+				} else {}
 			}
 			// Atom doesn't match, return the node unchanged
killedBy: NaturalProof replace should replace an atom in all proof steps
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not {"operator": "VAR", "values": ["A"]}

[Killed] BlockStatement
src/propositional/converters/replace-atom-in-formula.ts:64:35
 		}
 
 		// If the node is a composite formula, recursively traverse its sub-formulas
-		if (Array.isArray(node.values)) {
-			const subFormulas = node.values as PropFormula[];
-			const newValues = subFormulas.map((subFormula) => traverse(subFormula));
-
-			return {
-				operator: node.operator,
-				values: newValues,
-			};
-		}
+		if (Array.isArray(node.values)) {}
 
 		// This shouldn't happen for well-formed formulas, but return node as fallback
killedBy: NaturalProof replace should replace atoms in complex formulas
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "(A → B)"

[Killed] ConditionalExpression
src/propositional/converters/replace-atom-in-formula.ts:64:7
 		}
 
 		// If the node is a composite formula, recursively traverse its sub-formulas
-		if (Array.isArray(node.values)) {
+		if (true) {
 			const subFormulas = node.values as PropFormula[];
 			const newValues = subFormulas.map((subFormula) => traverse(subFormula));
killedBy: replaceAtomInFormula edge cases should not replace anything if input is not WFF
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ArrowFunction
src/propositional/converters/replace-atom-in-formula.ts:66:38
 		// If the node is a composite formula, recursively traverse its sub-formulas
 		if (Array.isArray(node.values)) {
 			const subFormulas = node.values as PropFormula[];
-			const newValues = subFormulas.map((subFormula) => traverse(subFormula));
+			const newValues = subFormulas.map(() => undefined);
 
 			return {
killedBy: NaturalProof replace should replace atoms in complex formulas
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.
