[Killed] LogicalOperator
src/propositional/evaluators/calculate-prop-formula.ts:27:20
 	assignment: boolean[];
 	variablesMap?: PropFormulaVariablesMap;
 }): boolean {
-	const variables = variablesMap ?? extractPropVariables(formula);
+	const variables = variablesMap && extractPropVariables(formula);
 
 	if (variables.size !== assignment.length) {
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: TypeError: Cannot read properties of undefined (reading 'size')

[Killed] EqualityOperator
src/propositional/evaluators/calculate-prop-formula.ts:29:6
 }): boolean {
 	const variables = variablesMap ?? extractPropVariables(formula);
 
-	if (variables.size !== assignment.length) {
+	if (variables.size === assignment.length) {
 		throw new Error(
 			`Mismatch between formula variables (${variables.size}) and assignment length (${assignment.length}).`,
killedBy: calculatePropFormula should evaluate a simple NOR operation
statusReason: Error: Mismatch between formula variables (2) and assignment length (2).

[Killed] ConditionalExpression
src/propositional/evaluators/calculate-prop-formula.ts:29:6
 }): boolean {
 	const variables = variablesMap ?? extractPropVariables(formula);
 
-	if (variables.size !== assignment.length) {
+	if (false) {
 		throw new Error(
 			`Mismatch between formula variables (${variables.size}) and assignment length (${assignment.length}).`,
killedBy: calculatePropFormula should throw an error for mismatched assignment length
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Mismatch between formula variables (1) and assignment length (0)."

Received function did not throw

[Killed] BlockStatement
src/propositional/evaluators/calculate-prop-formula.ts:37:37
 
 	const variableValues = new Map<string, boolean>();
 
-	variables.forEach((atom, index) => {
-		variableValues.set(atom[0], assignment[index]);
-	});
+	variables.forEach((atom, index) => {});
 
 	function evaluate(node: PropFormula): boolean {
killedBy: calculatePropFormula should evaluate a simple NOR operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/propositional/evaluators/calculate-prop-formula.ts:41:48
 		variableValues.set(atom[0], assignment[index]);
 	});
 
-	function evaluate(node: PropFormula): boolean {
-		if (node.operator === Operator.Var) {
-			return !!variableValues.get(node.values[0] as string);
-		}
-
-		if (node.operator === Operator.Not) {
-			const operand = node.values[0] as PropFormula;
-			return getUnaryOperationValue({
-				operator: node.operator,
-				operand: evaluate(operand),
-			});
-		}
-
-		const [left, right] = node.values as PropFormula[];
-		return getBinaryOperationValue({
-			operator: node.operator,
-			leftOperand: evaluate(left),
-			rightOperand: evaluate(right),
-		});
-	}
+	function evaluate(node: PropFormula): boolean {}
 
 	return evaluate(formula);
killedBy: calculatePropFormula should evaluate a simple NOR operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/propositional/evaluators/calculate-prop-formula.ts:42:39
 	});
 
 	function evaluate(node: PropFormula): boolean {
-		if (node.operator === Operator.Var) {
-			return !!variableValues.get(node.values[0] as string);
-		}
+		if (node.operator === Operator.Var) {}
 
 		if (node.operator === Operator.Not) {
killedBy: calculatePropFormula should evaluate a simple NOR operation
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] EqualityOperator
src/propositional/evaluators/calculate-prop-formula.ts:42:7
 	});
 
 	function evaluate(node: PropFormula): boolean {
-		if (node.operator === Operator.Var) {
+		if (node.operator !== Operator.Var) {
 			return !!variableValues.get(node.values[0] as string);
 		}
killedBy: calculatePropFormula should evaluate a simple NOR operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/propositional/evaluators/calculate-prop-formula.ts:43:12
 
 	function evaluate(node: PropFormula): boolean {
 		if (node.operator === Operator.Var) {
-			return !!variableValues.get(node.values[0] as string);
+			return !variableValues.get(node.values[0] as string);
 		}
 
killedBy: calculatePropFormula should evaluate a simple NOR operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/calculate-prop-formula.ts:46:7
 			return !!variableValues.get(node.values[0] as string);
 		}
 
-		if (node.operator === Operator.Not) {
+		if (true) {
 			const operand = node.values[0] as PropFormula;
 			return getUnaryOperationValue({
killedBy: calculatePropFormula should evaluate a simple NOR operation
statusReason: Error: Operator "NOR" is not a valid unary operator.

[Killed] EqualityOperator
src/propositional/evaluators/calculate-prop-formula.ts:46:7
 			return !!variableValues.get(node.values[0] as string);
 		}
 
-		if (node.operator === Operator.Not) {
+		if (node.operator !== Operator.Not) {
 			const operand = node.values[0] as PropFormula;
 			return getUnaryOperationValue({
killedBy: calculatePropFormula should evaluate a simple NOR operation
statusReason: Error: Operator "NOR" is not a valid unary operator.
