[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:24:3
 	rightOperand: boolean;
 }): boolean {
 	switch (operator) {
-		case Operator.And:
-			return leftOperand && rightOperand;
+		case Operator.And:
 		case Operator.Or:
 			return leftOperand || rightOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:25:11
 }): boolean {
 	switch (operator) {
 		case Operator.And:
-			return leftOperand && rightOperand;
+			return false;
 		case Operator.Or:
 			return leftOperand || rightOperand;
killedBy: getBinaryOperationValue Comprehensive truth tables for all binary operators should correctly evaluate And for all combinations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/propositional/evaluators/get-binary-operation-value.ts:25:11
 }): boolean {
 	switch (operator) {
 		case Operator.And:
-			return leftOperand && rightOperand;
+			return leftOperand || rightOperand;
 		case Operator.Or:
 			return leftOperand || rightOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:26:3
 	switch (operator) {
 		case Operator.And:
 			return leftOperand && rightOperand;
-		case Operator.Or:
-			return leftOperand || rightOperand;
+		case Operator.Or:
 		case Operator.Implies:
 			return !leftOperand || rightOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:27:11
 		case Operator.And:
 			return leftOperand && rightOperand;
 		case Operator.Or:
-			return leftOperand || rightOperand;
+			return false;
 		case Operator.Implies:
 			return !leftOperand || rightOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/propositional/evaluators/get-binary-operation-value.ts:27:11
 		case Operator.And:
 			return leftOperand && rightOperand;
 		case Operator.Or:
-			return leftOperand || rightOperand;
+			return leftOperand && rightOperand;
 		case Operator.Implies:
 			return !leftOperand || rightOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:28:3
 			return leftOperand && rightOperand;
 		case Operator.Or:
 			return leftOperand || rightOperand;
-		case Operator.Implies:
-			return !leftOperand || rightOperand;
+		case Operator.Implies:
 		case Operator.ReversedImplies:
 			return !rightOperand || leftOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/propositional/evaluators/get-binary-operation-value.ts:29:11
 		case Operator.Or:
 			return leftOperand || rightOperand;
 		case Operator.Implies:
-			return !leftOperand || rightOperand;
+			return leftOperand || rightOperand;
 		case Operator.ReversedImplies:
 			return !rightOperand || leftOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:29:11
 		case Operator.Or:
 			return leftOperand || rightOperand;
 		case Operator.Implies:
-			return !leftOperand || rightOperand;
+			return false;
 		case Operator.ReversedImplies:
 			return !rightOperand || leftOperand;
killedBy: getBinaryOperationValue Comprehensive truth tables for all binary operators should correctly evaluate Implies for all combinations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:30:3
 			return leftOperand || rightOperand;
 		case Operator.Implies:
 			return !leftOperand || rightOperand;
-		case Operator.ReversedImplies:
-			return !rightOperand || leftOperand;
+		case Operator.ReversedImplies:
 		case Operator.Equiv:
 			return leftOperand === rightOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:31:11
 		case Operator.Implies:
 			return !leftOperand || rightOperand;
 		case Operator.ReversedImplies:
-			return !rightOperand || leftOperand;
+			return false;
 		case Operator.Equiv:
 			return leftOperand === rightOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/propositional/evaluators/get-binary-operation-value.ts:31:11
 		case Operator.Implies:
 			return !leftOperand || rightOperand;
 		case Operator.ReversedImplies:
-			return !rightOperand || leftOperand;
+			return rightOperand || leftOperand;
 		case Operator.Equiv:
 			return leftOperand === rightOperand;
killedBy: getBinaryOperationValue ReversedImplies operator (P <= Q) - all truth combinations should return false when P=F, Q=T
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:32:3
 			return !leftOperand || rightOperand;
 		case Operator.ReversedImplies:
 			return !rightOperand || leftOperand;
-		case Operator.Equiv:
-			return leftOperand === rightOperand;
+		case Operator.Equiv:
 		case Operator.Xor:
 			return leftOperand !== rightOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/propositional/evaluators/get-binary-operation-value.ts:33:11
 		case Operator.ReversedImplies:
 			return !rightOperand || leftOperand;
 		case Operator.Equiv:
-			return leftOperand === rightOperand;
+			return leftOperand !== rightOperand;
 		case Operator.Xor:
 			return leftOperand !== rightOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:33:11
 		case Operator.ReversedImplies:
 			return !rightOperand || leftOperand;
 		case Operator.Equiv:
-			return leftOperand === rightOperand;
+			return true;
 		case Operator.Xor:
 			return leftOperand !== rightOperand;
killedBy: getBinaryOperationValue Comprehensive truth tables for all binary operators should correctly evaluate Equiv for all combinations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:34:3
 			return !rightOperand || leftOperand;
 		case Operator.Equiv:
 			return leftOperand === rightOperand;
-		case Operator.Xor:
-			return leftOperand !== rightOperand;
+		case Operator.Xor:
 		case Operator.Nand:
 			return !(leftOperand && rightOperand);
killedBy: getBinaryOperationValue Xor operator (P XOR Q) - all truth combinations should return false when P=F, Q=F
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:35:11
 		case Operator.Equiv:
 			return leftOperand === rightOperand;
 		case Operator.Xor:
-			return leftOperand !== rightOperand;
+			return false;
 		case Operator.Nand:
 			return !(leftOperand && rightOperand);
killedBy: getBinaryOperationValue Xor operator (P XOR Q) - all truth combinations should return true when P=T, Q=F
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/propositional/evaluators/get-binary-operation-value.ts:35:11
 		case Operator.Equiv:
 			return leftOperand === rightOperand;
 		case Operator.Xor:
-			return leftOperand !== rightOperand;
+			return leftOperand === rightOperand;
 		case Operator.Nand:
 			return !(leftOperand && rightOperand);
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:36:3
 			return leftOperand === rightOperand;
 		case Operator.Xor:
 			return leftOperand !== rightOperand;
-		case Operator.Nand:
-			return !(leftOperand && rightOperand);
+		case Operator.Nand:
 		case Operator.Nor:
 			return !(leftOperand || rightOperand);
killedBy: getBinaryOperationValue Comprehensive truth tables for all binary operators should correctly evaluate Nand for all combinations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/propositional/evaluators/get-binary-operation-value.ts:37:13
 		case Operator.Xor:
 			return leftOperand !== rightOperand;
 		case Operator.Nand:
-			return !(leftOperand && rightOperand);
+			return !(leftOperand || rightOperand);
 		case Operator.Nor:
 			return !(leftOperand || rightOperand);
killedBy: getBinaryOperationValue Comprehensive truth tables for all binary operators should correctly evaluate Nand for all combinations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:37:13
 		case Operator.Xor:
 			return leftOperand !== rightOperand;
 		case Operator.Nand:
-			return !(leftOperand && rightOperand);
+			return !(false);
 		case Operator.Nor:
 			return !(leftOperand || rightOperand);
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:38:3
 			return leftOperand !== rightOperand;
 		case Operator.Nand:
 			return !(leftOperand && rightOperand);
-		case Operator.Nor:
-			return !(leftOperand || rightOperand);
+		case Operator.Nor:
 		case Operator.AntiImplies:
 			return leftOperand && !rightOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:39:13
 		case Operator.Nand:
 			return !(leftOperand && rightOperand);
 		case Operator.Nor:
-			return !(leftOperand || rightOperand);
+			return !(false);
 		case Operator.AntiImplies:
 			return leftOperand && !rightOperand;
killedBy: getBinaryOperationValue Comprehensive truth tables for all binary operators should correctly evaluate Nor for all combinations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/propositional/evaluators/get-binary-operation-value.ts:39:11
 		case Operator.Nand:
 			return !(leftOperand && rightOperand);
 		case Operator.Nor:
-			return !(leftOperand || rightOperand);
+			return leftOperand || rightOperand;
 		case Operator.AntiImplies:
 			return leftOperand && !rightOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:40:3
 			return !(leftOperand && rightOperand);
 		case Operator.Nor:
 			return !(leftOperand || rightOperand);
-		case Operator.AntiImplies:
-			return leftOperand && !rightOperand;
+		case Operator.AntiImplies:
 		case Operator.ReversedAntiImplies:
 			return rightOperand && !leftOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/propositional/evaluators/get-binary-operation-value.ts:41:11
 		case Operator.Nor:
 			return !(leftOperand || rightOperand);
 		case Operator.AntiImplies:
-			return leftOperand && !rightOperand;
+			return leftOperand || !rightOperand;
 		case Operator.ReversedAntiImplies:
 			return rightOperand && !leftOperand;
killedBy: getBinaryOperationValue AntiImplies operator (P AND NOT Q) - all truth combinations should return false when P=T, Q=T
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:41:11
 		case Operator.Nor:
 			return !(leftOperand || rightOperand);
 		case Operator.AntiImplies:
-			return leftOperand && !rightOperand;
+			return false;
 		case Operator.ReversedAntiImplies:
 			return rightOperand && !leftOperand;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:42:3
 			return !(leftOperand || rightOperand);
 		case Operator.AntiImplies:
 			return leftOperand && !rightOperand;
-		case Operator.ReversedAntiImplies:
-			return rightOperand && !leftOperand;
+		case Operator.ReversedAntiImplies:
 		case Operator.Contradiction:
 			return false;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/propositional/evaluators/get-binary-operation-value.ts:43:27
 		case Operator.AntiImplies:
 			return leftOperand && !rightOperand;
 		case Operator.ReversedAntiImplies:
-			return rightOperand && !leftOperand;
+			return rightOperand && leftOperand;
 		case Operator.Contradiction:
 			return false;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:43:11
 		case Operator.AntiImplies:
 			return leftOperand && !rightOperand;
 		case Operator.ReversedAntiImplies:
-			return rightOperand && !leftOperand;
+			return true;
 		case Operator.Contradiction:
 			return false;
killedBy: getBinaryOperationValue ReversedAntiImplies operator (Q AND NOT P) - all truth combinations should return false when P=T, Q=T
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:44:3
 			return leftOperand && !rightOperand;
 		case Operator.ReversedAntiImplies:
 			return rightOperand && !leftOperand;
-		case Operator.Contradiction:
-			return false;
+		case Operator.Contradiction:
 		case Operator.Tautology:
 			return true;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/propositional/evaluators/get-binary-operation-value.ts:45:11
 		case Operator.ReversedAntiImplies:
 			return rightOperand && !leftOperand;
 		case Operator.Contradiction:
-			return false;
+			return true;
 		case Operator.Tautology:
 			return true;
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:46:3
 			return rightOperand && !leftOperand;
 		case Operator.Contradiction:
 			return false;
-		case Operator.Tautology:
-			return true;
+		case Operator.Tautology:
 		case Operator.Var:
 		case Operator.Not:
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: Operator "TAUTOLOGY" is not a binary operator.

[Killed] BooleanLiteral
src/propositional/evaluators/get-binary-operation-value.ts:47:11
 		case Operator.Contradiction:
 			return false;
 		case Operator.Tautology:
-			return true;
+			return false;
 		case Operator.Var:
 		case Operator.Not:
killedBy: getBinaryOperationValue should return correct values for binary logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:49:3
 		case Operator.Tautology:
 			return true;
 		case Operator.Var:
-		case Operator.Not:
-			throw new Error(`Operator "${operator}" is not a binary operator.`);
+		case Operator.Not:
 		default:
 			throw new Error(`Unknown operator: "${operator}".`);
killedBy: getBinaryOperationValue Error handling should throw error for Var operator
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Operator \"VAR\" is not a binary operator."
Received message:   "Unknown operator: \"VAR\"."

      142 |         if (stryMutAct_9fa48("315")) {} else {
      143 |           stryCov_9fa48("315");
    > 144 |           throw new Error(`Unknown operator: "${operator}".`);

[Killed] ConditionalExpression
src/propositional/evaluators/get-binary-operation-value.ts:51:3
 		case Operator.Var:
 		case Operator.Not:
 			throw new Error(`Operator "${operator}" is not a binary operator.`);
-		default:
-			throw new Error(`Unknown operator: "${operator}".`);
+		default:
 	}
 }
killedBy: getBinaryOperationValue Error handling should throw error for unknown operator
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Unknown operator: \"UnknownOperator\"."

Received function did not throw
