[Killed] BlockStatement
src/propositional/evaluators/get-unary-operation-value.ts:19:13
 }: {
 	operator: Operator;
 	operand: boolean;
-}): boolean {
-	switch (operator) {
-		case Operator.Var:
-			return operand; // A variable simply retains its boolean value.
-		case Operator.Not:
-			return !operand; // Logical negation.
-		default:
-			throw new Error(`Operator "${operator}" is not a valid unary operator.`);
-	}
-}
+}): boolean {}
 
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/propositional/evaluators/get-unary-operation-value.ts:21:3
 	operand: boolean;
 }): boolean {
 	switch (operator) {
-		case Operator.Var:
-			return operand; // A variable simply retains its boolean value.
+		case Operator.Var: // A variable simply retains its boolean value. // A variable simply retains its boolean value.
 		case Operator.Not:
 			return !operand; // Logical negation.
killedBy: getUnaryOperationValue should return the operand value for Operator.Var
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/evaluators/get-unary-operation-value.ts:23:3
 	switch (operator) {
 		case Operator.Var:
 			return operand; // A variable simply retains its boolean value.
-		case Operator.Not:
-			return !operand; // Logical negation.
+		// A variable simply retains its boolean value.
+case Operator.Not: // Logical negation. // Logical negation.
 		default:
 			throw new Error(`Operator "${operator}" is not a valid unary operator.`);
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: Error: Operator "NOT" is not a valid unary operator.

[Killed] BooleanLiteral
src/propositional/evaluators/get-unary-operation-value.ts:24:11
 		case Operator.Var:
 			return operand; // A variable simply retains its boolean value.
 		case Operator.Not:
-			return !operand; // Logical negation.
+			return operand; // Logical negation.
 		default:
 			throw new Error(`Operator "${operator}" is not a valid unary operator.`);
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/evaluators/get-unary-operation-value.ts:25:3
 			return operand; // A variable simply retains its boolean value.
 		case Operator.Not:
 			return !operand; // Logical negation.
-		default:
-			throw new Error(`Operator "${operator}" is not a valid unary operator.`);
+		// Logical negation.
+default:
 	}
 }
killedBy: getUnaryOperationValue should throw an error for unsupported unary operators
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Operator \"AND\" is not a valid unary operator."

Received function did not throw
