[Killed] BlockStatement
propositional/hilbert-calculus/axioms/implication-distribution.ts:13:16
  */
 export function implicationDistributionSchema(
 	formulas: PropFormula[],
-): PropFormula {
-	const [A, B, C] = formulas;
-
-	return {
-		operator: Operator.Implies,
-		values: [
-			{
-				operator: Operator.Implies,
-				values: [A, { operator: Operator.Implies, values: [B, C] }],
-			},
-			{
-				operator: Operator.Implies,
-				values: [
-					{ operator: Operator.Implies, values: [A, B] },
-					{ operator: Operator.Implies, values: [A, C] },
-				],
-			},
-		],
-	};
-}
+): PropFormula {}
 
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] ArrayDeclaration
propositional/hilbert-calculus/axioms/implication-distribution.ts:18:11
 
 	return {
 		operator: Operator.Implies,
-		values: [
-			{
-				operator: Operator.Implies,
-				values: [A, { operator: Operator.Implies, values: [B, C] }],
-			},
-			{
-				operator: Operator.Implies,
-				values: [
-					{ operator: Operator.Implies, values: [A, B] },
-					{ operator: Operator.Implies, values: [A, C] },
-				],
-			},
-		],
+		values: [],
 	};
 }
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.

[Killed] ArrayDeclaration
propositional/hilbert-calculus/axioms/implication-distribution.ts:21:55
 		values: [
 			{
 				operator: Operator.Implies,
-				values: [A, { operator: Operator.Implies, values: [B, C] }],
+				values: [A, { operator: Operator.Implies, values: [] }],
 			},
 			{
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.
