[Killed] BlockStatement
propositional/hilbert-calculus/axioms/implication-introduction.ts:15:16
  */
 export function implicationIntroductionSchema(
 	formulas: PropFormula[],
-): PropFormula {
-	const [A, B] = formulas;
-
-	return {
-		operator: Operator.Implies,
-		values: [
-			A,
-			{
-				operator: Operator.Implies,
-				values: [B, A],
-			},
-		],
-	};
-}
+): PropFormula {}
 
killedBy: HilbertProof addAxiom should add an axiom step using a schema
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')
