[Killed] BlockStatement
propositional/hilbert-calculus/axioms/implication-reversal.ts:13:16
  */
 export function implicationReversalSchema(
 	formulas: PropFormula[],
-): PropFormula {
-	const [A, B] = formulas;
-
-	return {
-		operator: Operator.Implies,
-		values: [
-			{
-				operator: Operator.Implies,
-				values: [
-					{ operator: Operator.Not, values: [A] },
-					{ operator: Operator.Not, values: [B] },
-				],
-			},
-			{
-				operator: Operator.Implies,
-				values: [B, A],
-			},
-		],
-	};
-}
+): PropFormula {}
 
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] ArrayDeclaration
propositional/hilbert-calculus/axioms/implication-reversal.ts:18:11
 
 	return {
 		operator: Operator.Implies,
-		values: [
-			{
-				operator: Operator.Implies,
-				values: [
-					{ operator: Operator.Not, values: [A] },
-					{ operator: Operator.Not, values: [B] },
-				],
-			},
-			{
-				operator: Operator.Implies,
-				values: [B, A],
-			},
-		],
+		values: [],
 	};
 }
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.

[Killed] ArrayDeclaration
propositional/hilbert-calculus/axioms/implication-reversal.ts:23:40
 				operator: Operator.Implies,
 				values: [
 					{ operator: Operator.Not, values: [A] },
-					{ operator: Operator.Not, values: [B] },
+					{ operator: Operator.Not, values: [] },
 				],
 			},
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.
