[Killed] ArrayDeclaration
propositional/hilbert-calculus/classes/hilbert-proof.ts:27:35
  * @category Hilbert Calculus
  */
 export class HilbertProof {
-	private steps: PropProofStep[] = [];
+	private steps: PropProofStep[] = ["Stryker was here"];
 	private readonly goal: PropFormula;
 
killedBy: HilbertProof constructor should create a new proof with a goal formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof.ts:77:68
 	 * @param comment - Optional explanation for the premise
 	 * @returns The added proof step
 	 */
-	addPremise(formula: PropFormula, comment?: string): PropProofStep {
-		const steps = generateHilbertProofSteps({
-			index: this.steps.length + 1,
-			step: Step.Premise,
-			payload: { formula } as HilbertBasePayload,
-		});
-
-		const step = steps[0];
-		if (comment) {
-			step.comment = comment;
-		}
-
-		this.steps.push(step);
-		return step;
-	}
+	addPremise(formula: PropFormula, comment?: string): PropProofStep {}
 
 	/**
killedBy: HilbertProof addPremise should add a premise step to the proof
statusReason: TypeError: Cannot read properties of undefined (reading 'index')

[Killed] ArithmeticOperator
propositional/hilbert-calculus/classes/hilbert-proof.ts:79:11
 	 */
 	addPremise(formula: PropFormula, comment?: string): PropProofStep {
 		const steps = generateHilbertProofSteps({
-			index: this.steps.length + 1,
+			index: this.steps.length - 1,
 			step: Step.Premise,
 			payload: { formula } as HilbertBasePayload,
killedBy: HilbertProof addPremise should add a premise step to the proof
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ConditionalExpression
propositional/hilbert-calculus/classes/hilbert-proof.ts:85:7
 		});
 
 		const step = steps[0];
-		if (comment) {
+		if (true) {
 			step.comment = comment;
 		}
killedBy: HilbertProof comments should provide automatic comments for the steps
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Premise"
Received: undefined

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof.ts:99:74
 	 * @param comment - Optional explanation for the axiom
 	 * @returns The added proof step
 	 */
-	addAxiom(payload: HilbertAxiomPayload, comment?: string): PropProofStep {
-		const steps = generateHilbertProofSteps({
-			index: this.steps.length + 1,
-			step: Step.Axiom,
-			payload,
-		} as HilbertProofStepInput<Step.Axiom>);
-
-		const step = steps[0];
-		if (comment) {
-			step.comment = comment;
-		}
-
-		this.steps.push(step);
-		return step;
-	}
+	addAxiom(payload: HilbertAxiomPayload, comment?: string): PropProofStep {}
 
 	/**
killedBy: HilbertProof addAxiom should add an axiom step using a schema
statusReason: TypeError: Cannot read properties of undefined (reading 'index')

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof.ts:124:21
 	addDerivedStep(
 		payload: HilbertDerivedPayload,
 		comment?: string,
-	): PropProofStep[] {
-		const newSteps = generateHilbertProofSteps({
-			index: this.steps.length + 1,
-			step: Step.Derivation,
-			payload,
-		} as HilbertProofStepInput<Step.Derivation>);
-
-		newSteps.forEach((step) => {
-			if (comment) {
-				step.comment = comment;
-			}
-			this.steps.push(step);
-		});
-
-		return newSteps;
-	}
+	): PropProofStep[] {}
 
 	/**
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof.ts:132:17
 		} as HilbertProofStepInput<Step.Derivation>);
 
 		newSteps.forEach((step) => {
-			if (comment) {
-				step.comment = comment;
-			}
+			if (comment) {}
 			this.steps.push(step);
 		});
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Modus Ponens"
Received: "IE: 1, 2"

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof.ts:145:24
 	 * Checks if the proof is complete (last step matches the goal).
 	 * @returns True if the last step's formula matches the goal
 	 */
-	isComplete(): boolean {
-		if (this.steps.length === 0) {
-			return false;
-		}
-
-		if (this.steps.every((step) => step.step === Step.Premise)) {
-			return false;
-		}
-
-		const lastStep = this.getLastStep() as PropProofStep;
-
-		return arePropFormulasStructurallyEqual([lastStep.formula, this.goal]);
-	}
+	isComplete(): boolean {}
 
 	/**
killedBy: HilbertProof constructor should create a new proof with a goal formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
propositional/hilbert-calculus/classes/hilbert-proof.ts:146:7
 	 * @returns True if the last step's formula matches the goal
 	 */
 	isComplete(): boolean {
-		if (this.steps.length === 0) {
+		if (true) {
 			return false;
 		}
killedBy: HilbertProof isComplete should return true when the last formula equals the goal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
propositional/hilbert-calculus/classes/hilbert-proof.ts:150:34
 			return false;
 		}
 
-		if (this.steps.every((step) => step.step === Step.Premise)) {
+		if (this.steps.every((step) => step.step !== Step.Premise)) {
 			return false;
 		}
killedBy: HilbertProof isComplete should return false when there are only premises in the proof sequence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
propositional/hilbert-calculus/classes/hilbert-proof.ts:150:7
 			return false;
 		}
 
-		if (this.steps.every((step) => step.step === Step.Premise)) {
+		if (this.steps.some(step => step.step === Step.Premise)) {
 			return false;
 		}
killedBy: HilbertProof isComplete should return true when the last formula equals the goal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
propositional/hilbert-calculus/classes/hilbert-proof.ts:151:11
 		}
 
 		if (this.steps.every((step) => step.step === Step.Premise)) {
-			return false;
+			return true;
 		}
 
killedBy: HilbertProof isComplete should return false when there are only premises in the proof sequence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof.ts:178:20
 	reiterateStep(fromIndex: number, comment?: string): PropProofStep {
 		const sourceStep = this.getStep(fromIndex);
 
-		if (!sourceStep) {
-			throw new Error(`Cannot reiterate: step ${fromIndex} not found in proof`);
-		}
+		if (!sourceStep) {}
 
 		// Create a reiteration step with the same formula
killedBy: HilbertProof reiterateStep should throw error when source step does not exist
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot reiterate: step 99 not found in proof"
Received message:   "Cannot read properties of undefined (reading 'formula')"

      298 |         step: Step.Reiteration,
      299 |         payload: {
    > 300 |           formula: sourceStep.formula

[Killed] ConditionalExpression
propositional/hilbert-calculus/classes/hilbert-proof.ts:178:7
 	reiterateStep(fromIndex: number, comment?: string): PropProofStep {
 		const sourceStep = this.getStep(fromIndex);
 
-		if (!sourceStep) {
+		if (false) {
 			throw new Error(`Cannot reiterate: step ${fromIndex} not found in proof`);
 		}
killedBy: HilbertProof reiterateStep should throw error when source step does not exist
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot reiterate: step 99 not found in proof"
Received message:   "Cannot read properties of undefined (reading 'formula')"

      298 |         step: Step.Reiteration,
      299 |         payload: {
    > 300 |           formula: sourceStep.formula

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof.ts:192:10
 		const step = steps[0];
 		if (comment) {
 			step.comment = comment;
-		} else {
-			step.comment = `Reiteration: ${fromIndex}`;
-		}
+		} else {}
 
 		step.derivedFrom = [fromIndex];
killedBy: HilbertProof reiterateStep should use default comment format when no comment is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Reiteration: 1"
Received: "Reiteration"

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof.ts:205:16
 	/**
 	 * Clears all steps from the proof.
 	 */
-	clear(): void {
-		this.steps = [];
-	}
+	clear(): void {}
 
 	/**
killedBy: HilbertProof clear should remove all steps from the proof
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2
