[Killed] BlockStatement
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:33:20
  */
 export function generateHilbertProofSteps<T>(
 	input: HilbertProofStepInput<T>,
-): PropProofStep[] {
-	const { index, step } = input;
-
-	if (step === Step.Derivation) {
-		return buildDerivedSteps(index, input.payload as HilbertDerivedPayload);
-	}
-
-	if (step === Step.Axiom) {
-		return buildAxiomStep(index, input.payload as HilbertAxiomPayload);
-	}
-
-	return buildBaseStep(index, step, input.payload as HilbertBasePayload);
-}
+): PropProofStep[] {}
 
 function buildDerivedSteps(
killedBy: HilbertProof addPremise should add a premise step to the proof
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:36:6
 ): PropProofStep[] {
 	const { index, step } = input;
 
-	if (step === Step.Derivation) {
+	if (false) {
 		return buildDerivedSteps(index, input.payload as HilbertDerivedPayload);
 	}
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] ConditionalExpression
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:36:6
 ): PropProofStep[] {
 	const { index, step } = input;
 
-	if (step === Step.Derivation) {
+	if (true) {
 		return buildDerivedSteps(index, input.payload as HilbertDerivedPayload);
 	}
killedBy: HilbertProof addPremise should add a premise step to the proof
statusReason: TypeError: getRuleFunction(...) is not a function

[Killed] ConditionalExpression
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:40:6
 		return buildDerivedSteps(index, input.payload as HilbertDerivedPayload);
 	}
 
-	if (step === Step.Axiom) {
+	if (true) {
 		return buildAxiomStep(index, input.payload as HilbertAxiomPayload);
 	}
killedBy: HilbertProof addPremise should add a premise step to the proof
statusReason: TypeError: getSchemaFunction(...) is not a function

[Killed] ConditionalExpression
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:40:6
 		return buildDerivedSteps(index, input.payload as HilbertDerivedPayload);
 	}
 
-	if (step === Step.Axiom) {
+	if (false) {
 		return buildAxiomStep(index, input.payload as HilbertAxiomPayload);
 	}
killedBy: HilbertProof addAxiom should add an axiom step using a schema
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] BlockStatement
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:50:20
 function buildDerivedSteps(
 	index: number,
 	payload: HilbertDerivedPayload,
-): PropProofStep[] {
-	const { formulas, rule, derivedFrom } = payload;
-	const derivedFormulas = getRuleFunction(rule)(formulas);
-
-	return derivedFormulas.map((formula, derivedIndex) => {
-		return {
-			index: index + derivedIndex,
-			step: Step.Derivation,
-			formula,
-			stringView: convertPropFormulaToString(formula),
-			expression: convertPropFormulaToExpression(formula),
-			comment: `${rule}: ${derivedFrom.join(", ")}`,
-			derivedFrom,
-		};
-	});
-}
+): PropProofStep[] {}
 
 function buildAxiomStep(
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:54:56
 	const { formulas, rule, derivedFrom } = payload;
 	const derivedFormulas = getRuleFunction(rule)(formulas);
 
-	return derivedFormulas.map((formula, derivedIndex) => {
-		return {
-			index: index + derivedIndex,
-			step: Step.Derivation,
-			formula,
-			stringView: convertPropFormulaToString(formula),
-			expression: convertPropFormulaToExpression(formula),
-			comment: `${rule}: ${derivedFrom.join(", ")}`,
-			derivedFrom,
-		};
-	});
+	return derivedFormulas.map((formula, derivedIndex) => {});
 }
 
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: TypeError: Cannot set properties of undefined (setting 'comment')

[Killed] ArithmeticOperator
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:56:11
 
 	return derivedFormulas.map((formula, derivedIndex) => {
 		return {
-			index: index + derivedIndex,
+			index: index - derivedIndex,
 			step: Step.Derivation,
 			formula,
killedBy: generateProofSteps should generate a derived step using implication reversal with several formulas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 7

[Killed] BlockStatement
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:70:20
 function buildAxiomStep(
 	index: number,
 	payload: HilbertAxiomPayload,
-): PropProofStep[] {
-	const { formulas, schema } = payload;
-	const formula = getSchemaFunction(schema)(formulas);
-	return [
-		{
-			index,
-			step: Step.Axiom,
-			formula,
-			stringView: convertPropFormulaToString(formula),
-			expression: convertPropFormulaToExpression(formula),
-			comment: `${schema}`,
-		},
-	];
-}
+): PropProofStep[] {}
 
 function buildBaseStep(
killedBy: HilbertProof addAxiom should add an axiom step using a schema
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:89:20
 	index: number,
 	step: Step,
 	payload: HilbertBasePayload,
-): PropProofStep[] {
-	return [
-		{
-			index,
-			step,
-			formula: payload.formula,
-			stringView: convertPropFormulaToString(payload.formula),
-			expression: convertPropFormulaToExpression(payload.formula),
-			comment: `${step}`,
-		},
-	];
-}
+): PropProofStep[] {}
 
 function getSchemaFunction(schema: HilbertCalculusSchema) {
killedBy: HilbertProof addPremise should add a premise step to the proof
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:102:59
 	];
 }
 
-function getSchemaFunction(schema: HilbertCalculusSchema) {
-	switch (schema) {
-		case HilbertCalculusSchema.II:
-			return implicationIntroductionSchema;
-		case HilbertCalculusSchema.ID:
-			return implicationDistributionSchema;
-		case HilbertCalculusSchema.IR:
-			return implicationReversalSchema;
-	}
-}
+function getSchemaFunction(schema: HilbertCalculusSchema) {}
 
 function getRuleFunction(rule: HilbertCalculusRule) {
killedBy: HilbertProof addAxiom should add an axiom step using a schema
statusReason: TypeError: getSchemaFunction(...) is not a function

[Killed] ConditionalExpression
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:104:3
 
 function getSchemaFunction(schema: HilbertCalculusSchema) {
 	switch (schema) {
-		case HilbertCalculusSchema.II:
-			return implicationIntroductionSchema;
+		case HilbertCalculusSchema.II:
 		case HilbertCalculusSchema.ID:
 			return implicationDistributionSchema;
killedBy: HilbertProof addAxiom should add an axiom step using a schema
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] ConditionalExpression
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:106:3
 	switch (schema) {
 		case HilbertCalculusSchema.II:
 			return implicationIntroductionSchema;
-		case HilbertCalculusSchema.ID:
-			return implicationDistributionSchema;
+		case HilbertCalculusSchema.ID:
 		case HilbertCalculusSchema.IR:
 			return implicationReversalSchema;
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "((A → (B → C)) → ((A → B) → (A → C)))"
Received: "((¬A → ¬B) → (B → A))"

[Killed] ConditionalExpression
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:108:3
 			return implicationIntroductionSchema;
 		case HilbertCalculusSchema.ID:
 			return implicationDistributionSchema;
-		case HilbertCalculusSchema.IR:
-			return implicationReversalSchema;
+		case HilbertCalculusSchema.IR:
 	}
 }
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: TypeError: getSchemaFunction(...) is not a function

[Killed] BlockStatement
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:113:53
 	}
 }
 
-function getRuleFunction(rule: HilbertCalculusRule) {
-	switch (rule) {
-		case HilbertCalculusRule.II:
-			return implicationIntroductionRule;
-		case HilbertCalculusRule.ID:
-			return implicationDistributionRule;
-		case HilbertCalculusRule.IR:
-			return implicationReversalRule;
-		case HilbertCalculusRule.IE:
-			return implicationEliminationRule;
-	}
-}
+function getRuleFunction(rule: HilbertCalculusRule) {}
 
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: TypeError: getRuleFunction(...) is not a function

[Killed] ConditionalExpression
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:115:3
 
 function getRuleFunction(rule: HilbertCalculusRule) {
 	switch (rule) {
-		case HilbertCalculusRule.II:
-			return implicationIntroductionRule;
+		case HilbertCalculusRule.II:
 		case HilbertCalculusRule.ID:
 			return implicationDistributionRule;
killedBy: generateProofSteps should generate a derived step using implication introduction
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Killed] ConditionalExpression
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:117:3
 	switch (rule) {
 		case HilbertCalculusRule.II:
 			return implicationIntroductionRule;
-		case HilbertCalculusRule.ID:
-			return implicationDistributionRule;
+		case HilbertCalculusRule.ID:
 		case HilbertCalculusRule.IR:
 			return implicationReversalRule;
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication reversal requires each formula to have the form ¬F => ¬G.

[Killed] ConditionalExpression
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:119:3
 			return implicationIntroductionRule;
 		case HilbertCalculusRule.ID:
 			return implicationDistributionRule;
-		case HilbertCalculusRule.IR:
-			return implicationReversalRule;
+		case HilbertCalculusRule.IR:
 		case HilbertCalculusRule.IE:
 			return implicationEliminationRule;
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
propositional/hilbert-calculus/generators/generate-hilbert-proof-steps.ts:121:3
 			return implicationDistributionRule;
 		case HilbertCalculusRule.IR:
 			return implicationReversalRule;
-		case HilbertCalculusRule.IE:
-			return implicationEliminationRule;
+		case HilbertCalculusRule.IE:
 	}
 }
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: TypeError: getRuleFunction(...) is not a function
