[Killed] BlockStatement
propositional/hilbert-calculus/rules/implication-distribution.ts:20:54
 export function implicationDistributionRule(
 	formulas: PropFormula[],
 ): PropFormula[] {
-	if (!isImplicationDistributionApplicable(formulas)) {
-		throw new Error(
-			"Implication distribution requires each formula to have the form F => (G => H).",
-		);
-	}
+	if (!isImplicationDistributionApplicable(formulas)) {}
 
 	return formulas.map((formula) => {
killedBy: implicationDistributionRule should throw an error if formula does not have the schema F => (G => H)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Implication distribution requires each formula to have the form F => (G => H)."

Received function did not throw

[Killed] BooleanLiteral
propositional/hilbert-calculus/rules/implication-distribution.ts:20:6
 export function implicationDistributionRule(
 	formulas: PropFormula[],
 ): PropFormula[] {
-	if (!isImplicationDistributionApplicable(formulas)) {
+	if (isImplicationDistributionApplicable(formulas)) {
 		throw new Error(
 			"Implication distribution requires each formula to have the form F => (G => H).",
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Killed] BlockStatement
propositional/hilbert-calculus/rules/implication-distribution.ts:26:35
 		);
 	}
 
-	return formulas.map((formula) => {
-		// Extract F, G, H from the formula F => (G => H)
-		const F = (formula.values as PropFormula[])[0];
-		const consequent = (formula.values as PropFormula[])[1];
-		const G = (consequent.values as PropFormula[])[0];
-		const H = (consequent.values as PropFormula[])[1];
-
-		// Create (F => G) => (F => H)
-		return {
-			operator: Operator.Implies,
-			values: [
-				{
-					operator: Operator.Implies,
-					values: [F, G],
-				},
-				{
-					operator: Operator.Implies,
-					values: [F, H],
-				},
-			],
-		};
-	});
+	return formulas.map((formula) => {});
 }
 
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] ArrayDeclaration
propositional/hilbert-calculus/rules/implication-distribution.ts:39:14
 			values: [
 				{
 					operator: Operator.Implies,
-					values: [F, G],
+					values: [],
 				},
 				{
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.
