[Killed] ConditionalExpression
propositional/hilbert-calculus/rules/implication-elimination.ts:19:6
 export function implicationEliminationRule(
 	formulas: PropFormula[],
 ): PropFormula[] {
-	if (!isImplicationEliminationApplicable(formulas)) {
+	if (true) {
 		throw new Error(
 			"Implication elimination is not applicable to the given formulas.",
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Killed] BooleanLiteral
propositional/hilbert-calculus/rules/implication-elimination.ts:19:6
 export function implicationEliminationRule(
 	formulas: PropFormula[],
 ): PropFormula[] {
-	if (!isImplicationEliminationApplicable(formulas)) {
+	if (isImplicationEliminationApplicable(formulas)) {
 		throw new Error(
 			"Implication elimination is not applicable to the given formulas.",
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
propositional/hilbert-calculus/rules/implication-elimination.ts:32:3
 
 	// Check if formula1 is an implication with formula2 as antecedent
 	if (
-		formula1.operator === Operator.Implies &&
-		Array.isArray(formula1.values) &&
-		formula1.values.length === 2 &&
-		arePropFormulasStructurallyEqual([formula1.values[0], formula2])
+		true
 	) {
 		implicationFormula = formula1;
killedBy: implicationEliminationRule should apply modus ponens when formula2 is the implication
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Array [
-   Object {
-     "operator": "VAR",

[Killed] ConditionalExpression
propositional/hilbert-calculus/rules/implication-elimination.ts:32:3
 
 	// Check if formula1 is an implication with formula2 as antecedent
 	if (
-		formula1.operator === Operator.Implies &&
-		Array.isArray(formula1.values) &&
-		formula1.values.length === 2 &&
-		arePropFormulasStructurallyEqual([formula1.values[0], formula2])
+		false
 	) {
 		implicationFormula = formula1;
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] EqualityOperator
propositional/hilbert-calculus/rules/implication-elimination.ts:34:3
 	if (
 		formula1.operator === Operator.Implies &&
 		Array.isArray(formula1.values) &&
-		formula1.values.length === 2 &&
+		formula1.values.length !== 2 &&
 		arePropFormulasStructurallyEqual([formula1.values[0], formula2])
 	) {
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Survived] ConditionalExpression
propositional/hilbert-calculus/rules/implication-elimination.ts:34:3
 	if (
 		formula1.operator === Operator.Implies &&
 		Array.isArray(formula1.values) &&
-		formula1.values.length === 2 &&
+		true &&
 		arePropFormulasStructurallyEqual([formula1.values[0], formula2])
 	) {

[Killed] BlockStatement
propositional/hilbert-calculus/rules/implication-elimination.ts:36:4
 		Array.isArray(formula1.values) &&
 		formula1.values.length === 2 &&
 		arePropFormulasStructurallyEqual([formula1.values[0], formula2])
-	) {
-		implicationFormula = formula1;
-	}
+	) {}
 	// Check if formula2 is an implication with formula1 as antecedent
 	else if (
killedBy: HilbertProof addDerivedStep should add a derived step from previous steps
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] ConditionalExpression
propositional/hilbert-calculus/rules/implication-elimination.ts:41:3
 	}
 	// Check if formula2 is an implication with formula1 as antecedent
 	else if (
-		formula2.operator === Operator.Implies &&
-		Array.isArray(formula2.values) &&
-		formula2.values.length === 2 &&
-		arePropFormulasStructurallyEqual([formula2.values[0], formula1])
+		false
 	) {
 		implicationFormula = formula2;
killedBy: implicationEliminationRule should apply modus ponens when formula2 is the implication
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Array [
-   Object {
-     "operator": "VAR",

[Killed] EqualityOperator
propositional/hilbert-calculus/rules/implication-elimination.ts:41:3
 	}
 	// Check if formula2 is an implication with formula1 as antecedent
 	else if (
-		formula2.operator === Operator.Implies &&
+		formula2.operator !== Operator.Implies &&
 		Array.isArray(formula2.values) &&
 		formula2.values.length === 2 &&
killedBy: implicationEliminationRule should apply modus ponens when formula2 is the implication
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Array [
-   Object {
-     "operator": "VAR",

[Killed] EqualityOperator
propositional/hilbert-calculus/rules/implication-elimination.ts:43:3
 	else if (
 		formula2.operator === Operator.Implies &&
 		Array.isArray(formula2.values) &&
-		formula2.values.length === 2 &&
+		formula2.values.length !== 2 &&
 		arePropFormulasStructurallyEqual([formula2.values[0], formula1])
 	) {
killedBy: implicationEliminationRule should apply modus ponens when formula2 is the implication
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Array [
-   Object {
-     "operator": "VAR",

[Survived] ConditionalExpression
propositional/hilbert-calculus/rules/implication-elimination.ts:43:3
 	else if (
 		formula2.operator === Operator.Implies &&
 		Array.isArray(formula2.values) &&
-		formula2.values.length === 2 &&
+		true &&
 		arePropFormulasStructurallyEqual([formula2.values[0], formula1])
 	) {

[Killed] BlockStatement
propositional/hilbert-calculus/rules/implication-elimination.ts:45:4
 		Array.isArray(formula2.values) &&
 		formula2.values.length === 2 &&
 		arePropFormulasStructurallyEqual([formula2.values[0], formula1])
-	) {
-		implicationFormula = formula2;
-	}
+	) {}
 
 	// Return the consequent of the implication (second value in the array)
killedBy: implicationEliminationRule should apply modus ponens when formula2 is the implication
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Array [
-   Object {
-     "operator": "VAR",
