[Killed] BlockStatement
propositional/hilbert-calculus/rules/implication-introduction.ts:22:18
  */
 export function implicationIntroductionRule(
 	formulas: PropFormula[],
-): PropFormula[] {
-	if (!isImplicationIntroductionApplicable(formulas)) {
-		throw new Error(
-			"Implication introduction requires exactly two formulas: the proven formula and the new antecedent formula.",
-		);
-	}
-
-	const [provenFormula, newFormula] = formulas;
-
-	return [
-		{
-			operator: Operator.Implies,
-			values: [newFormula, provenFormula],
-		},
-	];
-}
+): PropFormula[] {}
 
killedBy: generateProofSteps should generate a derived step using implication introduction
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
propositional/hilbert-calculus/rules/implication-introduction.ts:23:6
 export function implicationIntroductionRule(
 	formulas: PropFormula[],
 ): PropFormula[] {
-	if (!isImplicationIntroductionApplicable(formulas)) {
+	if (true) {
 		throw new Error(
 			"Implication introduction requires exactly two formulas: the proven formula and the new antecedent formula.",
killedBy: generateProofSteps should generate a derived step using implication introduction
statusReason: Error: Implication introduction requires exactly two formulas: the proven formula and the new antecedent formula.

[Killed] BooleanLiteral
propositional/hilbert-calculus/rules/implication-introduction.ts:23:6
 export function implicationIntroductionRule(
 	formulas: PropFormula[],
 ): PropFormula[] {
-	if (!isImplicationIntroductionApplicable(formulas)) {
+	if (isImplicationIntroductionApplicable(formulas)) {
 		throw new Error(
 			"Implication introduction requires exactly two formulas: the proven formula and the new antecedent formula.",
killedBy: generateProofSteps should generate a derived step using implication introduction
statusReason: Error: Implication introduction requires exactly two formulas: the proven formula and the new antecedent formula.

[Killed] ArrayDeclaration
propositional/hilbert-calculus/rules/implication-introduction.ts:31:9
 
 	const [provenFormula, newFormula] = formulas;
 
-	return [
-		{
-			operator: Operator.Implies,
-			values: [newFormula, provenFormula],
-		},
-	];
+	return [];
 }
 
killedBy: generateProofSteps should generate a derived step using implication introduction
statusReason: TypeError: Cannot read properties of undefined (reading 'comment')
