[Killed] BlockStatement
propositional/hilbert-calculus/rules/implication-reversal.ts:20:18
  */
 export function implicationReversalRule(
 	formulas: PropFormula[],
-): PropFormula[] {
-	if (!isImplicationReversalApplicable(formulas)) {
-		throw new Error(
-			"Implication reversal requires each formula to have the form ¬F => ¬G.",
-		);
-	}
-
-	return formulas.map((formula) => {
-		// Extract F and G from the formula ¬F => ¬G
-		const antecedent = (formula.values as PropFormula[])[0];
-		const consequent = (formula.values as PropFormula[])[1];
-
-		const F = (antecedent.values as PropFormula[])[0];
-		const G = (consequent.values as PropFormula[])[0];
-
-		// Create G => F
-		return {
-			operator: Operator.Implies,
-			values: [G, F],
-		};
-	});
-}
+): PropFormula[] {}
 
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
propositional/hilbert-calculus/rules/implication-reversal.ts:21:50
 export function implicationReversalRule(
 	formulas: PropFormula[],
 ): PropFormula[] {
-	if (!isImplicationReversalApplicable(formulas)) {
-		throw new Error(
-			"Implication reversal requires each formula to have the form ¬F => ¬G.",
-		);
-	}
+	if (!isImplicationReversalApplicable(formulas)) {}
 
 	return formulas.map((formula) => {
killedBy: implicationReversalRule should throw an error if formula does not have the schema ¬F => ¬G
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Implication reversal requires each formula to have the form ¬F => ¬G."

Received function did not throw

[Killed] ConditionalExpression
propositional/hilbert-calculus/rules/implication-reversal.ts:21:6
 export function implicationReversalRule(
 	formulas: PropFormula[],
 ): PropFormula[] {
-	if (!isImplicationReversalApplicable(formulas)) {
+	if (false) {
 		throw new Error(
 			"Implication reversal requires each formula to have the form ¬F => ¬G.",
killedBy: implicationReversalRule should throw an error if formula does not have the schema ¬F => ¬G
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Implication reversal requires each formula to have the form ¬F => ¬G."

Received function did not throw

[Killed] BlockStatement
propositional/hilbert-calculus/rules/implication-reversal.ts:27:35
 		);
 	}
 
-	return formulas.map((formula) => {
-		// Extract F and G from the formula ¬F => ¬G
-		const antecedent = (formula.values as PropFormula[])[0];
-		const consequent = (formula.values as PropFormula[])[1];
-
-		const F = (antecedent.values as PropFormula[])[0];
-		const G = (consequent.values as PropFormula[])[0];
-
-		// Create G => F
-		return {
-			operator: Operator.Implies,
-			values: [G, F],
-		};
-	});
+	return formulas.map((formula) => {});
 }
 
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')
