[Killed] BlockStatement
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:33:20
  */
 export function generateNaturalProofSteps<T>(
 	input: NaturalProofStepInput<T>,
-): PropProofStep[] {
-	const { index, level, step, assumptionIndex } = input;
-
-	if (step === Step.Derivation) {
-		return buildDerivedSteps({
-			index,
-			level,
-			assumptionIndex,
-			payload: input.payload as NaturalDerivedPayload,
-		});
-	}
-
-	return [
-		buildBaseStep({
-			index,
-			level,
-			step,
-			assumptionIndex,
-			payload: input.payload as NaturalBasePayload,
-		}),
-	];
-}
+): PropProofStep[] {}
 
 function buildDerivedSteps({
killedBy: NaturalProof addPremise should add a premise step at the current level
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:66:21
 	level: number;
 	payload: NaturalDerivedPayload;
 	assumptionIndex?: number;
-}): PropProofStep[] {
-	const { formulas, rule, derivedFrom } = payload;
-	const derivedFormulas = getRuleFunction(rule)(formulas);
-
-	return derivedFormulas.map((formula, idx) => ({
-		index: index + idx + 1,
-		level,
-		step: Step.Derivation,
-		formula,
-		assumptionIndex,
-		stringView: convertPropFormulaToString(formula),
-		expression: convertPropFormulaToExpression(formula),
-		comment: `${rule}: ${derivedFrom.join(", ")}`,
-		derivedFrom,
-	}));
-}
+}): PropProofStep[] {}
 
 function buildBaseStep({
killedBy: NaturalProof addDerivedStep should add a derived step at the current level
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ArrowFunction
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:70:29
 	const { formulas, rule, derivedFrom } = payload;
 	const derivedFormulas = getRuleFunction(rule)(formulas);
 
-	return derivedFormulas.map((formula, idx) => ({
-		index: index + idx + 1,
-		level,
-		step: Step.Derivation,
-		formula,
-		assumptionIndex,
-		stringView: convertPropFormulaToString(formula),
-		expression: convertPropFormulaToExpression(formula),
-		comment: `${rule}: ${derivedFrom.join(", ")}`,
-		derivedFrom,
-	}));
+	return derivedFormulas.map(() => undefined);
 }
 
killedBy: NaturalProof addDerivedStep should add a derived step at the current level
statusReason: TypeError: Cannot read properties of undefined (reading 'step')

[Killed] ArithmeticOperator
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:71:10
 	const derivedFormulas = getRuleFunction(rule)(formulas);
 
 	return derivedFormulas.map((formula, idx) => ({
-		index: index + idx + 1,
+		index: index + idx - 1,
 		level,
 		step: Step.Derivation,
killedBy: NaturalProof integration scenarios should properly track indices across multiple operations
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 3
Received:   3

[Survived] ArithmeticOperator
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:71:10
 	const derivedFormulas = getRuleFunction(rule)(formulas);
 
 	return derivedFormulas.map((formula, idx) => ({
-		index: index + idx + 1,
+		index: index - idx + 1,
 		level,
 		step: Step.Derivation,

[Killed] BlockStatement
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:95:19
 	step: Step;
 	payload: NaturalBasePayload;
 	assumptionIndex?: number;
-}): PropProofStep {
-	return {
-		index,
-		level,
-		step,
-		assumptionIndex,
-		formula: payload.formula,
-		stringView: convertPropFormulaToString(payload.formula),
-		expression: convertPropFormulaToExpression(payload.formula),
-		comment: `${step}`,
-	};
-}
+}): PropProofStep {}
 
 function getRuleFunction(rule: NaturalCalculusRule) {
killedBy: NaturalProof addPremise should add a premise step at the current level
statusReason: TypeError: Cannot set properties of undefined (setting 'comment')

[Killed] ConditionalExpression
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:111:3
 function getRuleFunction(rule: NaturalCalculusRule) {
 	switch (rule) {
 		// Introduction rules
-		case NaturalCalculusRule.CI:
-			return conjunctionIntroduction;
+		// Introduction rules
+case NaturalCalculusRule.CI:
 		case NaturalCalculusRule.DI:
 			return disjunctionIntroduction;
killedBy: NaturalProofBuilder and functional proof generation NaturalProofBuilder class should chain addDerivedStep calls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "AND"
Received: "OR"

[Killed] ConditionalExpression
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:113:3
 		// Introduction rules
 		case NaturalCalculusRule.CI:
 			return conjunctionIntroduction;
-		case NaturalCalculusRule.DI:
-			return disjunctionIntroduction;
+		case NaturalCalculusRule.DI:
 		case NaturalCalculusRule.II:
 			return implicationIntroduction;
killedBy: generateNaturalProofSteps should support disjunction introduction rule
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1

[Killed] ConditionalExpression
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:115:3
 			return conjunctionIntroduction;
 		case NaturalCalculusRule.DI:
 			return disjunctionIntroduction;
-		case NaturalCalculusRule.II:
-			return implicationIntroduction;
+		case NaturalCalculusRule.II:
 		case NaturalCalculusRule.EI:
 			return equivalenceIntroduction;
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: Equivalence introduction is not applicable to the given formulas.

[Killed] ConditionalExpression
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:117:3
 			return disjunctionIntroduction;
 		case NaturalCalculusRule.II:
 			return implicationIntroduction;
-		case NaturalCalculusRule.EI:
-			return equivalenceIntroduction;
+		case NaturalCalculusRule.EI:
 		case NaturalCalculusRule.NI:
 			return negationIntroduction;
killedBy: generateNaturalProofSteps should support equivalence introduction rule
statusReason: Error: Negation introduction is not applicable to the given formulas.

[Killed] ConditionalExpression
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:119:3
 			return implicationIntroduction;
 		case NaturalCalculusRule.EI:
 			return equivalenceIntroduction;
-		case NaturalCalculusRule.NI:
-			return negationIntroduction;
+		case NaturalCalculusRule.NI:
+// Elimination rules
 		// Elimination rules
 		case NaturalCalculusRule.CE:
killedBy: generateNaturalProofSteps should support negation introduction rule
statusReason: Error: Conjunction Elimination is not applicable for the given formulas.

[Killed] ConditionalExpression
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:122:3
 		case NaturalCalculusRule.NI:
 			return negationIntroduction;
 		// Elimination rules
-		case NaturalCalculusRule.CE:
-			return conjunctionElimination;
+		// Elimination rules
+case NaturalCalculusRule.CE:
 		case NaturalCalculusRule.DE:
 			return disjunctionElimination;
killedBy: generateNaturalProofSteps should support conjunction elimination rule
statusReason: Error: Disjunction elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:124:3
 		// Elimination rules
 		case NaturalCalculusRule.CE:
 			return conjunctionElimination;
-		case NaturalCalculusRule.DE:
-			return disjunctionElimination;
+		case NaturalCalculusRule.DE:
 		case NaturalCalculusRule.IE:
 			return implicationElimination;
killedBy: generateNaturalProofSteps should support disjunction elimination rule
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:126:3
 			return conjunctionElimination;
 		case NaturalCalculusRule.DE:
 			return disjunctionElimination;
-		case NaturalCalculusRule.IE:
-			return implicationElimination;
+		case NaturalCalculusRule.IE:
 		case NaturalCalculusRule.EE:
 			return equivalenceElimination;
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Equivalence elimination is not applicable. All formulas must be equivalences.

[Killed] ConditionalExpression
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:128:3
 			return disjunctionElimination;
 		case NaturalCalculusRule.IE:
 			return implicationElimination;
-		case NaturalCalculusRule.EE:
-			return equivalenceElimination;
+		case NaturalCalculusRule.EE:
 		case NaturalCalculusRule.NE:
 			return negationElimination;
killedBy: generateNaturalProofSteps should support equivalence elimination rule
statusReason: Error: Negation elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
propositional/natural-calculus/generators/generate-natural-proof-steps.ts:130:3
 			return implicationElimination;
 		case NaturalCalculusRule.EE:
 			return equivalenceElimination;
-		case NaturalCalculusRule.NE:
-			return negationElimination;
+		case NaturalCalculusRule.NE:
 	}
 }
killedBy: generateNaturalProofSteps should support negation elimination rule
statusReason: TypeError: getRuleFunction(...) is not a function
