[Killed] BlockStatement
propositional/natural-calculus/rules/conjunction-elimination.ts:13:80
  * @returns {PropFormula[]} An array of inferred formulas after applying conjunction elimination.
  * @throws {Error} if any formula is not a conjunction.
  */
-export function conjunctionElimination(formulas: PropFormula[]): PropFormula[] {
-	if (!isConjunctionEliminationApplicable(formulas)) {
-		throw new Error(
-			"Conjunction Elimination is not applicable for the given formulas.",
-		);
-	}
-
-	return formulas.flatMap((formula) => {
-		const conjunct1 = formula.values[0] as PropFormula;
-		const conjunct2 = formula.values[1] as PropFormula;
-
-		return [conjunct1, conjunct2];
-	});
-}
+export function conjunctionElimination(formulas: PropFormula[]): PropFormula[] {}
 
killedBy: generateNaturalProofSteps should support conjunction elimination rule
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
propositional/natural-calculus/rules/conjunction-elimination.ts:14:6
  * @throws {Error} if any formula is not a conjunction.
  */
 export function conjunctionElimination(formulas: PropFormula[]): PropFormula[] {
-	if (!isConjunctionEliminationApplicable(formulas)) {
+	if (true) {
 		throw new Error(
 			"Conjunction Elimination is not applicable for the given formulas.",
killedBy: generateNaturalProofSteps should support conjunction elimination rule
statusReason: Error: Conjunction Elimination is not applicable for the given formulas.

[Killed] ConditionalExpression
propositional/natural-calculus/rules/conjunction-elimination.ts:14:6
  * @throws {Error} if any formula is not a conjunction.
  */
 export function conjunctionElimination(formulas: PropFormula[]): PropFormula[] {
-	if (!isConjunctionEliminationApplicable(formulas)) {
+	if (false) {
 		throw new Error(
 			"Conjunction Elimination is not applicable for the given formulas.",
killedBy: conjunctionElimination should throw an error if the input formulas are not all conjunctions
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Conjunction Elimination is not applicable for the given formulas."

Received function did not throw

[Killed] BlockStatement
propositional/natural-calculus/rules/conjunction-elimination.ts:20:39
 		);
 	}
 
-	return formulas.flatMap((formula) => {
-		const conjunct1 = formula.values[0] as PropFormula;
-		const conjunct2 = formula.values[1] as PropFormula;
-
-		return [conjunct1, conjunct2];
-	});
+	return formulas.flatMap((formula) => {});
 }
 
killedBy: generateNaturalProofSteps should support conjunction elimination rule
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')
