[Killed] BlockStatement
propositional/natural-calculus/rules/conjunction-introduction.ts:16:31
  */
 export function conjunctionIntroduction(
 	formulas: PropFormula[],
-): [PropFormula, PropFormula] {
-	if (!isConjunctionIntroductionApplicable(formulas)) {
-		throw new Error(
-			"Conjunction introduction is not applicable to the given formulas.",
-		);
-	}
-
-	const conjunct1 = formulas[0];
-	const conjunct2 = formulas[1];
-
-	return [
-		{
-			operator: Operator.And,
-			values: [conjunct1, conjunct2],
-		},
-		{
-			operator: Operator.And,
-			values: [conjunct2, conjunct1],
-		},
-	];
-}
+): [PropFormula, PropFormula] {}
 
killedBy: NaturalProof addDerivedStep should add a derived step at the current level
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BooleanLiteral
propositional/natural-calculus/rules/conjunction-introduction.ts:17:6
 export function conjunctionIntroduction(
 	formulas: PropFormula[],
 ): [PropFormula, PropFormula] {
-	if (!isConjunctionIntroductionApplicable(formulas)) {
+	if (isConjunctionIntroductionApplicable(formulas)) {
 		throw new Error(
 			"Conjunction introduction is not applicable to the given formulas.",
killedBy: NaturalProof addDerivedStep should add a derived step at the current level
statusReason: Error: Conjunction introduction is not applicable to the given formulas.

[Killed] BlockStatement
propositional/natural-calculus/rules/conjunction-introduction.ts:17:54
 export function conjunctionIntroduction(
 	formulas: PropFormula[],
 ): [PropFormula, PropFormula] {
-	if (!isConjunctionIntroductionApplicable(formulas)) {
-		throw new Error(
-			"Conjunction introduction is not applicable to the given formulas.",
-		);
-	}
+	if (!isConjunctionIntroductionApplicable(formulas)) {}
 
 	const conjunct1 = formulas[0];
killedBy: conjunctionIntroduction should throw an error if CI is not applicable
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Conjunction introduction is not applicable to the given formulas."

Received function did not throw

[Killed] ArrayDeclaration
propositional/natural-calculus/rules/conjunction-introduction.ts:26:9
 	const conjunct1 = formulas[0];
 	const conjunct2 = formulas[1];
 
-	return [
-		{
-			operator: Operator.And,
-			values: [conjunct1, conjunct2],
-		},
-		{
-			operator: Operator.And,
-			values: [conjunct2, conjunct1],
-		},
-	];
+	return [];
 }
 
killedBy: NaturalProof addDerivedStep should add a derived step at the current level
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ArrayDeclaration
propositional/natural-calculus/rules/conjunction-introduction.ts:29:12
 	return [
 		{
 			operator: Operator.And,
-			values: [conjunct1, conjunct2],
+			values: [],
 		},
 		{
killedBy: NaturalProof addDerivedStep should add a derived step at the current level
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.

[Killed] ArrayDeclaration
propositional/natural-calculus/rules/conjunction-introduction.ts:33:12
 		},
 		{
 			operator: Operator.And,
-			values: [conjunct2, conjunct1],
+			values: [],
 		},
 	];
killedBy: NaturalProof addDerivedStep should add a derived step at the current level
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.
