[Killed] BlockStatement
propositional/natural-calculus/rules/disjunction-elimination.ts:13:80
  * @returns {[PropFormula]} A tuple containing the inferred formula.
  * @throws {Error} if the formulas do not satisfy disjunction elimination conditions.
  */
-export function disjunctionElimination(formulas: PropFormula[]): [PropFormula] {
-	if (!isDisjunctionEliminationApplicable(formulas)) {
-		throw new Error(
-			"Disjunction elimination is not applicable to the given formulas.",
-		);
-	}
-
-	// Extract the consequent from one of the implications
-	const implication1 = formulas.find(
-		(formula) => formula.operator === Operator.Implies,
-	);
-
-	return [implication1?.values[1] as PropFormula];
-}
+export function disjunctionElimination(formulas: PropFormula[]): [PropFormula] {}
 
killedBy: generateNaturalProofSteps should support disjunction elimination rule
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
propositional/natural-calculus/rules/disjunction-elimination.ts:14:6
  * @throws {Error} if the formulas do not satisfy disjunction elimination conditions.
  */
 export function disjunctionElimination(formulas: PropFormula[]): [PropFormula] {
-	if (!isDisjunctionEliminationApplicable(formulas)) {
+	if (true) {
 		throw new Error(
 			"Disjunction elimination is not applicable to the given formulas.",
killedBy: generateNaturalProofSteps should support disjunction elimination rule
statusReason: Error: Disjunction elimination is not applicable to the given formulas.

[Killed] BlockStatement
propositional/natural-calculus/rules/disjunction-elimination.ts:14:53
  * @throws {Error} if the formulas do not satisfy disjunction elimination conditions.
  */
 export function disjunctionElimination(formulas: PropFormula[]): [PropFormula] {
-	if (!isDisjunctionEliminationApplicable(formulas)) {
-		throw new Error(
-			"Disjunction elimination is not applicable to the given formulas.",
-		);
-	}
+	if (!isDisjunctionEliminationApplicable(formulas)) {}
 
 	// Extract the consequent from one of the implications
killedBy: disjunctionElimination should throw an error if the rule is not applicable
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Disjunction elimination is not applicable to the given formulas."

Received function did not throw

[Killed] ConditionalExpression
propositional/natural-calculus/rules/disjunction-elimination.ts:22:16
 
 	// Extract the consequent from one of the implications
 	const implication1 = formulas.find(
-		(formula) => formula.operator === Operator.Implies,
+		(formula) => true,
 	);
 
killedBy: generateNaturalProofSteps should support disjunction elimination rule
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "R"
Received: "Q"

[Killed] EqualityOperator
propositional/natural-calculus/rules/disjunction-elimination.ts:22:16
 
 	// Extract the consequent from one of the implications
 	const implication1 = formulas.find(
-		(formula) => formula.operator === Operator.Implies,
+		(formula) => formula.operator !== Operator.Implies,
 	);
 
killedBy: generateNaturalProofSteps should support disjunction elimination rule
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "R"
Received: "Q"
