[Killed] BlockStatement
propositional/natural-calculus/rules/disjunction-introduction.ts:16:31
  */
 export function disjunctionIntroduction(
 	formulas: PropFormula[],
-): [PropFormula, PropFormula] {
-	if (!isDisjunctionIntroductionApplicable(formulas)) {
-		throw new Error(
-			"Disjunction introduction is not applicable to the given formulas.",
-		);
-	}
-
-	const disjunct1 = formulas[0];
-	const disjunct2 = formulas[1];
-
-	return [
-		{ operator: Operator.Or, values: [disjunct1, disjunct2] },
-		{ operator: Operator.Or, values: [disjunct2, disjunct1] },
-	];
-}
+): [PropFormula, PropFormula] {}
 
killedBy: NaturalProof addDerivedStep should add derived steps inside assumptions at nested level
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
propositional/natural-calculus/rules/disjunction-introduction.ts:17:54
 export function disjunctionIntroduction(
 	formulas: PropFormula[],
 ): [PropFormula, PropFormula] {
-	if (!isDisjunctionIntroductionApplicable(formulas)) {
-		throw new Error(
-			"Disjunction introduction is not applicable to the given formulas.",
-		);
-	}
+	if (!isDisjunctionIntroductionApplicable(formulas)) {}
 
 	const disjunct1 = formulas[0];
killedBy: disjunctionIntroduction should throw an error if CI is not applicable
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Disjunction introduction is not applicable to the given formulas."

Received function did not throw

[Killed] ConditionalExpression
propositional/natural-calculus/rules/disjunction-introduction.ts:17:6
 export function disjunctionIntroduction(
 	formulas: PropFormula[],
 ): [PropFormula, PropFormula] {
-	if (!isDisjunctionIntroductionApplicable(formulas)) {
+	if (true) {
 		throw new Error(
 			"Disjunction introduction is not applicable to the given formulas.",
killedBy: NaturalProof addDerivedStep should add derived steps inside assumptions at nested level
statusReason: Error: Disjunction introduction is not applicable to the given formulas.

[Killed] ArrayDeclaration
propositional/natural-calculus/rules/disjunction-introduction.ts:26:9
 	const disjunct1 = formulas[0];
 	const disjunct2 = formulas[1];
 
-	return [
-		{ operator: Operator.Or, values: [disjunct1, disjunct2] },
-		{ operator: Operator.Or, values: [disjunct2, disjunct1] },
-	];
+	return [];
 }
 
killedBy: NaturalProof addDerivedStep should add derived steps inside assumptions at nested level
statusReason: TypeError: Cannot read properties of undefined (reading 'level')
