[Killed] BlockStatement
propositional/natural-calculus/rules/equivalence-elimination.ts:14:80
  * @returns {PropFormula[]} An array containing the inferred formulas.
  * @throws {Error} if the formulas are not all equivalences.
  */
-export function equivalenceElimination(formulas: PropFormula[]): PropFormula[] {
-	if (!isEquivalenceEliminationApplicable(formulas)) {
-		throw new Error(
-			"Equivalence elimination is not applicable. All formulas must be equivalences.",
-		);
-	}
-
-	return formulas.flatMap((formula) => {
-		const [A, B] = formula.values as PropFormula[];
-		return [
-			{ operator: Operator.Implies, values: [A, B] },
-			{ operator: Operator.Implies, values: [B, A] },
-		];
-	});
-}
+export function equivalenceElimination(formulas: PropFormula[]): PropFormula[] {}
 
killedBy: generateNaturalProofSteps should support equivalence elimination rule
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BooleanLiteral
propositional/natural-calculus/rules/equivalence-elimination.ts:15:6
  * @throws {Error} if the formulas are not all equivalences.
  */
 export function equivalenceElimination(formulas: PropFormula[]): PropFormula[] {
-	if (!isEquivalenceEliminationApplicable(formulas)) {
+	if (isEquivalenceEliminationApplicable(formulas)) {
 		throw new Error(
 			"Equivalence elimination is not applicable. All formulas must be equivalences.",
killedBy: generateNaturalProofSteps should support equivalence elimination rule
statusReason: Error: Equivalence elimination is not applicable. All formulas must be equivalences.

[Killed] ConditionalExpression
propositional/natural-calculus/rules/equivalence-elimination.ts:15:6
  * @throws {Error} if the formulas are not all equivalences.
  */
 export function equivalenceElimination(formulas: PropFormula[]): PropFormula[] {
-	if (!isEquivalenceEliminationApplicable(formulas)) {
+	if (true) {
 		throw new Error(
 			"Equivalence elimination is not applicable. All formulas must be equivalences.",
killedBy: generateNaturalProofSteps should support equivalence elimination rule
statusReason: Error: Equivalence elimination is not applicable. All formulas must be equivalences.

[Killed] BlockStatement
propositional/natural-calculus/rules/equivalence-elimination.ts:21:39
 		);
 	}
 
-	return formulas.flatMap((formula) => {
-		const [A, B] = formula.values as PropFormula[];
-		return [
-			{ operator: Operator.Implies, values: [A, B] },
-			{ operator: Operator.Implies, values: [B, A] },
-		];
-	});
+	return formulas.flatMap((formula) => {});
 }
 
killedBy: generateNaturalProofSteps should support equivalence elimination rule
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')
