[Killed] BlockStatement
propositional/natural-calculus/rules/equivalence-introduction.ts:14:18
  */
 export function equivalenceIntroduction(
 	formulas: PropFormula[],
-): [PropFormula] {
-	if (!isEquivalenceIntroductionApplicable(formulas)) {
-		throw new Error(
-			"Equivalence introduction is not applicable to the given formulas.",
-		);
-	}
-
-	const [implication1, implication2] = formulas;
-	const firstAntecedent = implication1.values[0] as PropFormula;
-	const secondAntecedent = implication2.values[0] as PropFormula;
-
-	return [
-		{
-			operator: Operator.Equiv,
-			values: [firstAntecedent, secondAntecedent],
-		},
-	];
-}
+): [PropFormula] {}
 
killedBy: generateNaturalProofSteps should support equivalence introduction rule
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BooleanLiteral
propositional/natural-calculus/rules/equivalence-introduction.ts:15:6
 export function equivalenceIntroduction(
 	formulas: PropFormula[],
 ): [PropFormula] {
-	if (!isEquivalenceIntroductionApplicable(formulas)) {
+	if (isEquivalenceIntroductionApplicable(formulas)) {
 		throw new Error(
 			"Equivalence introduction is not applicable to the given formulas.",
killedBy: generateNaturalProofSteps should support equivalence introduction rule
statusReason: Error: Equivalence introduction is not applicable to the given formulas.

[Killed] ConditionalExpression
propositional/natural-calculus/rules/equivalence-introduction.ts:15:6
 export function equivalenceIntroduction(
 	formulas: PropFormula[],
 ): [PropFormula] {
-	if (!isEquivalenceIntroductionApplicable(formulas)) {
+	if (false) {
 		throw new Error(
 			"Equivalence introduction is not applicable to the given formulas.",
killedBy: equivalenceIntroduction should throw an error if the formulas are not valid for equivalence introduction
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Equivalence introduction is not applicable to the given formulas."

Received function did not throw
