[Killed] BlockStatement
propositional/natural-calculus/rules/implication-elimination.ts:15:80
  * @returns {[PropFormula]} A tuple containing the inferred formula.
  * @throws {Error} if implication elimination is not applicable.
  */
-export function implicationElimination(formulas: PropFormula[]): [PropFormula] {
-	if (!isImplicationEliminationApplicable(formulas)) {
-		throw new Error(
-			"Implication elimination is not applicable to the given formulas.",
-		);
-	}
-
-	const implicationFormula = formulas.find(
-		(f) => f.operator === Operator.Implies,
-	);
-
-	return [implicationFormula?.values[1] as PropFormula];
-}
+export function implicationElimination(formulas: PropFormula[]): [PropFormula] {}
 
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BooleanLiteral
propositional/natural-calculus/rules/implication-elimination.ts:16:6
  * @throws {Error} if implication elimination is not applicable.
  */
 export function implicationElimination(formulas: PropFormula[]): [PropFormula] {
-	if (!isImplicationEliminationApplicable(formulas)) {
+	if (isImplicationEliminationApplicable(formulas)) {
 		throw new Error(
 			"Implication elimination is not applicable to the given formulas.",
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Killed] BlockStatement
propositional/natural-calculus/rules/implication-elimination.ts:16:53
  * @throws {Error} if implication elimination is not applicable.
  */
 export function implicationElimination(formulas: PropFormula[]): [PropFormula] {
-	if (!isImplicationEliminationApplicable(formulas)) {
-		throw new Error(
-			"Implication elimination is not applicable to the given formulas.",
-		);
-	}
+	if (!isImplicationEliminationApplicable(formulas)) {}
 
 	const implicationFormula = formulas.find(
killedBy: implicationElimination should throw an error if IE is not applicable
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Implication elimination is not applicable to the given formulas."

Received function did not throw

[Killed] EqualityOperator
propositional/natural-calculus/rules/implication-elimination.ts:23:10
 	}
 
 	const implicationFormula = formulas.find(
-		(f) => f.operator === Operator.Implies,
+		(f) => f.operator !== Operator.Implies,
 	);
 
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] ConditionalExpression
propositional/natural-calculus/rules/implication-elimination.ts:23:10
 	}
 
 	const implicationFormula = formulas.find(
-		(f) => f.operator === Operator.Implies,
+		(f) => false,
 	);
 
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] ArrayDeclaration
propositional/natural-calculus/rules/implication-elimination.ts:26:9
 		(f) => f.operator === Operator.Implies,
 	);
 
-	return [implicationFormula?.values[1] as PropFormula];
+	return [];
 }
 
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: TypeError: Cannot read properties of undefined (reading 'level')
