[Killed] BlockStatement
propositional/natural-calculus/rules/implication-introduction.ts:16:18
  */
 export function implicationIntroduction(
 	formulas: PropFormula[],
-): [PropFormula] {
-	if (!isImplicationIntroductionApplicable(formulas)) {
-		throw new Error(
-			"Implication introduction is not applicable to the given formulas.",
-		);
-	}
-
-	const [premise, conclusion] = formulas;
-
-	return [{ operator: Operator.Implies, values: [premise, conclusion] }];
-}
+): [PropFormula] {}
 
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BooleanLiteral
propositional/natural-calculus/rules/implication-introduction.ts:17:6
 export function implicationIntroduction(
 	formulas: PropFormula[],
 ): [PropFormula] {
-	if (!isImplicationIntroductionApplicable(formulas)) {
+	if (isImplicationIntroductionApplicable(formulas)) {
 		throw new Error(
 			"Implication introduction is not applicable to the given formulas.",
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: Implication introduction is not applicable to the given formulas.

[Killed] ConditionalExpression
propositional/natural-calculus/rules/implication-introduction.ts:17:6
 export function implicationIntroduction(
 	formulas: PropFormula[],
 ): [PropFormula] {
-	if (!isImplicationIntroductionApplicable(formulas)) {
+	if (true) {
 		throw new Error(
 			"Implication introduction is not applicable to the given formulas.",
killedBy: NaturalProof closeSubProof should close a sub-proof and decrease the current level
statusReason: Error: Implication introduction is not applicable to the given formulas.
