[Killed] BlockStatement
propositional/natural-calculus/rules/negation-elimination.ts:12:77
  * @returns {[PropFormula]} A tuple containing the inferred formula.
  * @throws {Error} if negation introduction rule is not applicable.
  */
-export function negationElimination(formulas: PropFormula[]): [PropFormula] {
-	if (!isNegationEliminationApplicable(formulas)) {
-		throw new Error(
-			"Negation elimination is not applicable to the given formulas.",
-		);
-	}
-
-	const firstNegationFormula = formulas[0];
-	const secondNegationFormula = firstNegationFormula.values[0] as PropFormula;
-
-	return [secondNegationFormula.values[0] as PropFormula];
-}
+export function negationElimination(formulas: PropFormula[]): [PropFormula] {}
 
killedBy: generateNaturalProofSteps should support negation elimination rule
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
propositional/natural-calculus/rules/negation-elimination.ts:13:50
  * @throws {Error} if negation introduction rule is not applicable.
  */
 export function negationElimination(formulas: PropFormula[]): [PropFormula] {
-	if (!isNegationEliminationApplicable(formulas)) {
-		throw new Error(
-			"Negation elimination is not applicable to the given formulas.",
-		);
-	}
+	if (!isNegationEliminationApplicable(formulas)) {}
 
 	const firstNegationFormula = formulas[0];
killedBy: negationElimination should throw an error when input is empty
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Negation elimination is not applicable to the given formulas."
Received message:   "Cannot read properties of undefined (reading 'values')"

      71 |     }
      72 |     const firstNegationFormula = formulas[0];
    > 73 |     const secondNegationFormula = firstNegationFormula.values[0] as PropFormula;

[Killed] ConditionalExpression
propositional/natural-calculus/rules/negation-elimination.ts:13:6
  * @throws {Error} if negation introduction rule is not applicable.
  */
 export function negationElimination(formulas: PropFormula[]): [PropFormula] {
-	if (!isNegationEliminationApplicable(formulas)) {
+	if (false) {
 		throw new Error(
 			"Negation elimination is not applicable to the given formulas.",
killedBy: negationElimination should throw an error when input is empty
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Negation elimination is not applicable to the given formulas."
Received message:   "Cannot read properties of undefined (reading 'values')"

      71 |     }
      72 |     const firstNegationFormula = formulas[0];
    > 73 |     const secondNegationFormula = firstNegationFormula.values[0] as PropFormula;

[Killed] ArrayDeclaration
propositional/natural-calculus/rules/negation-elimination.ts:22:9
 	const firstNegationFormula = formulas[0];
 	const secondNegationFormula = firstNegationFormula.values[0] as PropFormula;
 
-	return [secondNegationFormula.values[0] as PropFormula];
+	return [];
 }
 
killedBy: generateNaturalProofSteps should support negation elimination rule
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []
