[Killed] BlockStatement
propositional/natural-calculus/rules/negation-introduction.ts:13:78
  * @returns {[PropFormula]} A tuple containing the inferred formula.
  * @throws {Error} if negation introduction rule is not applicable.
  */
-export function negationIntroduction(formulas: PropFormula[]): [PropFormula] {
-	if (!isNegationIntroductionApplicable(formulas)) {
-		throw new Error(
-			"Negation introduction is not applicable to the given formulas.",
-		);
-	}
-
-	// Extract antecedent from the input formulas (both must have the same antecedent)
-	const antecedent = formulas[0].values[0] as PropFormula;
-
-	return [
-		{
-			operator: Operator.Not,
-			values: [antecedent],
-		},
-	];
-}
+export function negationIntroduction(formulas: PropFormula[]): [PropFormula] {}
 
killedBy: generateNaturalProofSteps should support negation introduction rule
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BooleanLiteral
propositional/natural-calculus/rules/negation-introduction.ts:14:6
  * @throws {Error} if negation introduction rule is not applicable.
  */
 export function negationIntroduction(formulas: PropFormula[]): [PropFormula] {
-	if (!isNegationIntroductionApplicable(formulas)) {
+	if (isNegationIntroductionApplicable(formulas)) {
 		throw new Error(
 			"Negation introduction is not applicable to the given formulas.",
killedBy: generateNaturalProofSteps should support negation introduction rule
statusReason: Error: Negation introduction is not applicable to the given formulas.

[Killed] BlockStatement
propositional/natural-calculus/rules/negation-introduction.ts:14:51
  * @throws {Error} if negation introduction rule is not applicable.
  */
 export function negationIntroduction(formulas: PropFormula[]): [PropFormula] {
-	if (!isNegationIntroductionApplicable(formulas)) {
-		throw new Error(
-			"Negation introduction is not applicable to the given formulas.",
-		);
-	}
+	if (!isNegationIntroductionApplicable(formulas)) {}
 
 	// Extract antecedent from the input formulas (both must have the same antecedent)
killedBy: negationIntroduction should throw an error if negation introduction is not applicable
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Negation introduction is not applicable to the given formulas."

Received function did not throw

[Killed] ArrayDeclaration
propositional/natural-calculus/rules/negation-introduction.ts:26:12
 	return [
 		{
 			operator: Operator.Not,
-			values: [antecedent],
+			values: [],
 		},
 	];
killedBy: generateNaturalProofSteps should support negation introduction rule
statusReason: TypeError: Cannot destructure property 'operator' of 'node' as it is undefined.
