[Killed] BlockStatement
src/propositional/truth-tables/generate-prop-truth-table.ts:18:24
 export function generatePropTruthTable(
 	formula: PropFormula,
 	limit = 100,
-): TruthAssignmentsMap {
-	// Step 1: Extract variables from the formula
-	const variablesMap = extractPropVariables(formula);
-	const variableCount = variablesMap.size;
-
-	// Step 2: Generate truth assignments
-	const truthAssignments = generateTruthAssignments(variableCount, limit);
-
-	// Step 3: Compute formula truth values
-	const truthTable: TruthAssignmentsMap = new Map();
-
-	truthAssignments.forEach((assignment, index) => {
-		const formulaValue = calculatePropFormula({
-			formula,
-			assignment,
-			variablesMap,
-		});
-
-		truthTable.set(index, [...assignment, formulaValue]);
-	});
-
-	return truthTable;
-}
+): TruthAssignmentsMap {}
 
killedBy: generatePropTruthTable should generate a truth table for a simple NAND formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: Map {0 => [false, false, true], 1 => [false, true, true], 2 => [true, false, true], 3 => [true, true, false]}
Received: undefined

[Killed] BlockStatement
src/propositional/truth-tables/generate-prop-truth-table.ts:29:50
 	// Step 3: Compute formula truth values
 	const truthTable: TruthAssignmentsMap = new Map();
 
-	truthAssignments.forEach((assignment, index) => {
-		const formulaValue = calculatePropFormula({
-			formula,
-			assignment,
-			variablesMap,
-		});
-
-		truthTable.set(index, [...assignment, formulaValue]);
-	});
+	truthAssignments.forEach((assignment, index) => {});
 
 	return truthTable;
killedBy: generatePropTruthTable should generate a truth table for a simple NAND formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 22
+ Received  +  1

- Map {
-   0 => Array [
-     false,
