[Killed] BlockStatement
src/propositional/truth-tables/generate-truth-assignments.ts:15:24
 export function generateTruthAssignments(
 	varCount: number,
 	limit: number = 100,
-): TruthAssignmentsMap {
-	if (varCount > limit) {
-		throw new Error(
-			`Exceeded maximum variable limit (${limit}) for truth assignments.`,
-		);
-	}
-
-	const numAssignments = 2 ** varCount;
-	const assignments: TruthAssignmentsMap = new Map();
-
-	for (let i = 0; i < numAssignments; i++) {
-		const binaryValues = Array.from({ length: varCount }, (_, bit) =>
-			Boolean(i & (1 << (varCount - bit - 1))),
-		);
-		assignments.set(i, binaryValues);
-	}
-
-	return assignments;
-}
+): TruthAssignmentsMap {}
 
killedBy: generatePropTruthTable should generate a truth table for a simple NAND formula
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ConditionalExpression
src/propositional/truth-tables/generate-truth-assignments.ts:16:6
 	varCount: number,
 	limit: number = 100,
 ): TruthAssignmentsMap {
-	if (varCount > limit) {
+	if (true) {
 		throw new Error(
 			`Exceeded maximum variable limit (${limit}) for truth assignments.`,
killedBy: generatePropTruthTable should generate a truth table for a simple NAND formula
statusReason: Error: Exceeded maximum variable limit (100) for truth assignments.

[Timeout] BlockStatement
src/propositional/truth-tables/generate-truth-assignments.ts:16:24
 	varCount: number,
 	limit: number = 100,
 ): TruthAssignmentsMap {
-	if (varCount > limit) {
-		throw new Error(
-			`Exceeded maximum variable limit (${limit}) for truth assignments.`,
-		);
-	}
+	if (varCount > limit) {}
 
 	const numAssignments = 2 ** varCount;

[Killed] ConditionalExpression
src/propositional/truth-tables/generate-truth-assignments.ts:25:18
 	const numAssignments = 2 ** varCount;
 	const assignments: TruthAssignmentsMap = new Map();
 
-	for (let i = 0; i < numAssignments; i++) {
+	for (let i = 0; false; i++) {
 		const binaryValues = Array.from({ length: varCount }, (_, bit) =>
 			Boolean(i & (1 << (varCount - bit - 1))),
killedBy: generatePropTruthTable should generate a truth table for a simple NAND formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 22
+ Received  +  1

- Map {
-   0 => Array [
-     false,

[Killed] EqualityOperator
src/propositional/truth-tables/generate-truth-assignments.ts:25:18
 	const numAssignments = 2 ** varCount;
 	const assignments: TruthAssignmentsMap = new Map();
 
-	for (let i = 0; i < numAssignments; i++) {
+	for (let i = 0; i <= numAssignments; i++) {
 		const binaryValues = Array.from({ length: varCount }, (_, bit) =>
 			Boolean(i & (1 << (varCount - bit - 1))),
killedBy: generatePropTruthTable should generate a truth table for a simple NAND formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

@@ -17,6 +17,11 @@
    3 => Array [
      true,

[Killed] ArrowFunction
src/propositional/truth-tables/generate-truth-assignments.ts:26:57
 	const assignments: TruthAssignmentsMap = new Map();
 
 	for (let i = 0; i < numAssignments; i++) {
-		const binaryValues = Array.from({ length: varCount }, (_, bit) =>
-			Boolean(i & (1 << (varCount - bit - 1))),
+		const binaryValues = Array.from({ length: varCount }, () => undefined,
 		);
 		assignments.set(i, binaryValues);
killedBy: generatePropTruthTable should generate a truth table for a simple NAND formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

  Map {
    0 => Array [
-     false,

[Killed] ArithmeticOperator
src/propositional/truth-tables/generate-truth-assignments.ts:27:23
 
 	for (let i = 0; i < numAssignments; i++) {
 		const binaryValues = Array.from({ length: varCount }, (_, bit) =>
-			Boolean(i & (1 << (varCount - bit - 1))),
+			Boolean(i & (1 << (varCount + bit - 1))),
 		);
 		assignments.set(i, binaryValues);
killedBy: generatePropTruthTable should generate a truth table for a simple NAND formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -4,19 +4,19 @@
      false,
      true,

[Killed] ArithmeticOperator
src/propositional/truth-tables/generate-truth-assignments.ts:27:23
 
 	for (let i = 0; i < numAssignments; i++) {
 		const binaryValues = Array.from({ length: varCount }, (_, bit) =>
-			Boolean(i & (1 << (varCount - bit - 1))),
+			Boolean(i & (1 << (varCount - bit + 1))),
 		);
 		assignments.set(i, binaryValues);
killedBy: generatePropTruthTable should generate a truth table for a simple NAND formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -4,19 +4,19 @@
      false,
      true,
