[Killed] BlockStatement
src/propositional/validators/validate-prop-formulas.ts:52:38
 	checks: PropFormulaCheck[] = Object.keys(
 		PropFormulaCheck,
 	) as PropFormulaCheck[],
-): Record<PropFormulaCheck, boolean> {
-	return checks.reduce<Record<string, boolean>>((results, checkName) => {
-		const checkFunction = PROP_FORMULA_CHECKS[checkName];
-		results[checkName] = checkFunction ? checkFunction(formulas) : false;
-		return results;
-	}, {});
-}
+): Record<PropFormulaCheck, boolean> {}
 
killedBy: validatePropFormulas applies all checks by default
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
src/propositional/validators/validate-prop-formulas.ts:53:72
 		PropFormulaCheck,
 	) as PropFormulaCheck[],
 ): Record<PropFormulaCheck, boolean> {
-	return checks.reduce<Record<string, boolean>>((results, checkName) => {
-		const checkFunction = PROP_FORMULA_CHECKS[checkName];
-		results[checkName] = checkFunction ? checkFunction(formulas) : false;
-		return results;
-	}, {});
+	return checks.reduce<Record<string, boolean>>((results, checkName) => {}, {});
 }
 
killedBy: validatePropFormulas applies all checks by default
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BooleanLiteral
src/propositional/validators/validate-prop-formulas.ts:55:66
 ): Record<PropFormulaCheck, boolean> {
 	return checks.reduce<Record<string, boolean>>((results, checkName) => {
 		const checkFunction = PROP_FORMULA_CHECKS[checkName];
-		results[checkName] = checkFunction ? checkFunction(formulas) : false;
+		results[checkName] = checkFunction ? checkFunction(formulas) : true;
 		return results;
 	}, {});
killedBy: validatePropFormulas handles invalid check names gracefully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "invalidCheck": false,
+   "invalidCheck": true,
