[Killed] BlockStatement
src/tokenizer/get-glyph-unicode.ts:28:61
  * @returns The corresponding Unicode character from the `GlyphUnicode` enum.
  * @throws {Error} If the character is not a recognized {@link Glyph}.
  */
-export function getGlyphUnicode(char: string): GlyphUnicode {
-	if (char in GlyphsDictionary) {
-		return GlyphsDictionary[char as Glyph];
-	} else {
-		throw new Error(`Cannot get a GlyphUnicode for the character "${char}".`);
-	}
-}
+export function getGlyphUnicode(char: string): GlyphUnicode {}
 
killedBy: NaturalProof replace should replace atoms in complex formulas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(B → B)"
Received: "(B undefined B)"

[Killed] BlockStatement
src/tokenizer/get-glyph-unicode.ts:29:32
  * @throws {Error} If the character is not a recognized {@link Glyph}.
  */
 export function getGlyphUnicode(char: string): GlyphUnicode {
-	if (char in GlyphsDictionary) {
-		return GlyphsDictionary[char as Glyph];
-	} else {
+	if (char in GlyphsDictionary) {} else {
 		throw new Error(`Cannot get a GlyphUnicode for the character "${char}".`);
 	}
killedBy: NaturalProof replace should replace atoms in complex formulas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(B → B)"
Received: "(B undefined B)"

[Killed] ConditionalExpression
src/tokenizer/get-glyph-unicode.ts:29:6
  * @throws {Error} If the character is not a recognized {@link Glyph}.
  */
 export function getGlyphUnicode(char: string): GlyphUnicode {
-	if (char in GlyphsDictionary) {
+	if (true) {
 		return GlyphsDictionary[char as Glyph];
 	} else {
killedBy: getGlyphUnicode should throw an error for an unrecognized character
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot get a GlyphUnicode for the character \"+\""

Received function did not throw

[Killed] BlockStatement
src/tokenizer/get-glyph-unicode.ts:31:9
 export function getGlyphUnicode(char: string): GlyphUnicode {
 	if (char in GlyphsDictionary) {
 		return GlyphsDictionary[char as Glyph];
-	} else {
-		throw new Error(`Cannot get a GlyphUnicode for the character "${char}".`);
-	}
+	} else {}
 }
 
killedBy: getGlyphUnicode should throw an error for an unrecognized character
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot get a GlyphUnicode for the character \"+\""

Received function did not throw
