[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:12:3
  */
 export function getOperatorGlyph(operator: Operator): Glyph {
 	switch (operator) {
-		case Operator.Not:
-			return Glyph.Negation;
+		case Operator.Not:
 		case Operator.And:
 			return Glyph.Conjunction;
killedBy: generateNaturalProofSteps should support negation introduction rule
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "¬P"
Received: "∧P"

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:14:3
 	switch (operator) {
 		case Operator.Not:
 			return Glyph.Negation;
-		case Operator.And:
-			return Glyph.Conjunction;
+		case Operator.And:
 		case Operator.Or:
 			return Glyph.Disjunction;
killedBy: convertPropFormulaToExpression should convert nested formula ((A → B) ∧ ¬C)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,11 +3,11 @@
    "(",
    "a",

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:16:3
 			return Glyph.Negation;
 		case Operator.And:
 			return Glyph.Conjunction;
-		case Operator.Or:
-			return Glyph.Disjunction;
+		case Operator.Or:
 		case Operator.Implies:
 			return Glyph.Implication;
killedBy: generateNaturalProofSteps should support disjunction introduction rule
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(Q ∨ P)"
Received: "(Q → P)"

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:18:3
 			return Glyph.Conjunction;
 		case Operator.Or:
 			return Glyph.Disjunction;
-		case Operator.Implies:
-			return Glyph.Implication;
+		case Operator.Implies:
 		case Operator.ReversedImplies:
 			return Glyph.ReversedImplication;
killedBy: NaturalProof replace should replace atoms in complex formulas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(B → B)"
Received: "(B ← B)"

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:20:3
 			return Glyph.Disjunction;
 		case Operator.Implies:
 			return Glyph.Implication;
-		case Operator.ReversedImplies:
-			return Glyph.ReversedImplication;
+		case Operator.ReversedImplies:
 		case Operator.Equiv:
 			return Glyph.Equivalence;
killedBy: getOperatorGlyph should return the correct glyph for logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<="
Received: "<=>"

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:22:3
 			return Glyph.Implication;
 		case Operator.ReversedImplies:
 			return Glyph.ReversedImplication;
-		case Operator.Equiv:
-			return Glyph.Equivalence;
+		case Operator.Equiv:
 		case Operator.Xor:
 			return Glyph.ExclusiveConjunction;
killedBy: generateNaturalProofSteps should support equivalence introduction rule
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(P ≡ R)"
Received: "(P ⊕ R)"

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:24:3
 			return Glyph.ReversedImplication;
 		case Operator.Equiv:
 			return Glyph.Equivalence;
-		case Operator.Xor:
-			return Glyph.ExclusiveConjunction;
+		case Operator.Xor:
 		case Operator.Nand:
 			return Glyph.ShefferStroke;
killedBy: getOperatorGlyph should return the correct glyph for logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "^"
Received: "!&"

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:26:3
 			return Glyph.Equivalence;
 		case Operator.Xor:
 			return Glyph.ExclusiveConjunction;
-		case Operator.Nand:
-			return Glyph.ShefferStroke;
+		case Operator.Nand:
 		case Operator.Nor:
 			return Glyph.WebbOperation;
killedBy: getOperatorGlyph should return the correct glyph for logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "!&"
Received: "!|"

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:28:3
 			return Glyph.ExclusiveConjunction;
 		case Operator.Nand:
 			return Glyph.ShefferStroke;
-		case Operator.Nor:
-			return Glyph.WebbOperation;
+		case Operator.Nor:
 		case Operator.AntiImplies:
 			return Glyph.AntiImplication;
killedBy: convertPropFormulaToString should handle NOR operation correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(A ↓ B)"
Received: "(A ↛ B)"

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:30:3
 			return Glyph.ShefferStroke;
 		case Operator.Nor:
 			return Glyph.WebbOperation;
-		case Operator.AntiImplies:
-			return Glyph.AntiImplication;
+		case Operator.AntiImplies:
 		case Operator.ReversedAntiImplies:
 			return Glyph.ReversedAntiImplication;
killedBy: getOperatorGlyph should return the correct glyph for logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "!=>"
Received: "!<="

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:32:3
 			return Glyph.WebbOperation;
 		case Operator.AntiImplies:
 			return Glyph.AntiImplication;
-		case Operator.ReversedAntiImplies:
-			return Glyph.ReversedAntiImplication;
+		case Operator.ReversedAntiImplies:
 		case Operator.Contradiction:
 			return Glyph.Contradiction;
killedBy: getOperatorGlyph should return the correct glyph for logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "!<="
Received: "#"

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:34:3
 			return Glyph.AntiImplication;
 		case Operator.ReversedAntiImplies:
 			return Glyph.ReversedAntiImplication;
-		case Operator.Contradiction:
-			return Glyph.Contradiction;
+		case Operator.Contradiction:
 		case Operator.Tautology:
 			return Glyph.Tautology;
killedBy: getOperatorGlyph should return the correct glyph for logical operators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#"
Received: "@"

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:36:3
 			return Glyph.ReversedAntiImplication;
 		case Operator.Contradiction:
 			return Glyph.Contradiction;
-		case Operator.Tautology:
-			return Glyph.Tautology;
+		case Operator.Tautology:
 		default:
 			throw new Error(`Cannot convert operator "${operator}" to a glyph.`);
killedBy: getOperatorGlyph should return the correct glyph for logical operators
statusReason: Error: Cannot convert operator "TAUTOLOGY" to a glyph.

[Killed] ConditionalExpression
src/tokenizer/get-operator-glyph.ts:38:3
 			return Glyph.Contradiction;
 		case Operator.Tautology:
 			return Glyph.Tautology;
-		default:
-			throw new Error(`Cannot convert operator "${operator}" to a glyph.`);
+		default:
 	}
 }
killedBy: getOperatorGlyph should throw an error for an unrecognized operator
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot convert operator \"VAR\" to a glyph."

Received function did not throw
