[Killed] ConditionalExpression
src/tokenizer/tokenize-string.ts:16:6
  * @throws {Error} If the input contains unsupported characters.
  */
 export function tokenizeString(input: string): string[] {
-	if (!input.length) return [];
+	if (false) return [];
 	// Sort by length to match longest first
 	const glyphs = Object.values(Glyph).sort((a, b) => b.length - a.length);
killedBy: tokenizeString should handle empty input gracefully
statusReason: Error: Invalid character(s) found in input: "".

[Killed] ArrowFunction
src/tokenizer/tokenize-string.ts:18:43
 export function tokenizeString(input: string): string[] {
 	if (!input.length) return [];
 	// Sort by length to match longest first
-	const glyphs = Object.values(Glyph).sort((a, b) => b.length - a.length);
+	const glyphs = Object.values(Glyph).sort(() => undefined);
 	// Escape special chars
 	const glyphPattern = glyphs
killedBy: createPropFormula Basic parsing should correctly parse an equivalence
statusReason: Error: Invalid character(s) found in input: "((A & B) <=> (C | D))".

[Killed] ArithmeticOperator
src/tokenizer/tokenize-string.ts:18:53
 export function tokenizeString(input: string): string[] {
 	if (!input.length) return [];
 	// Sort by length to match longest first
-	const glyphs = Object.values(Glyph).sort((a, b) => b.length - a.length);
+	const glyphs = Object.values(Glyph).sort((a, b) => b.length + a.length);
 	// Escape special chars
 	const glyphPattern = glyphs
killedBy: createPropFormula Basic parsing should correctly parse an equivalence
statusReason: Error: Invalid character(s) found in input: "((A & B) <=> (C | D))".

[Timeout] ArrowFunction
src/tokenizer/tokenize-string.ts:21:8
 	const glyphs = Object.values(Glyph).sort((a, b) => b.length - a.length);
 	// Escape special chars
 	const glyphPattern = glyphs
-		.map((g) => g.replaceAll(/[.*+?^${}()|[\]\\]/g, String.raw`\$&`))
+		.map(() => undefined)
 		.join("|");
 	// Variables: one or more English letters

[Timeout] BlockStatement
src/tokenizer/tokenize-string.ts:30:25
 	const tokens: string[] = [];
 	let match: RegExpExecArray | null = tokenizer.exec(input);
 
-	while (match !== null) {
-		tokens.push(match[0]);
-		match = tokenizer.exec(input);
-	}
+	while (match !== null) {}
 
 	if (!tokens.length || tokens.join("") !== input.replaceAll(/\s+/g, "")) {

[Killed] LogicalOperator
src/tokenizer/tokenize-string.ts:35:6
 		match = tokenizer.exec(input);
 	}
 
-	if (!tokens.length || tokens.join("") !== input.replaceAll(/\s+/g, "")) {
+	if (!tokens.length && tokens.join("") !== input.replaceAll(/\s+/g, "")) {
 		throw new Error(`Invalid character(s) found in input: "${input}".`);
 	}
killedBy: tokenizeString should throw an error for invalid characters (numbers, special symbols)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid character(s) found in input: \"1234*&2%\"."

Received function did not throw

[Killed] BlockStatement
src/tokenizer/tokenize-string.ts:35:74
 		match = tokenizer.exec(input);
 	}
 
-	if (!tokens.length || tokens.join("") !== input.replaceAll(/\s+/g, "")) {
-		throw new Error(`Invalid character(s) found in input: "${input}".`);
-	}
+	if (!tokens.length || tokens.join("") !== input.replaceAll(/\s+/g, "")) {}
 
 	return tokens;
killedBy: tokenizeString should throw an error for invalid characters (numbers, special symbols)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid character(s) found in input: \"1234*&2%\"."

Received function did not throw
