[Killed] EqualityOperator
src/propositional/converters/extract-prop-sub-formulas.ts:14:6
  * @category Converters
  */
 export function extractPropSubFormulas(formula: PropFormula): PropFormula[] {
-	if (formula.operator === Operator.Var) return [];
+	if (formula.operator !== Operator.Var) return [];
 
 	const subFormulas = new Set<string>();
killedBy: extractPropSubFormulas() should extract all sub-formulas in the correct order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

- Array [
-   Object {
-     "operator": "NOT",

[Killed] ConditionalExpression
src/propositional/converters/extract-prop-sub-formulas.ts:14:6
  * @category Converters
  */
 export function extractPropSubFormulas(formula: PropFormula): PropFormula[] {
-	if (formula.operator === Operator.Var) return [];
+	if (true) return [];
 
 	const subFormulas = new Set<string>();
killedBy: extractPropSubFormulas() should extract all sub-formulas in the correct order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

- Array [
-   Object {
-     "operator": "NOT",

[Killed] BlockStatement
src/propositional/converters/extract-prop-sub-formulas.ts:19:51
 	const subFormulas = new Set<string>();
 	const result: PropFormula[] = [];
 
-	function traverse(subFormula: PropFormula): void {
-		if (subFormula.operator === Operator.Var) {
-			return;
-		}
-
-		const key = JSON.stringify(subFormula);
-		if (!subFormulas.has(key)) {
-			subFormulas.add(key);
-			result.push(subFormula);
-		}
-
-		if (Array.isArray(subFormula.values)) {
-			for (const value of subFormula.values) {
-				traverse(value as PropFormula);
-			}
-		}
-	}
+	function traverse(subFormula: PropFormula): void {}
 
 	if (Array.isArray(formula.values)) {
killedBy: extractPropSubFormulas() should extract all sub-formulas in the correct order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

- Array [
-   Object {
-     "operator": "NOT",

[Killed] ConditionalExpression
src/propositional/converters/extract-prop-sub-formulas.ts:20:7
 	const result: PropFormula[] = [];
 
 	function traverse(subFormula: PropFormula): void {
-		if (subFormula.operator === Operator.Var) {
+		if (true) {
 			return;
 		}
killedBy: extractPropSubFormulas() should extract all sub-formulas in the correct order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

- Array [
-   Object {
-     "operator": "NOT",

[Killed] ConditionalExpression
src/propositional/converters/extract-prop-sub-formulas.ts:20:7
 	const result: PropFormula[] = [];
 
 	function traverse(subFormula: PropFormula): void {
-		if (subFormula.operator === Operator.Var) {
+		if (false) {
 			return;
 		}
killedBy: extractPropSubFormulas() should extract all sub-formulas in the correct order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 14

@@ -8,6 +8,20 @@
            "A",
          ],

[Killed] BlockStatement
src/propositional/converters/extract-prop-sub-formulas.ts:25:30
 		}
 
 		const key = JSON.stringify(subFormula);
-		if (!subFormulas.has(key)) {
-			subFormulas.add(key);
-			result.push(subFormula);
-		}
+		if (!subFormulas.has(key)) {}
 
 		if (Array.isArray(subFormula.values)) {
killedBy: extractPropSubFormulas() should extract all sub-formulas in the correct order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

- Array [
-   Object {
-     "operator": "NOT",

[Killed] BooleanLiteral
src/propositional/converters/extract-prop-sub-formulas.ts:25:7
 		}
 
 		const key = JSON.stringify(subFormula);
-		if (!subFormulas.has(key)) {
+		if (subFormulas.has(key)) {
 			subFormulas.add(key);
 			result.push(subFormula);
killedBy: extractPropSubFormulas() should extract all sub-formulas in the correct order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

- Array [
-   Object {
-     "operator": "NOT",

[Killed] ConditionalExpression
src/propositional/converters/extract-prop-sub-formulas.ts:30:7
 			result.push(subFormula);
 		}
 
-		if (Array.isArray(subFormula.values)) {
+		if (false) {
 			for (const value of subFormula.values) {
 				traverse(value as PropFormula);
killedBy: extractPropSubFormulas() should extract sub-formulas with deeply nested structures
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 1
Received array:  [{"operator": "OR", "values": [{"operator": "AND", "values": [{"operator": "OR", "values": [{"operator": "VAR", "values": ["A"]}, {"operator": "VAR", "values": ["B"]}]}, {"operator": "VAR", "values": ["C"]}]}, {"operator": "VAR", "values": ["D"]}]}]

[Killed] BlockStatement
src/propositional/converters/extract-prop-sub-formulas.ts:30:41
 			result.push(subFormula);
 		}
 
-		if (Array.isArray(subFormula.values)) {
-			for (const value of subFormula.values) {
-				traverse(value as PropFormula);
-			}
-		}
+		if (Array.isArray(subFormula.values)) {}
 	}
 
killedBy: extractPropSubFormulas() should extract sub-formulas with deeply nested structures
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 1
Received array:  [{"operator": "OR", "values": [{"operator": "AND", "values": [{"operator": "OR", "values": [{"operator": "VAR", "values": ["A"]}, {"operator": "VAR", "values": ["B"]}]}, {"operator": "VAR", "values": ["C"]}]}, {"operator": "VAR", "values": ["D"]}]}]

[Killed] BlockStatement
src/propositional/converters/extract-prop-sub-formulas.ts:31:43
 		}
 
 		if (Array.isArray(subFormula.values)) {
-			for (const value of subFormula.values) {
-				traverse(value as PropFormula);
-			}
+			for (const value of subFormula.values) {}
 		}
 	}
killedBy: extractPropSubFormulas() should extract sub-formulas with deeply nested structures
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 1
Received array:  [{"operator": "OR", "values": [{"operator": "AND", "values": [{"operator": "OR", "values": [{"operator": "VAR", "values": ["A"]}, {"operator": "VAR", "values": ["B"]}]}, {"operator": "VAR", "values": ["C"]}]}, {"operator": "VAR", "values": ["D"]}]}]

[Killed] ConditionalExpression
src/propositional/converters/extract-prop-sub-formulas.ts:37:6
 		}
 	}
 
-	if (Array.isArray(formula.values)) {
+	if (false) {
 		for (const value of formula.values) {
 			traverse(value as PropFormula);
killedBy: extractPropSubFormulas() should extract all sub-formulas in the correct order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

- Array [
-   Object {
-     "operator": "NOT",

[Killed] BlockStatement
src/propositional/converters/extract-prop-sub-formulas.ts:37:37
 		}
 	}
 
-	if (Array.isArray(formula.values)) {
-		for (const value of formula.values) {
-			traverse(value as PropFormula);
-		}
-	}
+	if (Array.isArray(formula.values)) {}
 
 	return result;
killedBy: extractPropSubFormulas() should extract all sub-formulas in the correct order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

- Array [
-   Object {
-     "operator": "NOT",

[Killed] BlockStatement
src/propositional/converters/extract-prop-sub-formulas.ts:38:39
 	}
 
 	if (Array.isArray(formula.values)) {
-		for (const value of formula.values) {
-			traverse(value as PropFormula);
-		}
+		for (const value of formula.values) {}
 	}
 
killedBy: extractPropSubFormulas() should extract all sub-formulas in the correct order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

- Array [
-   Object {
-     "operator": "NOT",
