[Killed] BlockStatement
src/propositional/converters/extract-prop-variables.ts:13:28
  */
 export function extractPropVariables(
 	formula: PropFormula,
-): PropFormulaVariablesMap {
-	const variablesSet: Set<string> = new Set();
-
-	function traverse(node: PropFormula): void {
-		if (node.operator === Operator.Var) {
-			variablesSet.add(node.values[0] as string); // Extract variable name
-			return;
-		}
-
-		if (Array.isArray(node.values)) {
-			const subFormulas = node.values as PropFormula[];
-			for (const subFormula of subFormulas) {
-				traverse(subFormula);
-			}
-		}
-	}
-
-	traverse(formula);
-
-	const sortedVariables = Array.from(variablesSet).sort((a, b) =>
-		a.localeCompare(b),
-	);
-
-	return new Map(sortedVariables.map((varName, index) => [index, [varName]]));
-}
+): PropFormulaVariablesMap {}
 
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: TypeError: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
src/propositional/converters/extract-prop-variables.ts:16:45
 ): PropFormulaVariablesMap {
 	const variablesSet: Set<string> = new Set();
 
-	function traverse(node: PropFormula): void {
-		if (node.operator === Operator.Var) {
-			variablesSet.add(node.values[0] as string); // Extract variable name
-			return;
-		}
-
-		if (Array.isArray(node.values)) {
-			const subFormulas = node.values as PropFormula[];
-			for (const subFormula of subFormulas) {
-				traverse(subFormula);
-			}
-		}
-	}
+	function traverse(node: PropFormula): void {}
 
 	traverse(formula);
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: Error: Mismatch between formula variables (0) and assignment length (1).

[Killed] ConditionalExpression
src/propositional/converters/extract-prop-variables.ts:17:7
 	const variablesSet: Set<string> = new Set();
 
 	function traverse(node: PropFormula): void {
-		if (node.operator === Operator.Var) {
+		if (true) {
 			variablesSet.add(node.values[0] as string); // Extract variable name
 			return;
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/propositional/converters/extract-prop-variables.ts:17:7
 	const variablesSet: Set<string> = new Set();
 
 	function traverse(node: PropFormula): void {
-		if (node.operator === Operator.Var) {
+		if (node.operator !== Operator.Var) {
 			variablesSet.add(node.values[0] as string); // Extract variable name
 			return;
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/converters/extract-prop-variables.ts:22:7
 			return;
 		}
 
-		if (Array.isArray(node.values)) {
+		if (false) {
 			const subFormulas = node.values as PropFormula[];
 			for (const subFormula of subFormulas) {
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: Error: Mismatch between formula variables (0) and assignment length (1).

[Killed] BlockStatement
src/propositional/converters/extract-prop-variables.ts:22:35
 			return;
 		}
 
-		if (Array.isArray(node.values)) {
-			const subFormulas = node.values as PropFormula[];
-			for (const subFormula of subFormulas) {
-				traverse(subFormula);
-			}
-		}
+		if (Array.isArray(node.values)) {}
 	}
 
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: Error: Mismatch between formula variables (0) and assignment length (1).

[Killed] BlockStatement
src/propositional/converters/extract-prop-variables.ts:24:42
 
 		if (Array.isArray(node.values)) {
 			const subFormulas = node.values as PropFormula[];
-			for (const subFormula of subFormulas) {
-				traverse(subFormula);
-			}
+			for (const subFormula of subFormulas) {}
 		}
 	}
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: Error: Mismatch between formula variables (0) and assignment length (1).

[Killed] MethodExpression
src/propositional/converters/extract-prop-variables.ts:32:26
 
 	traverse(formula);
 
-	const sortedVariables = Array.from(variablesSet).sort((a, b) =>
-		a.localeCompare(b),
-	);
+	const sortedVariables = Array.from(variablesSet);
 
 	return new Map(sortedVariables.map((varName, index) => [index, [varName]]));
killedBy: extractPropVariables extracts and sorts variables alphabetically
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Map {
    0 => Array [
-     "A",

[Killed] ArrowFunction
src/propositional/converters/extract-prop-variables.ts:32:56
 
 	traverse(formula);
 
-	const sortedVariables = Array.from(variablesSet).sort((a, b) =>
-		a.localeCompare(b),
+	const sortedVariables = Array.from(variablesSet).sort(() => undefined,
 	);
 
killedBy: extractPropVariables extracts and sorts variables alphabetically
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Map {
    0 => Array [
-     "A",

[Killed] ArrowFunction
src/propositional/converters/extract-prop-variables.ts:36:37
 		a.localeCompare(b),
 	);
 
-	return new Map(sortedVariables.map((varName, index) => [index, [varName]]));
+	return new Map(sortedVariables.map(() => undefined));
 }
 
killedBy: calculatePropFormula should evaluate a NOT operation
statusReason: TypeError: Iterator value undefined is not an entry object
