[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof-builder.ts:30:33
 	 * Creates a new proof builder with a goal formula.
 	 * @param goal - The target formula to prove
 	 */
-	constructor(goal: PropFormula) {
-		this.proof = new HilbertProof(goal);
-	}
+	constructor(goal: PropFormula) {}
 
 	/**
killedBy: HilbertProofBuilder and functional proof generation HilbertProofBuilder class should create a builder with a goal formula
statusReason: TypeError: Cannot read properties of undefined (reading 'getGoal')

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof-builder.ts:40:59
 	 * @param comment - Optional explanation for the premise
 	 * @returns This builder instance for chaining
 	 */
-	addPremise(formula: PropFormula, comment?: string): this {
-		this.proof.addPremise(formula, comment);
-		return this;
-	}
+	addPremise(formula: PropFormula, comment?: string): this {}
 
 	/**
killedBy: HilbertProofBuilder and functional proof generation HilbertProofBuilder class should chain addPremise calls
statusReason: TypeError: Cannot read properties of undefined (reading 'addPremise')

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof-builder.ts:51:65
 	 * @param comment - Optional explanation for the axiom
 	 * @returns This builder instance for chaining
 	 */
-	addAxiom(payload: HilbertAxiomPayload, comment?: string): this {
-		this.proof.addAxiom(payload, comment);
-		return this;
-	}
+	addAxiom(payload: HilbertAxiomPayload, comment?: string): this {}
 
 	/**
killedBy: HilbertProofBuilder and functional proof generation HilbertProofBuilder class should chain addAxiom calls
statusReason: TypeError: Cannot read properties of undefined (reading 'build')

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof-builder.ts:62:73
 	 * @param comment - Optional explanation for the derivation
 	 * @returns This builder instance for chaining
 	 */
-	addDerivedStep(payload: HilbertDerivedPayload, comment?: string): this {
-		this.proof.addDerivedStep(payload, comment);
-		return this;
-	}
+	addDerivedStep(payload: HilbertDerivedPayload, comment?: string): this {}
 
 	/**
killedBy: HilbertProofBuilder and functional proof generation Complex proof scenarios should integrate reiterateStep with other builder methods
statusReason: TypeError: Cannot read properties of undefined (reading 'build')

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof-builder.ts:74:59
 	 * @param comment - Optional explanation for the reiteration
 	 * @returns This builder instance for chaining
 	 */
-	reiterateStep(fromIndex: number, comment?: string): this {
-		this.proof.reiterateStep(fromIndex, comment);
-		return this;
-	}
+	reiterateStep(fromIndex: number, comment?: string): this {}
 
 	/**
killedBy: HilbertProofBuilder and functional proof generation Complex proof scenarios should chain reiterateStep method
statusReason: TypeError: Cannot read properties of undefined (reading 'build')

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof-builder.ts:87:68
 	 * @param substitute - The formula or atom to substitute
 	 * @returns This builder instance for chaining
 	 */
-	replace(atom: PropAtom, substitute: PropFormula | PropAtom): this {
-		this.proof.replace(atom, substitute);
-		return this;
-	}
+	replace(atom: PropAtom, substitute: PropFormula | PropAtom): this {}
 
 	/**
killedBy: HilbertProofBuilder and functional proof generation Complex proof scenarios should chain replace method
statusReason: TypeError: Cannot read properties of undefined (reading 'build')

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof-builder.ts:96:24
 	 * Constructs the proof and returns it.
 	 * @returns The completed HilbertProof instance
 	 */
-	build(): HilbertProof {
-		return this.proof;
-	}
+	build(): HilbertProof {}
 
 	/**
killedBy: HilbertProofBuilder and functional proof generation HilbertProofBuilder class should create a builder with a goal formula
statusReason: TypeError: Cannot read properties of undefined (reading 'getGoal')

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof-builder.ts:116:53
 	 * });
 	 * ```
 	 */
-	buildSteps(stepsFn: (builder: this) => void): this {
-		stepsFn(this);
-		return this;
-	}
+	buildSteps(stepsFn: (builder: this) => void): this {}
 
 	/**
killedBy: HilbertProofBuilder and functional proof generation HilbertProofBuilder class should execute buildSteps callback
statusReason: TypeError: Cannot read properties of undefined (reading 'build')

[Killed] BlockStatement
propositional/hilbert-calculus/classes/hilbert-proof-builder.ts:126:26
 	 * Useful for inspection during construction.
 	 * @returns The current HilbertProof instance
 	 */
-	preview(): HilbertProof {
-		return this.proof;
-	}
+	preview(): HilbertProof {}
 }
 
killedBy: HilbertProofBuilder and functional proof generation HilbertProofBuilder class should provide preview without building
statusReason: TypeError: Cannot read properties of undefined (reading 'getStepCount')
