[Killed] BlockStatement
propositional/hilbert-calculus/generators/build-hilbert-proof.ts:26:75
  *
  * @category Hilbert Calculus
  */
-export function buildHilbertProof(goal: PropFormula): HilbertProofBuilder {
-	return new HilbertProofBuilder(goal);
-}
+export function buildHilbertProof(goal: PropFormula): HilbertProofBuilder {}
 
killedBy: HilbertProofBuilder and functional proof generation Complex proof scenarios should build a complex proof with mixed steps
statusReason: TypeError: Cannot read properties of undefined (reading 'addPremise')
