[Killed] BlockStatement
propositional/hilbert-calculus/generators/compose-hilbert-proof.ts:33:17
 export function composeHilbertProof(
 	goal: PropFormula,
 	...stepGenerators: Array<(builder: HilbertProofBuilder) => void>
-): HilbertProof {
-	const builder = buildHilbertProof(goal);
-	for (const generator of stepGenerators) {
-		generator(builder);
-	}
-	return builder.build();
-}
+): HilbertProof {}
 
killedBy: HilbertProofBuilder and functional proof generation Complex proof scenarios should compose from generator functions
statusReason: TypeError: Cannot read properties of undefined (reading 'getStepCount')

[Killed] BlockStatement
propositional/hilbert-calculus/generators/compose-hilbert-proof.ts:35:42
 	...stepGenerators: Array<(builder: HilbertProofBuilder) => void>
 ): HilbertProof {
 	const builder = buildHilbertProof(goal);
-	for (const generator of stepGenerators) {
-		generator(builder);
-	}
+	for (const generator of stepGenerators) {}
 	return builder.build();
 }
killedBy: HilbertProofBuilder and functional proof generation Complex proof scenarios should compose from generator functions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0
