[Killed] BlockStatement
propositional/natural-calculus/generators/build-natural-proof.ts:27:75
  *
  * @category Natural Calculus
  */
-export function buildNaturalProof(goal: PropFormula): NaturalProofBuilder {
-	return new NaturalProofBuilder(goal);
-}
+export function buildNaturalProof(goal: PropFormula): NaturalProofBuilder {}
 
killedBy: composeNaturalProof function should compose proof from step generators
statusReason: TypeError: Cannot read properties of undefined (reading 'addPremise')
