[Killed] BlockStatement
propositional/natural-calculus/generators/compose-natural-proof.ts:35:17
 export function composeNaturalProof(
 	goal: PropFormula,
 	...stepGenerators: Array<(builder: NaturalProofBuilder) => void>
-): NaturalProof {
-	const builder = buildNaturalProof(goal);
-	for (const generator of stepGenerators) {
-		generator(builder);
-	}
-	return builder.build();
-}
+): NaturalProof {}
 
killedBy: composeNaturalProof function should compose proof from step generators
statusReason: TypeError: Cannot read properties of undefined (reading 'getStepCount')

[Killed] BlockStatement
propositional/natural-calculus/generators/compose-natural-proof.ts:37:42
 	...stepGenerators: Array<(builder: NaturalProofBuilder) => void>
 ): NaturalProof {
 	const builder = buildNaturalProof(goal);
-	for (const generator of stepGenerators) {
-		generator(builder);
-	}
+	for (const generator of stepGenerators) {}
 	return builder.build();
 }
killedBy: composeNaturalProof function should compose proof from step generators
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    0
