[Killed] BlockStatement
src/propositional/validators/are-prop-formulas-structurally-equal.ts:14:12
  */
 export function arePropFormulasStructurallyEqual(
 	formulas: PropFormula[],
-): boolean {
-	if (!formulas.length) return false;
-
-	const strings = formulas.map((formula) => JSON.stringify(formula));
-
-	return strings.every((item) => item === strings[0]);
-}
+): boolean {}
 
killedBy: NaturalProof isComplete should return true when last formula equals goal and level is 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/propositional/validators/are-prop-formulas-structurally-equal.ts:15:6
 export function arePropFormulasStructurallyEqual(
 	formulas: PropFormula[],
 ): boolean {
-	if (!formulas.length) return false;
+	if (true) return false;
 
 	const strings = formulas.map((formula) => JSON.stringify(formula));
killedBy: NaturalProof isComplete should return true when last formula equals goal and level is 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/are-prop-formulas-structurally-equal.ts:15:6
 export function arePropFormulasStructurallyEqual(
 	formulas: PropFormula[],
 ): boolean {
-	if (!formulas.length) return false;
+	if (false) return false;
 
 	const strings = formulas.map((formula) => JSON.stringify(formula));
killedBy: arePropFormulasStructurallyEqual should return false for an empty array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/propositional/validators/are-prop-formulas-structurally-equal.ts:17:31
 ): boolean {
 	if (!formulas.length) return false;
 
-	const strings = formulas.map((formula) => JSON.stringify(formula));
+	const strings = formulas.map(() => undefined);
 
 	return strings.every((item) => item === strings[0]);
killedBy: NaturalProof isComplete should return false when last step does not match goal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/propositional/validators/are-prop-formulas-structurally-equal.ts:19:23
 
 	const strings = formulas.map((formula) => JSON.stringify(formula));
 
-	return strings.every((item) => item === strings[0]);
+	return strings.every(() => undefined);
 }
 
killedBy: NaturalProof isComplete should return true when last formula equals goal and level is 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/are-prop-formulas-structurally-equal.ts:19:33
 
 	const strings = formulas.map((formula) => JSON.stringify(formula));
 
-	return strings.every((item) => item === strings[0]);
+	return strings.every((item) => false);
 }
 
killedBy: NaturalProof isComplete should return true when last formula equals goal and level is 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
