[Killed] EqualityOperator
src/propositional/validators/is-disjunction-elimination-applicable.ts:20:6
 export function isDisjunctionEliminationApplicable(
 	formulas: PropFormula[],
 ): boolean {
-	if (formulas.length !== 3) return false;
+	if (formulas.length === 3) return false;
 
 	const [formula1, formula2, formula3] = formulas;
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:20:6
 export function isDisjunctionEliminationApplicable(
 	formulas: PropFormula[],
 ): boolean {
-	if (formulas.length !== 3) return false;
+	if (false) return false;
 
 	const [formula1, formula2, formula3] = formulas;
killedBy: isDisjunctionEliminationApplicable should return false for fewer than three formulas
statusReason: TypeError: Cannot read properties of undefined (reading 'operator')

[Killed] BlockStatement
src/propositional/validators/is-disjunction-elimination-applicable.ts:29:56
 	let implication1: PropFormula | null = null;
 	let implication2: PropFormula | null = null;
 
-	for (const formula of [formula1, formula2, formula3]) {
-		const isValidDisjunction =
-			formula.operator === Operator.Or &&
-			Array.isArray(formula.values) &&
-			formula.values.length === 2;
-		const isValidImplication =
-			formula.operator === Operator.Implies &&
-			Array.isArray(formula.values) &&
-			formula.values.length === 2;
-		const isImplication1Missing = !implication1;
-
-		if (isValidDisjunction) {
-			disjunction = formula;
-		} else if (isValidImplication) {
-			if (isImplication1Missing) {
-				implication1 = formula;
-			} else {
-				implication2 = formula;
-			}
-		}
-	}
+	for (const formula of [formula1, formula2, formula3]) {}
 
 	// Ensure we have exactly one disjunction and two implications
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/propositional/validators/is-disjunction-elimination-applicable.ts:31:4
 
 	for (const formula of [formula1, formula2, formula3]) {
 		const isValidDisjunction =
-			formula.operator === Operator.Or &&
-			Array.isArray(formula.values) &&
-			formula.values.length === 2;
+			formula.operator === Operator.Or && Array.isArray(formula.values) || formula.values.length === 2;
 		const isValidImplication =
 			formula.operator === Operator.Implies &&
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:31:4
 
 	for (const formula of [formula1, formula2, formula3]) {
 		const isValidDisjunction =
-			formula.operator === Operator.Or &&
-			Array.isArray(formula.values) &&
-			formula.values.length === 2;
+			false;
 		const isValidImplication =
 			formula.operator === Operator.Implies &&
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:33:4
 		const isValidDisjunction =
 			formula.operator === Operator.Or &&
 			Array.isArray(formula.values) &&
-			formula.values.length === 2;
+			true;
 		const isValidImplication =
 			formula.operator === Operator.Implies &&
killedBy: isDisjunctionEliminationApplicable should return false when disjunction has invalid structure (wrong length)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/propositional/validators/is-disjunction-elimination-applicable.ts:33:4
 		const isValidDisjunction =
 			formula.operator === Operator.Or &&
 			Array.isArray(formula.values) &&
-			formula.values.length === 2;
+			formula.values.length !== 2;
 		const isValidImplication =
 			formula.operator === Operator.Implies &&
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/propositional/validators/is-disjunction-elimination-applicable.ts:35:4
 			Array.isArray(formula.values) &&
 			formula.values.length === 2;
 		const isValidImplication =
-			formula.operator === Operator.Implies &&
+			formula.operator !== Operator.Implies &&
 			Array.isArray(formula.values) &&
 			formula.values.length === 2;
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:35:4
 			Array.isArray(formula.values) &&
 			formula.values.length === 2;
 		const isValidImplication =
-			formula.operator === Operator.Implies &&
-			Array.isArray(formula.values) &&
-			formula.values.length === 2;
+			false;
 		const isImplication1Missing = !implication1;
 
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/propositional/validators/is-disjunction-elimination-applicable.ts:38:33
 			formula.operator === Operator.Implies &&
 			Array.isArray(formula.values) &&
 			formula.values.length === 2;
-		const isImplication1Missing = !implication1;
+		const isImplication1Missing = implication1;
 
 		if (isValidDisjunction) {
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:40:7
 			formula.values.length === 2;
 		const isImplication1Missing = !implication1;
 
-		if (isValidDisjunction) {
+		if (false) {
 			disjunction = formula;
 		} else if (isValidImplication) {
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:40:7
 			formula.values.length === 2;
 		const isImplication1Missing = !implication1;
 
-		if (isValidDisjunction) {
+		if (true) {
 			disjunction = formula;
 		} else if (isValidImplication) {
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:42:14
 
 		if (isValidDisjunction) {
 			disjunction = formula;
-		} else if (isValidImplication) {
+		} else if (false) {
 			if (isImplication1Missing) {
 				implication1 = formula;
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/propositional/validators/is-disjunction-elimination-applicable.ts:42:34
 
 		if (isValidDisjunction) {
 			disjunction = formula;
-		} else if (isValidImplication) {
-			if (isImplication1Missing) {
-				implication1 = formula;
-			} else {
-				implication2 = formula;
-			}
-		}
+		} else if (isValidImplication) {}
 	}
 
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:43:8
 		if (isValidDisjunction) {
 			disjunction = formula;
 		} else if (isValidImplication) {
-			if (isImplication1Missing) {
+			if (false) {
 				implication1 = formula;
 			} else {
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:43:8
 		if (isValidDisjunction) {
 			disjunction = formula;
 		} else if (isValidImplication) {
-			if (isImplication1Missing) {
+			if (true) {
 				implication1 = formula;
 			} else {
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/propositional/validators/is-disjunction-elimination-applicable.ts:45:11
 		} else if (isValidImplication) {
 			if (isImplication1Missing) {
 				implication1 = formula;
-			} else {
-				implication2 = formula;
-			}
+			} else {}
 		}
 	}
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:52:6
 	}
 
 	// Ensure we have exactly one disjunction and two implications
-	if (!disjunction || !implication1 || !implication2) {
+	if (true) {
 		return false;
 	}
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/propositional/validators/is-disjunction-elimination-applicable.ts:52:6
 	}
 
 	// Ensure we have exactly one disjunction and two implications
-	if (!disjunction || !implication1 || !implication2) {
+	if (disjunction || !implication1 || !implication2) {
 		return false;
 	}
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/propositional/validators/is-disjunction-elimination-applicable.ts:53:10
 
 	// Ensure we have exactly one disjunction and two implications
 	if (!disjunction || !implication1 || !implication2) {
-		return false;
+		return true;
 	}
 
killedBy: isDisjunctionEliminationApplicable should return false if there are not exactly two implications
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/propositional/validators/is-disjunction-elimination-applicable.ts:61:69
 	const [antecedent2, consequent2] = implication2.values as PropFormula[];
 
 	// Check if the implications have the same consequent
-	if (!arePropFormulasStructurallyEqual([consequent1, consequent2])) {
-		return false;
-	}
+	if (!arePropFormulasStructurallyEqual([consequent1, consequent2])) {}
 
 	// Check if the disjunction consists of the antecedents of the two implications
killedBy: isDisjunctionEliminationApplicable should return false when implications have different consequents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/propositional/validators/is-disjunction-elimination-applicable.ts:61:6
 	const [antecedent2, consequent2] = implication2.values as PropFormula[];
 
 	// Check if the implications have the same consequent
-	if (!arePropFormulasStructurallyEqual([consequent1, consequent2])) {
+	if (arePropFormulasStructurallyEqual([consequent1, consequent2])) {
 		return false;
 	}
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/propositional/validators/is-disjunction-elimination-applicable.ts:62:10
 
 	// Check if the implications have the same consequent
 	if (!arePropFormulasStructurallyEqual([consequent1, consequent2])) {
-		return false;
+		return true;
 	}
 
killedBy: isDisjunctionEliminationApplicable should return false when implications have different consequents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:67:4
 
 	// Check if the disjunction consists of the antecedents of the two implications
 	return (
-		(arePropFormulasStructurallyEqual([disjunct1, antecedent1]) &&
-			arePropFormulasStructurallyEqual([disjunct2, antecedent2])) ||
+		(false) ||
 		(arePropFormulasStructurallyEqual([disjunct1, antecedent2]) &&
 			arePropFormulasStructurallyEqual([disjunct2, antecedent1]))
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:67:3
 
 	// Check if the disjunction consists of the antecedents of the two implications
 	return (
-		(arePropFormulasStructurallyEqual([disjunct1, antecedent1]) &&
-			arePropFormulasStructurallyEqual([disjunct2, antecedent2])) ||
-		(arePropFormulasStructurallyEqual([disjunct1, antecedent2]) &&
-			arePropFormulasStructurallyEqual([disjunct2, antecedent1]))
+		false
 	);
 }
killedBy: isDisjunctionEliminationApplicable should return true for valid disjunction elimination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-elimination-applicable.ts:69:4
 	return (
 		(arePropFormulasStructurallyEqual([disjunct1, antecedent1]) &&
 			arePropFormulasStructurallyEqual([disjunct2, antecedent2])) ||
-		(arePropFormulasStructurallyEqual([disjunct1, antecedent2]) &&
-			arePropFormulasStructurallyEqual([disjunct2, antecedent1]))
+		(false)
 	);
 }
killedBy: isDisjunctionEliminationApplicable should return true when antecedents are in different order (swapped)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] LogicalOperator
src/propositional/validators/is-disjunction-elimination-applicable.ts:69:4
 	return (
 		(arePropFormulasStructurallyEqual([disjunct1, antecedent1]) &&
 			arePropFormulasStructurallyEqual([disjunct2, antecedent2])) ||
-		(arePropFormulasStructurallyEqual([disjunct1, antecedent2]) &&
-			arePropFormulasStructurallyEqual([disjunct2, antecedent1]))
+		(arePropFormulasStructurallyEqual([disjunct1, antecedent2]) || arePropFormulasStructurallyEqual([disjunct2, antecedent1]))
 	);
 }

[Killed] ArrayDeclaration
src/propositional/validators/is-disjunction-elimination-applicable.ts:70:37
 		(arePropFormulasStructurallyEqual([disjunct1, antecedent1]) &&
 			arePropFormulasStructurallyEqual([disjunct2, antecedent2])) ||
 		(arePropFormulasStructurallyEqual([disjunct1, antecedent2]) &&
-			arePropFormulasStructurallyEqual([disjunct2, antecedent1]))
+			arePropFormulasStructurallyEqual([]))
 	);
 }
killedBy: isDisjunctionEliminationApplicable should return true when antecedents are in different order (swapped)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
