[Killed] ConditionalExpression
src/propositional/validators/is-disjunction-introduction-applicable.ts:15:9
 export function isDisjunctionIntroductionApplicable(
 	formulas: PropFormula[],
 ): boolean {
-	return formulas.length === 2;
+	return false;
 }
 
killedBy: NaturalProof addDerivedStep should add derived steps inside assumptions at nested level
statusReason: Error: Disjunction introduction is not applicable to the given formulas.
