[Killed] BlockStatement
src/propositional/validators/is-equivalence-elimination-applicable.ts:16:12
  */
 export function isEquivalenceEliminationApplicable(
 	formulas: PropFormula[],
-): boolean {
-	if (formulas.length === 0) {
-		return false;
-	}
-
-	return formulas.every((formula) => formula.operator === Operator.Equiv);
-}
+): boolean {}
 
killedBy: generateNaturalProofSteps should support equivalence elimination rule
statusReason: Error: Equivalence elimination is not applicable. All formulas must be equivalences.

[Killed] MethodExpression
src/propositional/validators/is-equivalence-elimination-applicable.ts:21:9
 		return false;
 	}
 
-	return formulas.every((formula) => formula.operator === Operator.Equiv);
+	return formulas.some(formula => formula.operator === Operator.Equiv);
 }
 
killedBy: isEquivalenceEliminationApplicable should return false if at least one formula is not an equivalence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/propositional/validators/is-equivalence-elimination-applicable.ts:21:37
 		return false;
 	}
 
-	return formulas.every((formula) => formula.operator === Operator.Equiv);
+	return formulas.every((formula) => formula.operator !== Operator.Equiv);
 }
 
killedBy: generateNaturalProofSteps should support equivalence elimination rule
statusReason: Error: Equivalence elimination is not applicable. All formulas must be equivalences.
