[Killed] BlockStatement
src/propositional/validators/is-implication-distribution-applicable.ts:14:73
  * @returns True if the formula matches the schema F => (G => H), false otherwise.
  * @category Validators
  */
-function isImplicationDistributionSchema(formula: PropFormula): boolean {
-	// Check if formula is F => (G => H)
-	// The outer operator must be an implication
-	if (formula.operator !== Operator.Implies) {
-		return false;
-	}
-
-	// The values must be an array with exactly 2 elements
-	if (!Array.isArray(formula.values) || formula.values.length !== 2) {
-		return false;
-	}
-
-	// The second element (consequent) must be an implication (G => H)
-	const consequent = formula.values[1];
-	if (
-		!Array.isArray(consequent.values) ||
-		consequent.operator !== Operator.Implies ||
-		consequent.values.length !== 2
-	) {
-		return false;
-	}
-
-	return true;
-}
+function isImplicationDistributionSchema(formula: PropFormula): boolean {}
 
 /**
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Killed] EqualityOperator
src/propositional/validators/is-implication-distribution-applicable.ts:17:6
 function isImplicationDistributionSchema(formula: PropFormula): boolean {
 	// Check if formula is F => (G => H)
 	// The outer operator must be an implication
-	if (formula.operator !== Operator.Implies) {
+	if (formula.operator === Operator.Implies) {
 		return false;
 	}
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Killed] ConditionalExpression
src/propositional/validators/is-implication-distribution-applicable.ts:17:6
 function isImplicationDistributionSchema(formula: PropFormula): boolean {
 	// Check if formula is F => (G => H)
 	// The outer operator must be an implication
-	if (formula.operator !== Operator.Implies) {
+	if (true) {
 		return false;
 	}
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Killed] BooleanLiteral
src/propositional/validators/is-implication-distribution-applicable.ts:18:10
 	// Check if formula is F => (G => H)
 	// The outer operator must be an implication
 	if (formula.operator !== Operator.Implies) {
-		return false;
+		return true;
 	}
 
killedBy: isImplicationDistributionApplicable should return false if the formula is not an implication
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/propositional/validators/is-implication-distribution-applicable.ts:22:6
 	}
 
 	// The values must be an array with exactly 2 elements
-	if (!Array.isArray(formula.values) || formula.values.length !== 2) {
+	if (Array.isArray(formula.values) || formula.values.length !== 2) {
 		return false;
 	}
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Killed] EqualityOperator
src/propositional/validators/is-implication-distribution-applicable.ts:22:40
 	}
 
 	// The values must be an array with exactly 2 elements
-	if (!Array.isArray(formula.values) || formula.values.length !== 2) {
+	if (!Array.isArray(formula.values) || formula.values.length === 2) {
 		return false;
 	}
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Killed] BooleanLiteral
src/propositional/validators/is-implication-distribution-applicable.ts:23:10
 
 	// The values must be an array with exactly 2 elements
 	if (!Array.isArray(formula.values) || formula.values.length !== 2) {
-		return false;
+		return true;
 	}
 
killedBy: isImplicationDistributionApplicable should return false when values property contains more than two elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/propositional/validators/is-implication-distribution-applicable.ts:29:3
 	// The second element (consequent) must be an implication (G => H)
 	const consequent = formula.values[1];
 	if (
-		!Array.isArray(consequent.values) ||
-		consequent.operator !== Operator.Implies ||
-		consequent.values.length !== 2
+		(!Array.isArray(consequent.values) || consequent.operator !== Operator.Implies) && consequent.values.length !== 2
 	) {
 		return false;
killedBy: isImplicationDistributionApplicable should return false if the consequent is an implication with wrong number of values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/propositional/validators/is-implication-distribution-applicable.ts:29:3
 	// The second element (consequent) must be an implication (G => H)
 	const consequent = formula.values[1];
 	if (
-		!Array.isArray(consequent.values) ||
+		Array.isArray(consequent.values) ||
 		consequent.operator !== Operator.Implies ||
 		consequent.values.length !== 2
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Killed] EqualityOperator
src/propositional/validators/is-implication-distribution-applicable.ts:30:3
 	const consequent = formula.values[1];
 	if (
 		!Array.isArray(consequent.values) ||
-		consequent.operator !== Operator.Implies ||
+		consequent.operator === Operator.Implies ||
 		consequent.values.length !== 2
 	) {
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Survived] ConditionalExpression
src/propositional/validators/is-implication-distribution-applicable.ts:30:3
 	const consequent = formula.values[1];
 	if (
 		!Array.isArray(consequent.values) ||
-		consequent.operator !== Operator.Implies ||
+		false ||
 		consequent.values.length !== 2
 	) {

[Killed] ConditionalExpression
src/propositional/validators/is-implication-distribution-applicable.ts:31:3
 	if (
 		!Array.isArray(consequent.values) ||
 		consequent.operator !== Operator.Implies ||
-		consequent.values.length !== 2
+		false
 	) {
 		return false;
killedBy: isImplicationDistributionApplicable should return false if the consequent is an implication with wrong number of values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/propositional/validators/is-implication-distribution-applicable.ts:31:3
 	if (
 		!Array.isArray(consequent.values) ||
 		consequent.operator !== Operator.Implies ||
-		consequent.values.length !== 2
+		consequent.values.length === 2
 	) {
 		return false;
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Killed] BlockStatement
src/propositional/validators/is-implication-distribution-applicable.ts:32:4
 		!Array.isArray(consequent.values) ||
 		consequent.operator !== Operator.Implies ||
 		consequent.values.length !== 2
-	) {
-		return false;
-	}
+	) {}
 
 	return true;
killedBy: isImplicationDistributionApplicable should return false if the consequent is not an implication
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/propositional/validators/is-implication-distribution-applicable.ts:51:12
  */
 export function isImplicationDistributionApplicable(
 	formulas: PropFormula[],
-): boolean {
-	// At least one formula is required
-	if (formulas.length === 0) {
-		return false;
-	}
-
-	// All formulas must satisfy the implication distribution schema
-	return formulas.every(isImplicationDistributionSchema);
-}
+): boolean {}
 
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Killed] ConditionalExpression
src/propositional/validators/is-implication-distribution-applicable.ts:53:6
 	formulas: PropFormula[],
 ): boolean {
 	// At least one formula is required
-	if (formulas.length === 0) {
+	if (true) {
 		return false;
 	}
killedBy: generateProofSteps should generate a derived step using implication distribution
statusReason: Error: Implication distribution requires each formula to have the form F => (G => H).

[Killed] BlockStatement
src/propositional/validators/is-implication-distribution-applicable.ts:53:29
 	formulas: PropFormula[],
 ): boolean {
 	// At least one formula is required
-	if (formulas.length === 0) {
-		return false;
-	}
+	if (formulas.length === 0) {}
 
 	// All formulas must satisfy the implication distribution schema
killedBy: isImplicationDistributionApplicable should return false for an empty array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/propositional/validators/is-implication-distribution-applicable.ts:58:9
 	}
 
 	// All formulas must satisfy the implication distribution schema
-	return formulas.every(isImplicationDistributionSchema);
+	return formulas.some(isImplicationDistributionSchema);
 }
 
killedBy: isImplicationDistributionApplicable should return false if one formula does not satisfy the schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
