[Killed] BlockStatement
src/propositional/validators/is-implication-elimination-applicable.ts:19:12
  */
 export function isImplicationEliminationApplicable(
 	formulas: PropFormula[],
-): boolean {
-	if (formulas.length !== 2) return false;
-	const [formula1, formula2] = formulas;
-
-	const checkImplication = (
-		implication: PropFormula,
-		antecedent: PropFormula,
-	) =>
-		implication.operator === Operator.Implies &&
-		Array.isArray(implication.values) &&
-		implication.values.length === 2 &&
-		arePropFormulasStructurallyEqual([implication.values[0], antecedent]);
-
-	return (
-		checkImplication(formula1, formula2) || checkImplication(formula2, formula1)
-	);
-}
+): boolean {}
 
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
src/propositional/validators/is-implication-elimination-applicable.ts:20:6
 export function isImplicationEliminationApplicable(
 	formulas: PropFormula[],
 ): boolean {
-	if (formulas.length !== 2) return false;
+	if (true) return false;
 	const [formula1, formula2] = formulas;
 
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Killed] EqualityOperator
src/propositional/validators/is-implication-elimination-applicable.ts:20:6
 export function isImplicationEliminationApplicable(
 	formulas: PropFormula[],
 ): boolean {
-	if (formulas.length !== 2) return false;
+	if (formulas.length === 2) return false;
 	const [formula1, formula2] = formulas;
 
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Killed] ArrowFunction
src/propositional/validators/is-implication-elimination-applicable.ts:23:27
 	if (formulas.length !== 2) return false;
 	const [formula1, formula2] = formulas;
 
-	const checkImplication = (
-		implication: PropFormula,
-		antecedent: PropFormula,
-	) =>
-		implication.operator === Operator.Implies &&
-		Array.isArray(implication.values) &&
-		implication.values.length === 2 &&
-		arePropFormulasStructurallyEqual([implication.values[0], antecedent]);
+	const checkImplication = () => undefined;
 
 	return (
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Killed] LogicalOperator
src/propositional/validators/is-implication-elimination-applicable.ts:27:3
 		implication: PropFormula,
 		antecedent: PropFormula,
 	) =>
-		implication.operator === Operator.Implies &&
-		Array.isArray(implication.values) &&
-		implication.values.length === 2 &&
-		arePropFormulasStructurallyEqual([implication.values[0], antecedent]);
+		implication.operator === Operator.Implies && Array.isArray(implication.values) && implication.values.length === 2 || arePropFormulasStructurallyEqual([implication.values[0], antecedent]);
 
 	return (
killedBy: implicationEliminationRule should throw an error if no matching antecedent is found
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Implication elimination is not applicable to the given formulas."

Received function did not throw

[Killed] LogicalOperator
src/propositional/validators/is-implication-elimination-applicable.ts:27:3
 		implication: PropFormula,
 		antecedent: PropFormula,
 	) =>
-		implication.operator === Operator.Implies &&
-		Array.isArray(implication.values) &&
-		implication.values.length === 2 &&
+		implication.operator === Operator.Implies && Array.isArray(implication.values) || implication.values.length === 2 &&
 		arePropFormulasStructurallyEqual([implication.values[0], antecedent]);
 
killedBy: isImplicationEliminationApplicable should return false if there is no implication
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/propositional/validators/is-implication-elimination-applicable.ts:29:3
 	) =>
 		implication.operator === Operator.Implies &&
 		Array.isArray(implication.values) &&
-		implication.values.length === 2 &&
+		implication.values.length !== 2 &&
 		arePropFormulasStructurallyEqual([implication.values[0], antecedent]);
 
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Survived] ConditionalExpression
src/propositional/validators/is-implication-elimination-applicable.ts:29:3
 	) =>
 		implication.operator === Operator.Implies &&
 		Array.isArray(implication.values) &&
-		implication.values.length === 2 &&
+		true &&
 		arePropFormulasStructurallyEqual([implication.values[0], antecedent]);
 

[Killed] ArrayDeclaration
src/propositional/validators/is-implication-elimination-applicable.ts:30:36
 		implication.operator === Operator.Implies &&
 		Array.isArray(implication.values) &&
 		implication.values.length === 2 &&
-		arePropFormulasStructurallyEqual([implication.values[0], antecedent]);
+		arePropFormulasStructurallyEqual([]);
 
 	return (
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Killed] LogicalOperator
src/propositional/validators/is-implication-elimination-applicable.ts:33:3
 		arePropFormulasStructurallyEqual([implication.values[0], antecedent]);
 
 	return (
-		checkImplication(formula1, formula2) || checkImplication(formula2, formula1)
+		checkImplication(formula1, formula2) && checkImplication(formula2, formula1)
 	);
 }
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Implication elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
src/propositional/validators/is-implication-elimination-applicable.ts:33:3
 		arePropFormulasStructurallyEqual([implication.values[0], antecedent]);
 
 	return (
-		checkImplication(formula1, formula2) || checkImplication(formula2, formula1)
+		false
 	);
 }
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Implication elimination is not applicable to the given formulas.
