[Killed] BlockStatement
src/propositional/validators/is-implication-reversal-applicable.ts:17:45
 function isImplicationReversalSchema(formula: PropFormula): boolean {
 	// Check if formula is ¬F => ¬G
 	// The outer operator must be an implication
-	if (formula.operator !== Operator.Implies) {
-		return false;
-	}
+	if (formula.operator !== Operator.Implies) {}
 
 	// The values must be an array with exactly 2 elements
killedBy: isImplicationReversalApplicable should return false if the formula is not an implication
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/validators/is-implication-reversal-applicable.ts:31:3
 
 	// Both antecedent and consequent must be negations (¬F and ¬G)
 	if (
-		!Array.isArray(antecedent.values) ||
-		antecedent.operator !== Operator.Not ||
-		antecedent.values.length !== 1
+		false
 	) {
 		return false;
killedBy: isImplicationReversalApplicable should return false if antecedent is not a negation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/validators/is-implication-reversal-applicable.ts:31:3
 
 	// Both antecedent and consequent must be negations (¬F and ¬G)
 	if (
-		!Array.isArray(antecedent.values) ||
-		antecedent.operator !== Operator.Not ||
+		false ||
 		antecedent.values.length !== 1
 	) {
killedBy: isImplicationReversalApplicable should return false if antecedent is not a negation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/propositional/validators/is-implication-reversal-applicable.ts:32:3
 	// Both antecedent and consequent must be negations (¬F and ¬G)
 	if (
 		!Array.isArray(antecedent.values) ||
-		antecedent.operator !== Operator.Not ||
+		antecedent.operator === Operator.Not ||
 		antecedent.values.length !== 1
 	) {
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: Error: Implication reversal requires each formula to have the form ¬F => ¬G.

[Killed] ConditionalExpression
src/propositional/validators/is-implication-reversal-applicable.ts:32:3
 	// Both antecedent and consequent must be negations (¬F and ¬G)
 	if (
 		!Array.isArray(antecedent.values) ||
-		antecedent.operator !== Operator.Not ||
+		false ||
 		antecedent.values.length !== 1
 	) {
killedBy: isImplicationReversalApplicable should return false if antecedent is not a negation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/propositional/validators/is-implication-reversal-applicable.ts:33:3
 	if (
 		!Array.isArray(antecedent.values) ||
 		antecedent.operator !== Operator.Not ||
-		antecedent.values.length !== 1
+		antecedent.values.length === 1
 	) {
 		return false;
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: Error: Implication reversal requires each formula to have the form ¬F => ¬G.

[Killed] ConditionalExpression
src/propositional/validators/is-implication-reversal-applicable.ts:33:3
 	if (
 		!Array.isArray(antecedent.values) ||
 		antecedent.operator !== Operator.Not ||
-		antecedent.values.length !== 1
+		false
 	) {
 		return false;
killedBy: isImplicationReversalApplicable should return false if antecedent negation has no inner formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/propositional/validators/is-implication-reversal-applicable.ts:34:4
 		!Array.isArray(antecedent.values) ||
 		antecedent.operator !== Operator.Not ||
 		antecedent.values.length !== 1
-	) {
-		return false;
-	}
+	) {}
 
 	if (
killedBy: isImplicationReversalApplicable should return false if antecedent is not a negation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/validators/is-implication-reversal-applicable.ts:39:3
 	}
 
 	if (
-		!Array.isArray(consequent.values) ||
-		consequent.operator !== Operator.Not ||
-		consequent.values.length !== 1
+		false
 	) {
 		return false;
killedBy: isImplicationReversalApplicable should return false if consequent is not a negation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/validators/is-implication-reversal-applicable.ts:39:3
 	}
 
 	if (
-		!Array.isArray(consequent.values) ||
-		consequent.operator !== Operator.Not ||
+		false ||
 		consequent.values.length !== 1
 	) {
killedBy: isImplicationReversalApplicable should return false if consequent is not a negation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/propositional/validators/is-implication-reversal-applicable.ts:40:3
 
 	if (
 		!Array.isArray(consequent.values) ||
-		consequent.operator !== Operator.Not ||
+		consequent.operator === Operator.Not ||
 		consequent.values.length !== 1
 	) {
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: Error: Implication reversal requires each formula to have the form ¬F => ¬G.

[Killed] ConditionalExpression
src/propositional/validators/is-implication-reversal-applicable.ts:40:3
 
 	if (
 		!Array.isArray(consequent.values) ||
-		consequent.operator !== Operator.Not ||
+		false ||
 		consequent.values.length !== 1
 	) {
killedBy: isImplicationReversalApplicable should return false if consequent is not a negation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/propositional/validators/is-implication-reversal-applicable.ts:41:3
 	if (
 		!Array.isArray(consequent.values) ||
 		consequent.operator !== Operator.Not ||
-		consequent.values.length !== 1
+		consequent.values.length === 1
 	) {
 		return false;
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: Error: Implication reversal requires each formula to have the form ¬F => ¬G.

[Killed] ConditionalExpression
src/propositional/validators/is-implication-reversal-applicable.ts:41:3
 	if (
 		!Array.isArray(consequent.values) ||
 		consequent.operator !== Operator.Not ||
-		consequent.values.length !== 1
+		false
 	) {
 		return false;
killedBy: isImplicationReversalApplicable should return false if consequent negation has no inner formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/propositional/validators/is-implication-reversal-applicable.ts:42:4
 		!Array.isArray(consequent.values) ||
 		consequent.operator !== Operator.Not ||
 		consequent.values.length !== 1
-	) {
-		return false;
-	}
+	) {}
 
 	return true;
killedBy: isImplicationReversalApplicable should return false if consequent is not a negation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/propositional/validators/is-implication-reversal-applicable.ts:61:12
  */
 export function isImplicationReversalApplicable(
 	formulas: PropFormula[],
-): boolean {
-	// At least one formula is required
-	if (formulas.length === 0) {
-		return false;
-	}
-
-	// All formulas must satisfy the implication reversal schema
-	return formulas.every(isImplicationReversalSchema);
-}
+): boolean {}
 
killedBy: generateProofSteps should generate a derived step using implication reversal
statusReason: Error: Implication reversal requires each formula to have the form ¬F => ¬G.

[Killed] ConditionalExpression
src/propositional/validators/is-implication-reversal-applicable.ts:63:6
 	formulas: PropFormula[],
 ): boolean {
 	// At least one formula is required
-	if (formulas.length === 0) {
+	if (false) {
 		return false;
 	}
killedBy: isImplicationReversalApplicable should return false for an empty array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/propositional/validators/is-implication-reversal-applicable.ts:68:9
 	}
 
 	// All formulas must satisfy the implication reversal schema
-	return formulas.every(isImplicationReversalSchema);
+	return formulas.some(isImplicationReversalSchema);
 }
 
killedBy: isImplicationReversalApplicable should return false if one formula does not satisfy the schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
