[Killed] BlockStatement
src/propositional/validators/is-negation-elimination-applicable.ts:16:12
  */
 export function isNegationEliminationApplicable(
 	formulas: PropFormula[],
-): boolean {
-	if (formulas.length === 0) {
-		return false;
-	}
-
-	return formulas.every(
-		(formula) =>
-			formula.operator === Operator.Not &&
-			Array.isArray(formula.values) &&
-			formula.values.length === 1 &&
-			(formula.values[0] as PropFormula).operator === Operator.Not,
-	);
-}
+): boolean {}
 
killedBy: generateNaturalProofSteps should support negation elimination rule
statusReason: Error: Negation elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
src/propositional/validators/is-negation-elimination-applicable.ts:17:6
 export function isNegationEliminationApplicable(
 	formulas: PropFormula[],
 ): boolean {
-	if (formulas.length === 0) {
+	if (true) {
 		return false;
 	}
killedBy: generateNaturalProofSteps should support negation elimination rule
statusReason: Error: Negation elimination is not applicable to the given formulas.

[Killed] EqualityOperator
src/propositional/validators/is-negation-elimination-applicable.ts:17:6
 export function isNegationEliminationApplicable(
 	formulas: PropFormula[],
 ): boolean {
-	if (formulas.length === 0) {
+	if (formulas.length !== 0) {
 		return false;
 	}
killedBy: generateNaturalProofSteps should support negation elimination rule
statusReason: Error: Negation elimination is not applicable to the given formulas.

[Killed] MethodExpression
src/propositional/validators/is-negation-elimination-applicable.ts:21:9
 		return false;
 	}
 
-	return formulas.every(
-		(formula) =>
-			formula.operator === Operator.Not &&
-			Array.isArray(formula.values) &&
-			formula.values.length === 1 &&
-			(formula.values[0] as PropFormula).operator === Operator.Not,
-	);
+	return formulas.some(formula => formula.operator === Operator.Not && Array.isArray(formula.values) && formula.values.length === 1 && (formula.values[0] as PropFormula).operator === Operator.Not);
 }
 
killedBy: isNegationEliminationApplicable should return false if at least one formula does not have exactly two negations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/propositional/validators/is-negation-elimination-applicable.ts:22:3
 	}
 
 	return formulas.every(
-		(formula) =>
-			formula.operator === Operator.Not &&
-			Array.isArray(formula.values) &&
-			formula.values.length === 1 &&
-			(formula.values[0] as PropFormula).operator === Operator.Not,
+		() => undefined,
 	);
 }
killedBy: generateNaturalProofSteps should support negation elimination rule
statusReason: Error: Negation elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
src/propositional/validators/is-negation-elimination-applicable.ts:23:4
 
 	return formulas.every(
 		(formula) =>
-			formula.operator === Operator.Not &&
-			Array.isArray(formula.values) &&
-			formula.values.length === 1 &&
-			(formula.values[0] as PropFormula).operator === Operator.Not,
+			false,
 	);
 }
killedBy: generateNaturalProofSteps should support negation elimination rule
statusReason: Error: Negation elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
src/propositional/validators/is-negation-elimination-applicable.ts:23:4
 
 	return formulas.every(
 		(formula) =>
-			formula.operator === Operator.Not &&
-			Array.isArray(formula.values) &&
-			formula.values.length === 1 &&
-			(formula.values[0] as PropFormula).operator === Operator.Not,
+			true,
 	);
 }
killedBy: isNegationEliminationApplicable should return false if at least one formula does not have exactly two negations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/propositional/validators/is-negation-elimination-applicable.ts:25:4
 		(formula) =>
 			formula.operator === Operator.Not &&
 			Array.isArray(formula.values) &&
-			formula.values.length === 1 &&
+			formula.values.length !== 1 &&
 			(formula.values[0] as PropFormula).operator === Operator.Not,
 	);
killedBy: generateNaturalProofSteps should support negation elimination rule
statusReason: Error: Negation elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
src/propositional/validators/is-negation-elimination-applicable.ts:25:4
 		(formula) =>
 			formula.operator === Operator.Not &&
 			Array.isArray(formula.values) &&
-			formula.values.length === 1 &&
+			true &&
 			(formula.values[0] as PropFormula).operator === Operator.Not,
 	);
killedBy: isNegationEliminationApplicable should return false when values has wrong length for outer Not
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/propositional/validators/is-negation-elimination-applicable.ts:26:4
 			formula.operator === Operator.Not &&
 			Array.isArray(formula.values) &&
 			formula.values.length === 1 &&
-			(formula.values[0] as PropFormula).operator === Operator.Not,
+			(formula.values[0] as PropFormula).operator !== Operator.Not,
 	);
 }
killedBy: generateNaturalProofSteps should support negation elimination rule
statusReason: Error: Negation elimination is not applicable to the given formulas.

[Killed] ConditionalExpression
src/propositional/validators/is-negation-elimination-applicable.ts:26:4
 			formula.operator === Operator.Not &&
 			Array.isArray(formula.values) &&
 			formula.values.length === 1 &&
-			(formula.values[0] as PropFormula).operator === Operator.Not,
+			true,
 	);
 }
killedBy: isNegationEliminationApplicable should return false if at least one formula does not have exactly two negations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
