[Killed] ConditionalExpression
src/propositional/validators/is-negation-introduction-applicable.ts:19:6
 export function isNegationIntroductionApplicable(
 	formulas: PropFormula[],
 ): boolean {
-	if (formulas.length !== 2) {
+	if (true) {
 		return false;
 	}
killedBy: isNegationIntroductionApplicable should return true for two implications with the same antecedent and negated consequents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-negation-introduction-applicable.ts:26:3
 	const [formula1, formula2] = formulas;
 
 	if (
-		formula1.operator !== Operator.Implies ||
-		formula2.operator !== Operator.Implies
+		true
 	) {
 		return false;
killedBy: isNegationIntroductionApplicable should return true for two implications with the same antecedent and negated consequents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-negation-introduction-applicable.ts:35:6
 	const [antecedent1, consequent1] = formula1.values as PropFormula[];
 	const [antecedent2, consequent2] = formula2.values as PropFormula[];
 
-	if (!arePropFormulasStructurallyEqual([antecedent1, antecedent2])) {
+	if (false) {
 		return false;
 	}
killedBy: isNegationIntroductionApplicable should return false if antecedents are not structurally equal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/propositional/validators/is-negation-introduction-applicable.ts:35:69
 	const [antecedent1, consequent1] = formula1.values as PropFormula[];
 	const [antecedent2, consequent2] = formula2.values as PropFormula[];
 
-	if (!arePropFormulasStructurallyEqual([antecedent1, antecedent2])) {
-		return false;
-	}
+	if (!arePropFormulasStructurallyEqual([antecedent1, antecedent2])) {}
 
 	return (
killedBy: isNegationIntroductionApplicable should return false if antecedents are not structurally equal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/propositional/validators/is-negation-introduction-applicable.ts:36:10
 	const [antecedent2, consequent2] = formula2.values as PropFormula[];
 
 	if (!arePropFormulasStructurallyEqual([antecedent1, antecedent2])) {
-		return false;
+		return true;
 	}
 
killedBy: isNegationIntroductionApplicable should return false if antecedents are not structurally equal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/validators/is-negation-introduction-applicable.ts:40:3
 	}
 
 	return (
-		(consequent1.operator === Operator.Not &&
-			arePropFormulasStructurallyEqual([
-				consequent1.values[0] as PropFormula,
-				consequent2,
-			])) ||
-		(consequent2.operator === Operator.Not &&
-			arePropFormulasStructurallyEqual([
-				consequent2.values[0] as PropFormula,
-				consequent1,
-			]))
+		false
 	);
 }
killedBy: isNegationIntroductionApplicable should return true for two implications with the same antecedent and negated consequents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/propositional/validators/is-negation-introduction-applicable.ts:40:4
 	}
 
 	return (
-		(consequent1.operator === Operator.Not &&
+		(consequent1.operator !== Operator.Not &&
 			arePropFormulasStructurallyEqual([
 				consequent1.values[0] as PropFormula,
killedBy: isNegationIntroductionApplicable should return true when negation is in the first formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrayDeclaration
src/propositional/validators/is-negation-introduction-applicable.ts:41:37
 
 	return (
 		(consequent1.operator === Operator.Not &&
-			arePropFormulasStructurallyEqual([
-				consequent1.values[0] as PropFormula,
-				consequent2,
-			])) ||
+			arePropFormulasStructurallyEqual([])) ||
 		(consequent2.operator === Operator.Not &&
 			arePropFormulasStructurallyEqual([
killedBy: isNegationIntroductionApplicable should return true when negation is in the first formula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/propositional/validators/is-negation-introduction-applicable.ts:45:4
 				consequent1.values[0] as PropFormula,
 				consequent2,
 			])) ||
-		(consequent2.operator === Operator.Not &&
+		(consequent2.operator !== Operator.Not &&
 			arePropFormulasStructurallyEqual([
 				consequent2.values[0] as PropFormula,
killedBy: isNegationIntroductionApplicable should return true for two implications with the same antecedent and negated consequents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/propositional/validators/is-negation-introduction-applicable.ts:45:4
 				consequent1.values[0] as PropFormula,
 				consequent2,
 			])) ||
-		(consequent2.operator === Operator.Not &&
-			arePropFormulasStructurallyEqual([
-				consequent2.values[0] as PropFormula,
-				consequent1,
-			]))
+		(false)
 	);
 }
killedBy: isNegationIntroductionApplicable should return true for two implications with the same antecedent and negated consequents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
