[Killed] BooleanLiteral
src/propositional/validators/is-well-formed-formula.ts:19:38
  * @category Validators
  */
 export function isWellFormedFormula(expression: PropExpression): boolean {
-	if (expression.length === 0) return false;
+	if (expression.length === 0) return true;
 
 	let index = 0;
killedBy: isWellFormedFormula should return false for empty input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:19:6
  * @category Validators
  */
 export function isWellFormedFormula(expression: PropExpression): boolean {
-	if (expression.length === 0) return false;
+	if (false) return false;
 
 	let index = 0;

[Killed] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:24:7
 	let index = 0;
 
 	function parseWFF(): boolean {
-		if (isEndOfExpression()) return false;
+		if (false) return false;
 
 		if (isVariable(expression[index])) {
killedBy: isWellFormedFormula should return false for negation without following formula
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Timeout] BooleanLiteral
src/propositional/validators/is-well-formed-formula.ts:24:35
 	let index = 0;
 
 	function parseWFF(): boolean {
-		if (isEndOfExpression()) return false;
+		if (isEndOfExpression()) return true;
 
 		if (isVariable(expression[index])) {

[Killed] BlockStatement
src/propositional/validators/is-well-formed-formula.ts:30:38
 			return parseVariable();
 		}
 
-		if (isNegation(expression[index])) {
-			return parseNegation();
-		}
+		if (isNegation(expression[index])) {}
 
 		if (isParenthesizedExpression(expression[index])) {
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Invalid propositional expression: Not a well-formed formula (WFF).

[Killed] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:30:7
 			return parseVariable();
 		}
 
-		if (isNegation(expression[index])) {
+		if (false) {
 			return parseNegation();
 		}
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Invalid propositional expression: Not a well-formed formula (WFF).

[Timeout] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:34:7
 			return parseNegation();
 		}
 
-		if (isParenthesizedExpression(expression[index])) {
+		if (true) {
 			return parseParenthesizedExpression();
 		}

[Killed] BlockStatement
src/propositional/validators/is-well-formed-formula.ts:46:36
 		return true;
 	}
 
-	function parseNegation(): boolean {
-		index++; // Consume "~"
-		return parseWFF(); // Negation must be followed by a valid WFF
-	}
+	function parseNegation(): boolean {}
 
 	function parseParenthesizedExpression(): boolean {
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Invalid propositional expression: Not a well-formed formula (WFF).

[Timeout] UpdateOperator
src/propositional/validators/is-well-formed-formula.ts:47:3
 	}
 
 	function parseNegation(): boolean {
-		index++; // Consume "~"
+		index--; // Consume "~"
 		return parseWFF(); // Negation must be followed by a valid WFF
 	}

[Survived] BooleanLiteral
src/propositional/validators/is-well-formed-formula.ts:54:27
 	function parseParenthesizedExpression(): boolean {
 		index++; // Consume "("
 
-		if (!parseWFF()) return false; // First WFF must exist
+		if (!parseWFF()) return true; // First WFF must exist
 
 		if (isEndOfExpression() || !isBinaryOperator(expression[index]))

[Killed] LogicalOperator
src/propositional/validators/is-well-formed-formula.ts:56:7
 
 		if (!parseWFF()) return false; // First WFF must exist
 
-		if (isEndOfExpression() || !isBinaryOperator(expression[index]))
+		if (isEndOfExpression() && !isBinaryOperator(expression[index]))
 			return false;
 		index++; // Consume operator
killedBy: isWellFormedFormula should return false for misplaced negations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:56:7
 
 		if (!parseWFF()) return false; // First WFF must exist
 
-		if (isEndOfExpression() || !isBinaryOperator(expression[index]))
+		if (false)
 			return false;
 		index++; // Consume operator
killedBy: isWellFormedFormula should return false for misplaced negations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/propositional/validators/is-well-formed-formula.ts:57:11
 		if (!parseWFF()) return false; // First WFF must exist
 
 		if (isEndOfExpression() || !isBinaryOperator(expression[index]))
-			return false;
+			return true;
 		index++; // Consume operator
 
killedBy: isWellFormedFormula should return false for unmatched opening parenthesis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] BooleanLiteral
src/propositional/validators/is-well-formed-formula.ts:60:27
 			return false;
 		index++; // Consume operator
 
-		if (!parseWFF()) return false; // Second WFF must exist
+		if (!parseWFF()) return true; // Second WFF must exist
 
 		if (isEndOfExpression() || !isClosingParenthesis(expression[index]))

[Killed] LogicalOperator
src/propositional/validators/is-well-formed-formula.ts:62:7
 
 		if (!parseWFF()) return false; // Second WFF must exist
 
-		if (isEndOfExpression() || !isClosingParenthesis(expression[index]))
+		if (isEndOfExpression() && !isClosingParenthesis(expression[index]))
 			return false;
 		index++; // Consume ")"
killedBy: createPropFormula Error handling - Invalid formulas should throw an error for unmatched parentheses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid propositional expression: Not a well-formed formula (WFF)."
Received message:   "Cannot read properties of undefined (reading 'atom')"

      190 |   } else {
      191 |     stryCov_9fa48("1144");
    > 192 |     return stryMutAct_9fa48("1147") ? symbol.atom[0] !== Glyph.CloseParenthesis : stryMutAct_9fa48("1146") ? false : s

[Survived] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:62:7
 
 		if (!parseWFF()) return false; // Second WFF must exist
 
-		if (isEndOfExpression() || !isClosingParenthesis(expression[index]))
+		if (false)
 			return false;
 		index++; // Consume ")"

[Killed] BooleanLiteral
src/propositional/validators/is-well-formed-formula.ts:63:11
 		if (!parseWFF()) return false; // Second WFF must exist
 
 		if (isEndOfExpression() || !isClosingParenthesis(expression[index]))
-			return false;
+			return true;
 		index++; // Consume ")"
 
killedBy: createPropFormula Error handling - Invalid formulas should throw an error for unmatched parentheses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid propositional expression: Not a well-formed formula (WFF)."
Received message:   "Invalid formula structure."

      124 |       }
      125 |     }
    > 126 |     throw new Error("Invalid formula structure.");

[Killed] BlockStatement
src/propositional/validators/is-well-formed-formula.ts:69:40
 		return true;
 	}
 
-	function isEndOfExpression(): boolean {
-		return index >= expression.length;
-	}
+	function isEndOfExpression(): boolean {}
 
 	const result = parseWFF();
killedBy: createPropFormula Error handling - Invalid formulas should throw an error for unmatched parentheses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid propositional expression: Not a well-formed formula (WFF)."
Received message:   "Cannot read properties of undefined (reading 'atom')"

      190 |   } else {
      191 |     stryCov_9fa48("1144");
    > 192 |     return stryMutAct_9fa48("1147") ? symbol.atom[0] !== Glyph.CloseParenthesis : stryMutAct_9fa48("1146") ? false : s

[Killed] EqualityOperator
src/propositional/validators/is-well-formed-formula.ts:70:10
 	}
 
 	function isEndOfExpression(): boolean {
-		return index >= expression.length;
+		return index > expression.length;
 	}
 
killedBy: createPropFormula Error handling - Invalid formulas should throw an error for unmatched parentheses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid propositional expression: Not a well-formed formula (WFF)."
Received message:   "Cannot read properties of undefined (reading 'atom')"

      190 |   } else {
      191 |     stryCov_9fa48("1144");
    > 192 |     return stryMutAct_9fa48("1147") ? symbol.atom[0] !== Glyph.CloseParenthesis : stryMutAct_9fa48("1146") ? false : s

[Killed] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:70:10
 	}
 
 	function isEndOfExpression(): boolean {
-		return index >= expression.length;
+		return false;
 	}
 
killedBy: createPropFormula Error handling - Invalid formulas should throw an error for unmatched parentheses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid propositional expression: Not a well-formed formula (WFF)."
Received message:   "Cannot read properties of undefined (reading 'atom')"

      190 |   } else {
      191 |     stryCov_9fa48("1144");
    > 192 |     return stryMutAct_9fa48("1147") ? symbol.atom[0] !== Glyph.CloseParenthesis : stryMutAct_9fa48("1146") ? false : s

[Killed] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:74:9
 	}
 
 	const result = parseWFF();
-	return result && index === expression.length; // Ensure full expression is parsed
+	return true; // Ensure full expression is parsed
 }
 
killedBy: createPropFormula Error handling - Invalid formulas should throw an error for invalid expressions without parentheses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid propositional expression: Not a well-formed formula (WFF)."
Received message:   "Invalid formula structure."

      124 |       }
      125 |     }
    > 126 |     throw new Error("Invalid formula structure.");

[Killed] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:74:19
 	}
 
 	const result = parseWFF();
-	return result && index === expression.length; // Ensure full expression is parsed
+	return result && true; // Ensure full expression is parsed
 }
 
killedBy: createPropFormula Error handling - Invalid formulas should throw an error for invalid expressions without parentheses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid propositional expression: Not a well-formed formula (WFF)."
Received message:   "Invalid formula structure."

      124 |       }
      125 |     }
    > 126 |     throw new Error("Invalid formula structure.");

[Timeout] BlockStatement
src/propositional/validators/is-well-formed-formula.ts:81:50
 	return symbol.type === GlyphType.Variable;
 }
 
-function isNegation(symbol: PropSymbol): boolean {
-	return symbol.atom[0] === Glyph.Negation;
-}
+function isNegation(symbol: PropSymbol): boolean {}
 
 function isParenthesizedExpression(symbol: PropSymbol): boolean {

[Killed] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:82:9
 }
 
 function isNegation(symbol: PropSymbol): boolean {
-	return symbol.atom[0] === Glyph.Negation;
+	return false;
 }
 
killedBy: NaturalProof integration scenarios should handle sub-proof nested inside another sub-proof with multiple steps
statusReason: Error: Invalid propositional expression: Not a well-formed formula (WFF).

[Survived] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:86:9
 }
 
 function isParenthesizedExpression(symbol: PropSymbol): boolean {
-	return symbol.atom[0] === Glyph.OpenParenthesis;
+	return true;
 }
 

[Killed] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:91:41
 
 function isBinaryOperator(symbol: PropSymbol): boolean {
 	return (
-		symbol.type === GlyphType.Operator && symbol.atom[0] !== Glyph.Negation
+		symbol.type === GlyphType.Operator && true
 	);
 }
killedBy: isWellFormedFormula should return false for misplaced negations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:91:3
 
 function isBinaryOperator(symbol: PropSymbol): boolean {
 	return (
-		symbol.type === GlyphType.Operator && symbol.atom[0] !== Glyph.Negation
+		true
 	);
 }
killedBy: isWellFormedFormula should return false for misplaced negations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ConditionalExpression
src/propositional/validators/is-well-formed-formula.ts:96:9
 }
 
 function isClosingParenthesis(symbol: PropSymbol): boolean {
-	return symbol.atom[0] === Glyph.CloseParenthesis;
+	return true;
 }
 
